<?
/*require_once('com/config.php');
require_once('com/func.php');
require_once('com/db.php');
require_once('bot/kernel.php');
require_once('com/tmhOAuth.php');
require_once('com/vkapi.class.php');

$db = new database();
$db->connect();*/
date_default_timezone_set ( 'Europe/Moscow' );
$fem=array('виргиния','аврора','агата','агафья','агнесса','агния','ада','аза','алевтина','александра','алина','алиса','алла','альбина','альфреа','анастасия','ангелина','анжелика','анжела','анита','анна','антонина','анфиса','арина','астра','беата','белла','берта','бета','богдана','борислава','бронислава','валентина','валерия','ванда','варвара','василиса','венера','вера','вероника','веста','виктория','виолетта','виталина','виталия','галина','гелена','гелла','генриетта','гертруда','глафира','глория','дайна','данута','дарья','джульета','диана','дина','доля','доминика','ева','евгения','евдокия','екатерина','елена','елизавета','жанна','зинаида','зоя','иветта','изабелла','изольда','инара','инга','инесса','инна','ирина','ирма','ия','камилла','капитолина','карина','каролина','катарина','кира','клавдия','клара','кристина','ксения','кузьма','козьма','лада','лайма','лариса','леся','лиана','лидия','лилия','лилиана','лина','лиана','лола','лолла','лолита','людмила','майя','маргарита','марианна','марина','мария','марта','марфа','милена','мирдза','мирра','муза','надежда','наталия','неонила','нила','никита','нина','нонна','нора','оксана','олеся','ольга','полина','прасковья','раиса','регина','рина','рената','римма','роза','розалия','роксана','руслана','руфина','савва','сарра','сара','светлана','серафима','софия','станислава','стелла','стефания','сусанна','сюзанна','таира','таисия','тамара','тамила','томила','татьяна','ульяна','фаина','фекла','флора','фома','франсуаза','фрида','христина','эдита','элеонора','эллина','эвелина','элина','эльвира','эльза','эмма','эмилия','эрика','юлия','юнона','ядвига','яна','ярослава');
$mail=array('абрам','авраам','ибрагил','аввакум','аввакуум','август','августин','аверьян','аверкий','агафон','адам','адольф','адриан','азарий','аким','алан','александр','алексей','альберт','альфред','анатолий','андрей','антон','аполлон','аристарх','аркадий','арнольд','арсений','арсен','артем','артур','архип','аскольд','афанасий','бенедикт','богдан','болеслав','борис','бронислав','вадим','валентин','валерий','вальтер','варлаам','варлам','василий','велор','велорий','венедикт','вениамин','виктор','вилен','вилли','виссарион','виталий','витольд','владимир','владислав','владлен','влас','власий','вольдемар','всеволод','вячеслав','гавриил','гарри','гаянэ','геннадий','георгий','герасим','герман','глеб','гордей','гордей','гордий','григорий','гурий','давид','даниил','демьян','денис','дмитрий','дональд','донат','евгений','евдоким','егор','елисей','емельян','ермак','ермолай','ефим','ефрем','захар','зиновий','иван','игнат','игнатий','игорь','илларион','илья','иннокентий','иосиф','осип','ипполит','ираклий','исаак','исак','казимир','карл','касьян','кассиан','ким','кирилл','клемент','клим','климент','кондрат','кондратий','константин','корней','корнелий','лавр','лаврентий','лазарь','лев','леонард','леонид','леонтий','лука','лукьян','любовь','любомир','людвиг','май','макар','максим','максимилиан','марк','мартин','мартын','матвей','мечеслав','мечислав','мирон','мирослав','митрофан','михаил','модест','моисей','мстислав','назарий','натан','наум','нелли','никифор','николай','нинель','нисон','овидий','олег','орест','осип','оскар','остап','павел','панкрат','панкратий','пантелей','пантелеймон','парамон','петр','платон','прохор','роберт','родион','роман','ростислав','рубен','рудольф','руслан','савелий','самуил','святослав','севастьян','семен','сергей','соломон','станислав','степан','тарас','терентий','тимофей','тимур','тихон','трофим','устин','юстин','юстиниан','федор','феликс','филипп','фрол','флор','харитон','эдуард','эльдар','эрик','эрнест','юлий','юлиан','юрий','яков','ян','ярослав','алекс');

function get_mail($nick,$type)
{
	global $db,$fem,$mail;
	do
	{
		$cont=parseUrlproxy('http://blogs.mail.ru/'.$type.'/'.$nick.'/info');
		if ($cont=='')
		{
			$attmp++;
			echo "\n".'continue...'."\n";
		}
	}
	while (($cont=='') && ($attmp<3));
	//$cont=parseUrl('http://blogs.mail.ru/'.$type.'/'.$nick.'/info');
	$cont=iconv('windows-1251','UTF-8',$cont);
	$regex='/<div class=\"pb5 pt10\">\s*?<b>(?<name>[^<]*?)<\/b>/isu';
	preg_match_all($regex,$cont,$out);
	$outmas['name']=$out['name'][0];
	$outmas['nick']=$nick;
	$mm=explode(' ',mb_strtolower($out['name'][0],'UTF-8'));
	$outmas['gender']=0;
	foreach ($mm as $item)
	{
		if (in_array($item,$fem))
		{
			$outmas['gender']=1;
			break;
		}
		if (in_array($item,$mail))
		{
			$outmas['gender']=2;
			break;
		}
	} 
	$regex='/<div class=\"gr\_1\">[^\<\>]*?(?<year>\d+)\s(лет|года|год|года)\.<\/div>/isu';
	preg_match_all($regex,$cont,$out);
	$outmas['age']=intval($out['year'][0]);
	$regex='/<div class\=\"pt5 sm gr\_1\">Местоположение\: (?<loc>[^<>]*?)<\/div>/isu';
	preg_match_all($regex,$cont,$out);
	$loc=$out['loc'][0];
	if ($loc!='')
	{
		$rru=$db->query("SELECT * FROM robot_location WHERE loc='".$loc."'");
		if (mysql_num_rows($rru)==0)
		{
			$content_tw_loc=parseUrl('http://geocode-maps.yandex.ru/1.x/?geocode='.urlencode($loc).'&key=ANpUFEkBAAAAf7jmJwMAHGZHrcKNDsbEqEVjEUtCmufxQMwAAAAAAAAAAAAvVrubVT4btztbduoIgTLAeFILaQ==&results=1');
			$regextw='/<pos>(?<loc_tw>.*?)<\/pos>/is';
			preg_match_all($regextw,$content_tw_loc,$out_tw);
			$rru=$db->query('INSERT INTO robot_location (loc,loc_coord) VALUES (\''.$loc.'\',\''.$out_tw['loc_tw'][0].'\')');
		}
		else
		{
			$rru1=$db->fetch($rru);
			$out_tw['loc_tw'][0]=$rru1['loc_coord'];
		}
	}
	if ($out_tw['loc_tw'][0]!='')
	{
		$regex='/(?<ch>\-?\d*?)\.(?<d>\d)/is';
		//echo $key;
		preg_match_all($regex,$out_tw['loc_tw'][0],$out);
		$twl=$out['ch'][0].'.'.$out['d'][0].' '.$out['ch'][1].'.'.$out['d'][1];
	}
	$outmas['loc']=$twl;
	$regex='/<tr>[\s]*?<td class\=\"gr bold\">Читателей\:<\/td>[\s]*?<td class\=\"gr\">(?<fol>\d+)<\/td>[\s]*?<\/tr>/isu';
	preg_match_all($regex,$cont,$out);
	$outmas['fol']=$out['fol'][0];
	$outmas['ico']='http://avt.foto.mail.ru/'.$type.'/'.$nick.'/_avatar180';
	//sleep(1);
	//print_r($outmas);
	return $outmas;
}
//$cont=parseUrl('http://188.120.239.225/getlist.php');
//$mproxy=json_decode($cont,true);
//get_mail('2007izdat','mail');
?>