<?php
/* 
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */


$wobot['destn'] = array(
'moskva'=>array('37.609218','55.753559'),
'sankt-peterburg'=>array('30.313497','59.938531'),
'ekaterinburg'=>array('60.617435','56.829748'),
'odessa'=>array('30.7058','46.466444'),
'kaluga'=>array('36.247686','54.535128'),
'minsk'=>array('27.696614','53.881961'),
'sevastopol'=>array('33.558616','44.585098'),
'astrahan'=>array('48.067419','46.316913'),
'krasnodar'=>array('38.963672','45.0141'),
'kiev'=>array('30.532685','50.40241'),
'harkov'=>array('36.280574','49.98776'),
'samara'=>array('50.19908','53.244418'),
'berestovitsa'=>array('24.380753','53.844627'),
'ulyanovsk'=>array('48.472015','54.316581'),
'pekin'=>array('116.323017','39.876918'),
'kishinev'=>array('28.838526','47.012925'),
'orenburg'=>array('55.09735','51.768099'),
'volgograd'=>array('44.51420799999999','48.708898'),
'donetsk'=>array('37.763791','47.992324'),
'kazan'=>array('49.122853','55.786764'),
'riga'=>array('24.099454','56.958257')
);

$wobot['cities']=array(
'moscow'=>'moskva',
'kyev'=>'kiev',
'ёбург'=>'ekaterinburg',
'kharkov'=>'harkov',
'beijing'=>'pekin',
'москва'=>'moskva',
'санкт-петербург'=>'sankt-peterburg',
'saint petersburg'=>'sankt-peterburg',
'saint-p'=>'sankt-peterburg',
'st. petersburg'=>'sankt-peterburg',
'spb'=>'sankt-peterburg',
'екатеринбург'=>'ekaterinburg',
'одесса'=>'odessa',
'калуга'=>'kaluga',
'минск'=>'minsk',
'севастополь'=>'sevastopol',
'астрахань'=>'astrahan',
'краснодар'=>'krasnodar',
'киев'=>'kiev',
'харьков'=>'harkov',
'самара'=>'samara',
'берестовица'=>'berestovitsa',
'ульяновск'=>'ulyanovsk',
'пекин'=>'pekin',
'кишинев'=>'kishinev',
'оренбург'=>'orenburg',
'волгоград'=>'volgograd',
'казань'=>'kazan',
'питер'=>'sankt-peterburg',
'минская область'=>'minsk',
'russian'=>'moskva',
'russia'=>'moskva',
'belarus'=>'minsk',
'ukraine'=>'kiev',
'донецк'=>'donetsk',
'рига'=>'riga'
);

function menu()
{
    global $html_out;
    $html_out.= '';/*'<!--
<p class="menuitem">Рекламные компании</p>
<p class="menuitem">
    <a href="#" class="menuevent" rel="company/list"><img src="img/list.png" class="menuicon" alt=" title=""></a>
    <a href="#" class="menuevent" rel="company/add"><img src="img/add.png" class="menuicon" alt=" title=""></a>
</p>
<p class="menuitem">Пользователи</p>
<p class="menuitem">
    <a href="#" class="menuevent" rel="user/list"><img src="img/list.png" class="menuicon" alt=" title=""></a>
    <a href="#" class="menuevent" rel="user/add"><img src="img/add.png" class="menuicon" alt=" title=""></a>
</p>-->
<p class="menuitem">Дамп сайтов</p>
<p class="menuitem">
    <a href="#" class="menuevent" rel="monitor/list"><img src="img/list.png" class="menuicon" alt=" title=""></a>
    <a href="#" class="menuevent" rel="monitor/add"><img src="img/add.png" class="menuicon" alt=" title=""></a>
</p>
<p class="menuitem">Блоги</p>
<p class="menuitem">
    <a href="#" class="menuevent" rel="blog/search"><img src="img/search.png" class="menuicon" alt=" title=""></a>
</p>'
<p class="menuitem">Услуги</p>
<p class="menuitem">
    <a href="#" class="menuevent" rel="user/office"><img src="img/list.png" class="menuicon" alt=" title=""></a>
    <a href="#" class="menuevent" rel="user/blank"><img src="img/add.png" class="menuicon" alt=" title=""></a>
</p>
</td>
<td style="vertical-align: top;">
<div id="cntnt" class="cntnt">
';*/
}

    function deleteDirectory($dir) {
        if (!file_exists($dir)) return true;
        if (!is_dir($dir)) return unlink($dir);
        foreach (scandir($dir) as $item) {
            if ($item == '.' || $item == '..') continue;
            if (!deleteDirectory($dir.DIRECTORY_SEPARATOR.$item)) return false;
        }
        return rmdir($dir);
    }

function getkeyword($keyw,$klink)
{
	//$_GET['link']="http://twitter.com/blog_medvedev";
	//echo $klink;
	$word=$keyw;
	$cont=parseUrl($klink);
	//echo $cont;
	preg_match('/charset=([-a-z0-9_]+)/is',$cont,$charset);
	if (($charset[1]=="utf-8") || ($charset[1]=="UTF-8"))
	{
	/*$pat="/<[^<]*>[^<]*?(".$word.")[^<]*?<\/[^<]*?>/";*/
		$pat="/(>[^<]*?)(".$word.")([^<]*?)/is";	
	}
	else
	{
		$pat="/(>[^<]*?)(".$word.")([^<]*?)/is";	
	}
	$rep='$1<b style="color:white;background-color: #83b226; -moz-border-radius: 10px; padding: 5px;">$2</b>$3';
	//echo $cont;
	$text=preg_replace($pat, $rep, $cont);
	//echo $text;
	if (($charset[1]=="windows-1251") || ($charset[1]=="Windows-1251") || ($charset[1]=="WINDOWS-1251"))
	{
		$text=iconv("windows-1251","UTF-8",$text);
	}
	else
	if (($charset[1]=="koi8-r") || ($charset[1]=="KOI8-R"))
	{
		$text=iconv("koi8-r","UTF-8",$text);
	}
	//echo '<base href="http://'.parse_url($_GET['link'],PHP_URL_HOST).'/">';
	return $text;
}

function get_isshow()
{
	$isshow=1;
	global $mas_rep_link,$mas_spam,$mas_rep,$hn,$link,$nick,$content,$nnstr,$ntime,$etime,$time,$resorrr,$orderspams,$orderfavs,$_POST;
	$fop=fopen("debug.txt","a+");
	if (((($_POST[$nnstr])=='false') || empty($_POST[$nnstr])) && ($isshow==1))
	{
		$isshow=0;
	}
	//-----------------------TIME----------------------
	$ntime=strtotime($_POST['ntime']);
	$etime=strtotime($_POST['etime']);
	if ((($_POST['ntime']!='') && ($_POST['etime']!='')) && (($time<$ntime) || ($time>$etime)))
	{
		$isshow=0;
	}
	/*if (in_array($content,$mas_rep))
	{
		$mas_spam[]=$content;
	}*/
	//------------------------RESOURCES
	if (!in_array($hn,$resorrr))
	{
		//fwrite($fpizdec, "123\n");
		$isshow=0;
	}
	//-------------------SPAM NOT SPAM ...--------------------
	if (($_POST['showmode']=="onlyspam") && (!in_array($link,$orderspams)))
	{
		$isshow=0;
	}
	if (($_POST['showmode']=="notspam") && (in_array($link,$orderspams)))
	{
		$isshow=0;
	}
	if ($_POST['showmode']=="showall")
	{
		//$isshow=1;
	}
	if (($_POST['showmode']=="showfav") && ((!in_array($link,$orderfavs)) || (in_array($link,$orderspams))))
	{
		$isshow=0;
	}
	if ($_POST['unrep']=='on')
	{
		if (in_array($content,$mas_rep))
		{
			$isshow=0;	
		}
		else
		{
			$mas_rep[]=$content;
			//fwrite($fop,$content."\n");
		}
	}
	if (in_array($link,$mas_rep_link))
	{
		$isshow=0;	
	}
	else
	{
		$mas_rep_link[]=$link;
		//fwrite($fop,$content."\n");
	}
	fclose($fop);
	return $isshow;
}

/*function GetFullPost($link,$part)//table full_comments если есть пост то вывести из базы данных если нет то скачать записать в базу и вывести    $db->query(   mysql_num_rows($res)==0   $orderspam1 = $db->fetch($resspam1);  if (intval($orderspam1['spam_id'])==0)
{
	global $db;
	$text=parseURL($link);
	preg_match('/charset=([-a-z0-9_]+)/is',$text,$charset);
	//$linkk = mysql_connect('localhost', 'root', '123');
	//mysql_select_db("admin");	
	$result = $db->query("SELECT * FROM  `blog_full_com` WHERE  `ful_com_link` =  '".$link."' LIMIT 0 , 30");
	if (!mysql_num_rows($result)) 
	{
		//echo "fail";
		if ($charset[1]!="utf-8")
		{
			$text=iconv($charset[1], "utf-8", $text);
		}
		preg_match_all("/<div[^<]*?>(?<ou>(.*?)".$part."(.*?)<\/div>)/is",$text,$out);
		while ($out[ou][0]!="")
			{
			$last=$out[ou][0];
			preg_match_all("/<div[^<]*?>(?<ou>(.*?)".$part."(.*?)<\/div>)/is",$out[ou][0],$our);
			$out[ou][0]=$our[ou][0];
		}
		$result = $db->query("INSERT INTO  `blog_full_com` (`ful_com_id` ,`ful_com_link` ,`ful_com_post`)
VALUES (NULL ,  '".$link."',  '".htmlentities($last, ENT_QUOTES, "UTF-8")."');");
	}		
	else
	{
		//echo "suc";
		$row = $db->fetch($result);
		$last=$row['ful_com_post'];
	}
	//echo $last;
	return $last;
}*/


function getcity($url)
{
	//$content=parseURL($url);
        //$dom = new DomDocument;
        //$res = @$dom->loadHTML($content);
	
global $wobot;

	$pu=parse_url($url);
	$hostname=$pu['host'];
	
	switch($hostname)
	{
		case 'twitter.com':
		//http://twitter.com/ifsfreaks/statuses/12766451836
		//------|HOST-------|NICK-----|OTHER--------------|
			list($tmp,$nick,$tmp)=explode("/",$pu['path'],3);
			$content=parseURL('http://twitter.com/'.$nick);
			$dom = new DomDocument;
			$res = @$dom->loadHTML($content);
			$uls = $dom->getElementsByTagName("ul");
			
			foreach ($uls as $ul)
			{
				if ($ul->getAttribute("class")=="about vcard entry-author")
				{
					if ($ul->firstChild->nextSibling->nextSibling->firstChild->textContent=='Location')
					{
						list($location,$tmp) = explode(',',$ul->firstChild->nextSibling->nextSibling->firstChild->nextSibling->nextSibling->textContent,2);
						$location=mb_strtolower(strip_tags($location),"UTF-8");
						$location=(strlen($wobot['cities'][$location])>0?$wobot['cities'][$location]:$location);
					}
				}
			}

			//echo '[twitter] nick: "'.$nick.'" location: "'.$location.'"';
			break;
		case 'ya.ru':
		
			break;
		case 'mail.ru':
		
			break;
		default:
			list($nick,$host)=explode('.',$hostname,2);
			if ($host=='livejournal.com')
			{
			//http://skor-12.livejournal.com/190577.html?thread=806257
			//------|HOST-------------------|SHIT--------------------|
			//------|NICK---|DOMAIN---------|SHIT--------------------|
				//http://NICK.livejournal.com/profile
				$content=parseURL('http://'.$nick.'.livejournal.com/profile');
				$dom = new DomDocument;
				$res = @$dom->loadHTML($content);
				$as = $dom->getElementsByTagName("a");
				foreach ($as as $a)
				{
					if ($a->getAttribute("class")=="locality")
					{
						//if ($ul->firstChild->nextSibling->nextSibling->firstChild->textContent=='Location')
						//{
						//	list($location,$tmp) = explode(',',$ul->firstChild->nextSibling->nextSibling->firstChild->nextSibling->nextSibling->textContent,2);
						//	$location=(strlen($wobot['cities'][$location])>0?$wobot['cities'][$location]:$location);
						//}
						$location = $a->textContent;
					}
					if ($a->getAttribute("class")=="region" && strlen($location)==0)
					{
						//if ($ul->firstChild->nextSibling->nextSibling->firstChild->textContent=='Location')
						//{
						//	list($location,$tmp) = explode(',',$ul->firstChild->nextSibling->nextSibling->firstChild->nextSibling->nextSibling->textContent,2);
						//	$location=(strlen($wobot['cities'][$location])>0?$wobot['cities'][$location]:$location);
						//}
						$location = $a->textContent;
					}
				}
				$location=mb_strtolower(strip_tags($location),'UTF-8');
				$location=(strlen($wobot['cities'][$location])>0?$wobot['cities'][$location]:$location);
				//echo '[livejournal.com] nick: "'.$nick.'" location: "'.$location.'"';
			}

			break;
	}
	
	//$tables = $dom->getElementsByTagName("a");
	
	return array($nick,$location);
}
/*
function getnastr($text,$subj)
{
	//$subj=explode(' | ', $subj);
	//$text=ereg_replace("[a-zA-Z]+://([.]?[a-zA-Z0-9_/-])*", "", $text);
	//$text=ereg_replace("([.]?[a-zA-Z0-9_/-])*", "", $text);
	//$text=ereg_replace('/www\.([.]?[a-zA-Z0-9_/-])*\.(ru|tv|com|net)/i', '', $text);
	//echo $text;
	$out=array("хорош","классн","класн","прекрасн","увлекательн","спасиб","активн","перв","победитель","выигрывать","выигрывает","выиграв","выигрыв","интересен","лучш","хорош","познавательн","развивательн","интересн");
	$out1=array("дерьмов","ужасн","плох","неважн","галим","инквизируем","инквизировать","инквизир","слит","профанац");
	$gl=array('а','е','ё','и','о','у','ы','э','ю','я');
	$e_w = array("ая","ею","яя");
	$pos=array();
	$offer=array();
	$j=0;
	$k=0;
	preg_match_all("/\s*(?<phrase>.*?)\s*[\.,!?]/is",$text,$off);
	$offer=$off['phrase'];
	//$voc = file_get_contents('bad.txt');
	//$out1=explode("\n",$voc);
	//$voc1 = file_get_contents('good.txt');
	//$out=explode("\n",$voc1);
	$primary=2;
	$secondary=2;
	$colpositive=0;
	$colnegative=0;
	for ($i=0;$i<=count($offer);$i++)
	{
		$t=$offer[$i];
		$voc_offer=explode(" ",$t);
		//if (in_array($subj,$voc_offer))
		//echo $t.'-'.$subj.'-'.mb_stripos($t,$subj,0,'UTF-8');
		if (mb_stripos($t,$subj,0,'UTF-8')==TRUE)
		{
			//echo 'siski';
			$lastword="";
			foreach ($voc_offer as $value)
			{
				$fpos=0;
				if (($lastword=="ни") || ($lastword=="не"))
				{
					$fpos=1;
				}
				if ($value!='')
				{
					while (in_array(mb_substr($value,mb_strlen($value,'UTF-8')-1,1,'UTF-8'),$gl) && (mb_strlen($value,'UTF-8')>=3)) 
					{
						$value=mb_substr($value,0,mb_strlen($value,'UTF-8')-1,'UTF-8');
					}
				}
				$lastword=$value;
				//echo ':'.$value.':';
				if (in_array($value,$out))
				{
					//echo 'pos';
					if ($fpos==1)
					{
						$colnegative++;
					}
					else
					{
						$colpositive++;
					}
					//echo $value,'  +<br>';
				}
				else
				if (in_array($value,$out1))
				{
					//echo 'neg';
					if ($fpos==1)
					{
						$colpositive++;
					}
					else
					{
						$colnegative++;
					}
					//echo $value,'  -<br>';
				}
			}
		}
	}
	//echo 'отрицательных - ',$colnegative,' положительных - ',$colpositive;
	if ($colpositive>$colnegative) return 1;
	elseif ($colpositive==$colnegative) return 0;
	else return -1;
}
*/
/*
function getnastr($text,$subj)
{	
	$synonims=array("техника" => array("быстродейсв","размер","качеств"), "банки" => array("обслуж","кредит","качеств"));
	$out1=array("хорош","классн","класн","прекрасн","увлекательн","спасиб","активн","перв","победитель","выигрывать","выигрывает","выиграв","выигрыв","интересен","лучш","хорош","познавательн","развивательн","интересн","тащит","вложит","инвестирует","инвестировать","запускать","запущен","полезн","представит","ищет","тащит","вложит","инвестир","инвестировать","запускать","запущен","полезн","крупнейш","ищет","искать","потратит","объявляет","объявляют","выберет","выбирает","выбирают","продвигает","продвигают","запустит","запускают","подготовит","ищет","искать","инвестирует","отсудит","представит","прогрессивных","крупнейш","проводит","выдающийс","успешн","дольш","благородн","покажут","служит","реализуют","реализует","выпускает","вложится","презентовал","начинает","взял","примет","вернет","рожден","порадовал","спонсирует","создает","обеспечить","предложил","принесл","польз","вер","верю","центр","получит","займетс","будут","удовлетворен","поможет","одобрил","планирует","заслуг","запустил","предлагает");
	$out=array("гавн","дерьмов","ужасн","плох","неважн","галим","инквизируем","инквизировать","инквизир","слит","профанац","отклоняет","отмывк","слит","профанац","отклоняет","развал","муть","неудобн","отмывк","отсудит","попал","мало","простебал","стеб","стебал","стремн","спиздил","дыр","дыра","ёпта","пресловут","раскритиковал");
	$gl=array('а','е','ё','и','о','у','ы','э','ю','я','й');
	$e_w = array("ая","ею","яя");
	$arr_word = array("word" => array(), "point" => array(), "endpoint" => array(), "alrused" => array());
	$pos=array();
	$offer=array();
	$j=0;
	$k=0;                                 //TO DO ссылки отбросить, заглавные незаглавные буквы, словарь дополнить.
	$text=strip_tags($text);
	$text=' '.$text;
	if (mb_substr($text,mb_strlen($text,"UTF-8")-1,1,'UTF-8')!='.')
	{
		$text.='.';
	}
	preg_match_all("/\s*(?<phrase>.*?)\s*[\.,!?]/is",$text,$off);
	$offer=$off[phrase];
	foreach ($offer as $oi)
	{
		//echo $oi,"<br>";
	}
	$colpositive=0;
	$colnegative=0;
	for ($i=0;$i<count($offer);$i++)
	{
		$t=$offer[$i];
		//echo $offer[$i];
		$t = mb_convert_case($t, MB_CASE_LOWER, "UTF-8");
		$subj = mb_convert_case($subj, MB_CASE_LOWER, "UTF-8");
		//echo $t;
		$voc_offer=explode(" ",$t);
		if ((mb_stripos($t,$subj,0,'UTF-8')!==FALSE) && ($t!=""))
		{
			//echo "JOPA";
			$lastword="";
			foreach ($voc_offer as $value)
			{
				$fpos=0;
				if (($lastword=="ни") || ($lastword=="не"))
				{
					$fpos=1;
				}
				$lastword=$value;
				if ($value!='')
				{
					while (in_array(mb_substr($value,mb_strlen($value,'UTF-8')-1,1,'UTF-8'),$gl))
					{
						$value=mb_substr($value,0,mb_strlen($value,'UTF-8')-1,'UTF-8');
					}
				}
				//echo "/",$value,"/ ";
				if (in_array($value,$out))
				{
					if ($fpos==1)
					{
						$colnegative++;
					}
					else
					{
						$colpositive++;
					}
				}
				else
				if (in_array($value,$out1))
				{
					if ($fpos==1)
					{
						$colpositive++;
					}
					else
					{
						$colnegative++;
					}
				}
			}
		}
	}
	//echo 'отрицательных - ',$colnegative,' положительных - ',$colpositive;
	if ($colpositive>$colnegative)
	{
		return 1;
	}
	else 
	if ($colnegative>$colpositive)
	{
		return -1;
	} 
	else
	if ($colnegative==$colpositive)
	{
		return 0;
	}
}
*/

function getnastr($text,$subj)
{
       $synonims=array("техника" => array("быстродейсв","размер","качеств"), "банки" => array("обслуж","кредит","качеств"));
//       $out1=array("хорош","классн","класн","прекрасн","увлекательн","спасиб","активн","перв","победитель","выигрывать","выигрывает","выиграв","выигрыв","интересен","лучш","хорош","познавательн","развивательн","интересн","тащит","вложит","инвестирует","инвестировать","запускать","запущен","полезн","представит","ищет","тащит","вложит","инвестир","инвестировать","запускать","запущен","полезн","крупнейш","ищет","искать","потратит","объявляет","объявляют","выберет","выбирает","выбирают","продвигает","продвигают","запустит","запускают","подготовит","ищет","искать","инвестирует","отсудит","представит","прогрессивных","крупнейш","проводит","выдающийс","успешн","дольш","благородн","покажут","служит","реализуют","реализует","выпускает","вложится","презентовал","начинает","взял","примет","вернет","рожден","порадовал","спонсирует","создает","обеспечить","предложил","принесл","польз","вер","верю","центр","получит","займетс","будут","удовлетворен","поможет","одобрил","планирует","заслуг","запустил","предлагает");
//       $out=array("гавн","дерьмов","ужасн","плох","неважн","галим","инквизируем","инквизировать","инквизир","слит","профанац","отклоняет","отмывк","слит","профанац","отклоняет","развал","муть","неудобн","отмывк","отсудит","попал","мало","простебал","стеб","стебал","стремн","спиздил","дыр","дыра","ёпта","пресловут","раскритиковал");
        $out1=array("хорош","классн","класн","прекрасн","увлекательн","спасиб","активн","перв","победитель","выигрывать","выигрывает","выиграв","выигрыв","интересен","лучш","хорош","познавательн","развивательн","интересн","тащит","вложит","инвестирует","инвестировать","запускать",
"запущен","полезн","представит","ищет","тащит","вложит","инвестир","инвестировать","запускать","запущен","полезн","крупнейш","ищет","искать","потратит","объявляет","объявляют","выберет","выбирает","выбирают","продвигает","продвигают","запустит","запускают","подготовит","ищет","искать",
"инвестирует","отсудит","представит","прогрессивных","крупнейш","проводит","выдающийс","успешн","дольш","благородн","покажут","служит","реализуют","реализует","выпускает","вложится","презентовал","начинает","взял","примет","вернет","рожден","порадовал","спонсирует","создает","обеспечить",
"предложил","принесл","польз","вер","верю","центр","получит","займетс","будут","удовлетворен","поможет","одобрил","планирует","заслуг","запустил","предлагает");
        $out=array("гавн","дерьмов","ужасн","плох","неважн","галим","инквизируем","инквизировать","инквизир","слит","профанац","отклоняет","отмывк","слит","профанац","отклоняет","развал","муть","неудобн","отмывк","отсудит","попал","мало","простебал","стеб","стебал","стремн","спиздил","дыр",
"дыра","ёпта","пресловут","раскритиковал","абстрактный","аеслибы","ану","абзац","абзацнутый","аборт","абракадабра","абсурд","абсурдизм","абсцесс","авось","агитатор",
"агитаторский","агитаторша","агитационность","агитационный","агитациЯ","агитирование","агитировать","агница","агницы","агонизированный","агонизировать","агонизирующий"
,"агониЯ","агрессивно","агрессивность","агрессивный","агрессиЯ","ад","аденома","аденомный","адепт","адово","адовый","адски","адский","акселерат","алапездырь","алкаш","алкоголизм","алкоголик","алчность","алчный","амЮба","аморально","аморальность","аморальный","аналище","анекдотически","анекдотический","анекдотичный","аномальный","антинаучно","антинаучность","антинаучный","антинациональный","антиобщественно","антиобщественный","антипатиЯ","антипатриотически","антипатриотический","антипедагогически","антипедагогический","антисанитариЯ","антисанитарный","антисемит","антисемитизм","антисемитка","антисемитский","антисоветский","антихрист","анус","апатический","апатично","апатичность","апатичный","апатиЯ","апездал","аполитично","аполитичность","аполитичный","арбузоЮб","архаично","архаичность","архаичный","атавизм","атавистический","атавистично","афера","аферист","аферистка","ацки","ацтой","баба","бабенка","бабень","бабища","бабский","бабуин","багрила","базарничать","базарный","байда","байда","баклан","баклуш","баклушничать","балабол","балаболить","балаболка","балаганить","балагур","балагурный","балагурство","баламут","баламутить","баламутка","баланда","балбес","балбесничать","балда","балованный","баловень","баловство","бамбуча","банально","банальность","банальщина","барабошка","барабулька","барахлишко","барахло","бардак","баребух","барыга","барыжить","басран","бахвалитьсЯ","бахвалка","бахвальство","баЯн","беда","бедн","бедность","беднота","безвыражениЯ","бездела","бездуши","безинтереса","безтолку","безалаберно","безалаберность","безалаберщина","безвкусие","безвкусица","безвкусный","безвластный","безвольно","безвольность","безвольный","безграмотно","безграмотность","безграмотный","бездар","бездарность","бездарный","безделие","бездельник","бездельничанье","бездельничать","безденежность","безденежный","бездеЯтельный","бездумие","бездумный","бездушие","бездушность","бездушный","безжизненно","безжизненность","безжизненный","безнаказанно","безнаказанность","безнаказанный","безнравственно","безнравственность","безнравственный","безобразно","безобразность","безобразный","безответственность","безответственный","безумец","безумный","безуспешность","безуспешный","безынициативно","безынициативность","безынициативный","бельмо","бескрасочный","бескультурие","бескультурный","беспардонн","беспардонное","бесполезно","бесполезность","бесполезный","беспомощно","беспомощность","беспомощный","беспорЯд","беспорЯдочный","беспредел","беспредельно","беспредельность","беспредельный","беспутье","бессвЯзность","бессвЯзный","бессилие","бесславно","бесславность","бесславный","бессмысленность","бессмыслие","бессмыслица","бессовестно","бессовестность","бестактный","бесхарактерность","бесцельно","бесцельный","бешенный","библиофильство","бландинко","блатнаЯ","блатной","блевать","блевотина","блекло","блеклость","блеклый","близорукий","блудный","блЯд","Ѓ‹џ„€ЌЂ","абстрактн","аеслиб","ану","абзац","абзацнут","аборт","абракадабр","абсурд","абсурдизм","абсцесс","авось","агитатор","агитаторск","агитаторш","агитационность","агитационн","агитац","агитировани","агитировать","агниц","агниц","агонизированн","агонизировать","агонизирующ","агон","агрессивн","агрессивность","агрессивн","агресс","ад","аденом","аденомн","адепт","адов","адов","адск","адск","акселерат","алапездырь","алкаш","алкоголизм","алкоголик","алчность","алчн","амЮб","аморальн","аморальность","аморальн","аналищ","анекдотическ","анекдотическ","анекдотичн","аномальн","антинаучн","антинаучность","антинаучн","антинациональн","антиобщественн","антиобщественн","антипат","антипатриотическ","антипатриотическ","антипедагогическ","антипедагогическ","антисанитар","антисанитарн","антисемит","антисемитизм","антисемитк","антисемитск","антисоветск","антихрист","анус","апатическ","апатичн","апатичность","апатичн","апат","апездал","аполитичн","аполитичность","аполитичн","арбузоЮб","архаичн","архаичность","архаичн","атавизм","атавистическ","атавистичн","афер","аферист","аферистк","ацк","ацт","баб","бабенк","бабень","бабищ","бабск","бабуин","багрил","базарничать","базарн","байд","байд","баклан","баклуш","баклушничать","балабол","балаболить","балаболк","балаганить","балагур","балагурн","балагурств","баламут","баламутить","баламутк","баланд","балбес","балбесничать","балд","балованн","баловень","баловств","бамбуч","банальн","банальность","банальщин","барабошк","барабульк","барахлишк","барахл","бардак","баребух","барыг","барыжить","басран","бахвалитьс","бахвалк","бахвальств","баян","бед","бедн","бедность","беднот","безвыражен","бездел","бездуш","безинтерес","безтолку","безалаберн","безалаберность","безалаберщин","безвкуси","безвкусиц","безвкусн","безвластн","безвольн","безвольность","безвольн","безграмотн","безграмотность","безграмотн","бездар","бездарность","бездарн","бездели","бездельник","бездельничань","бездельничать","безденежность","безденежн","бездеятельн","бездуми","бездумн","бездуши","бездушность","бездушн","безжизненн","безжизненность","безжизненн","безнаказанн","безнаказанность","безнаказанн","безнравственн","безнравственность","безнравственн","безобразн","безобразность","безобразн","безответственность","безответственн","безумец","безумн","безуспешность","безуспешн","безынициативн","безынициативность","безынициативн","бельм","бескрасочн","бескультури","бескультурн","беспардонн","беспардонно","бесполезн","бесполезность","бесполезн","беспомощн","беспомощность","беспомощн","беспоряд","беспорядочн","беспредел","беспредельн","беспредельность","беспредельн","беспуть","бессвязность","бессвязн","бессили","бесславн","бесславность","бесславн","бессмысленность","бессмысли","бессмыслиц","бессовестн","бессовестность","бестактн","бесхарактерность","бесцельн","бесцельн","бешенн","библиофильств","бландинк","блатна","блатн","блевать","блевотин","блекл","блеклость","блекл","близорук","блудн","бляд","Ѓ‹џ„€ЌЂ","Ѓ‹џ„ЋѓЋЌ","Ѓ‹џ„‘Љ€‰","Ѓ‹џ„‘’‚Ћ","болезнь","болтлив","больн","боян","бранить","брань","буйн","бухать","вафлит","вероломн","виноват","виновн","водянист","воин","вонь","воспрещать","враг","вражд","врань","враньЮ","вред","вредин","вредн","временн","вталкивать","‚торойнах","вульгарн","выбежать","‚›Ѓ‹џ„ЋЉ","выбросил","вывернуть","выдвигатьс","выдуманн","выебать","‚›…ЃЋЌ","‚›ЭЃ›‚Ђ…’‘џ","выключать","выкрутить","вымысел","вымышленн","выпихивать","выскочк","выступать","выталкивать","выфрендить","гавнецк","гавн","гавнярищ","гад","гаденыш","гадин","гадк","гандон","гасить","гаснуть","геданист","гедонист","геморр","гибельн","глист","глупец","глуп","глуп","гнев","гневн","гнойник","говн","голгоф","голод","голодн","гомосек","гор","горевать","горесть","горечь","горьк","грешн","груб","грузн","грустить","грустн","грязн","грязь","даун","дебил","дерьм","„…ђњЊЋ•…ђЋЏ€‡„ЋЉђЂ’","„…ђњЊЋ•…ђЋЏ€‡„ЋЉђЂ’€џ","дефицит","дешЮв","дибил","дибильн","дисгармон","долбанн","долбан","дорог","дрючить","дрябл","дурак","дурацк","дурн","ебанут","ебать","ебнут","Юбнут","ебт","елд","ерунд","жадн","жалк","жЮстк","жидк","жирдяй","жирн","жиртрест","заболевать","заебал","заебал","закат","закатыватьс","закрывать","залуп","заносчив","занят","заплакать","запрещать","засранец","затаЮнн","заурядн","заходить","зл","зл","злополучн","зн","издеватьс","излишек","измен","изменник","изменчив","измыватьс","имбицил","инертн","исключать","искривлять","искусственн","исчезать","кажущийс","карав","карлик","карликов","кастрировать","клоун","конец","конч","кончан","кончать","конченн","кончен","корить","коряв","костляв","кострировать","красть","кривд","крив","крив","криклив","кутил","ладЮв","лаж","лажев","лажов","лев","лев","легкомысленн","ледян","ленит","лентяй","ленятс","лжив","лицемерн","лишил","ложн","ложь","‹Ћ‹","ломаетс","лох","лошар","мал","Њанд","марк","материтьс","матерн","мелк","мертв","мизерн","микроскопическ","мним","многословн","молчалив","мороз","мрак","мрачн","мудак","мук","наруку","наврал","наврать","назад","нарушать","нахуй","некместу","неоправдывать","неправд","неработает","неаккуратн","неблагозвучи","невежд","невежеств","невежлив","невежлив","невезени","невери","неверн","неверность","неверн","невесЮл","невкусн","невозможн","невпопад","невысок","негодн","негодн","неграмотн","неграмотн","недалЮк","недальновидн","недобросовестн","недовер","недовери","недовольн","недоносок","недоработанн","недоработан","недоработк","недоработк","недоразвит","недостаток","недостойн","недостойн","недруг","нежив","незаконн","незаслуженн","нездоров","незнаком","незнани","незначительн","незнающ","неизвестн","неинтересн","неискренн","некомпетент","некомпетентн","некомпитент","некорректн","некрасив","некрепк","некрепк","некстат","некудышн","некультурн","немощн","ненастоящ","неопрятн","неподвижность","непокладист","непокорн","непорядок","непослушн","непостоянн","непохож","неправд","неправильность","неправильн","непрактичн","непрактичн","непригодн","неприличн","неприязнь","неприятн","неприятн","непроизводительн","неразборчив","неразговорчив","нерасположени","нередк","неряшлив","несговорчив","несговорчив","несерьЮзн","несловоохотлив","несмел","несовершенн","несовершенств","несообразительн","несправедлив","несчастлив","несчастн","несчасть","нетактичн","нетвЮрд","нетолерантн","неуверенн","неудач","неудачлив","неудачн","неудобн","неудобн","неумн","неучтив","нехватк","нечЮтк","нечист","неюзабл","неярк","неясн","низ","низк","никт","никчемн","никчЮмн","ничт","ничтожн","нищет","нужд","обвинять","облажались","облажалс","обленил","обман","обманчив","обманщик","обманывать","обременять","огорчать","огорчатьс","ограниченн","однобок","однообразн","однотонн","одноцветн","олигофрен","опускать","опускатьс","опьянять","осень","ослабеть","осуждать","осуждени","отвлечЮнн","отвратительн","отвращени","отдалять","отдалятьс","отдрючить","отказ","отказались","отказатьс","отказывать","отключать","отрицательн","отрицать","отсосн","отставать","отстал","отстал","отстают","отст","отстойник","отстойн","отступать","отсутстви","отталкивать","отъебать","оцк","ошибочность","ошибочн","ошибс","падаль","падать","падл","падл","палевн","паскуд","пасмурн","пассивн","педераст","педофил","пердун","перевирать","переврал","переменн","пессимизм","печалить","печалитьс","печаль","печальн","пидар","пидарас","пидор","пидорас","пизд","пиздеть","пиздить","пиздовать","письк","плакать","плач","плох","плох","поверхностн","подавлять","поддельн","подсмотрел","подстав","подставлять","поздн","понижать","понижатьс","поражени","порвать","порицани","порицать","порожн","порознь","порок","последн","потерял","потерять","потерятьс","потухать","предатель","предательств","предвзят","пресловут","преувеличивать","преуменьшать","принижать","притворн","провал","провожать","продавать","продались","проигрывает","пропадать","пропасть","пропустил","пропустить","проститутк","противник","прошлвек","проштрафитьс","пуст","пьян","пьянь","развод","разводить","разворовал","разлук","разобщать","разрушать","разъединять","расслабились","расстраивать","расстраиватьс","растратить","редк","робк","робость","ругать","ругатьс","рыдать","садист","садитьс","самонадеянн","сдал","скованн","скопировал","скорбеть","скорбь","скотин","скрыватьс","скуп","скучн","слабоват","слабость","слаб","слизнуть","сложн","сломалс","сломатьс","смазлив","смерть","сокращать","сомневатьс","сохнуть","спер","спереть","сперл","спуск","старинн","старпер","стар","стираютс","стормозил","страдани","страдать","строптив","стырил","стырит","суживать","сук","сучар","сцук","сыр","таять","темнот","темн","тень","терроризм","террорист","терять","тесн","толстеть","толст","топорн","тормоз","тормозн","тощ","трахнуть","трудн","трус","труслив","тупа","туп","туп","тускл","тухнуть","тучн","тырить","тьм","тяжел","тяжЮл","“блюдокК","“блюдокК","уебок","уЮбок","украл","укурок","умалять","умирать","унижать","унизит","уныл","урод","уродлив","уступил","утрировать","ушлЮпок","фантазер","фашист","фигн","фигов","формальн","хам","хаос","херхрен","херь","хил","хил","хиляк","холод","холодн","холодн","хренов","хренов","хренов","хрень","худ","хуеплет","хуеплЮт","хуж","хуй","хул","хулить","чекнут","чЮкнут","чужбин","чуж","шалав","шарлатан","шах","шибанут","шкодить","шкурник","шкурничать","шлюх","шрлотан","шум","щегол","щеголеват","эгоист","экзекуц","дибильный","дисгармониЯ","долбанный","долбаный","дорого","дрючить","дрЯблый","дурак","дурацкий","дурной","ебанутый","ебать","ебнутый","Юбнутый","ебт","елда","ерунда","жадн","жалкий","жЮсткий","жидкий","жирдЯй","жирный","жиртрест","заболевать","заебал","заебали","закат","закатыватьсЯ","закрывать","залупа","заносчивый","занЯтый","заплакать","запрещать","засранец","затаЮнный","заурЯдный","заходить","зло","злой","злополучный","зной","издеватьсЯ","излишек","измена","изменник","изменчивый","измыватьсЯ","имбицил","инертный","исключать","искривлЯть","искусственный","исчезать","кажущийсЯ","каравый","карлик","карликовый","кастрировать","клоун","конец","конча","кончаный","кончать","конченный","конченый","корить","корЯвый","костлЯвый","кострировать","красть","кривда","криво","кривой","крикливый","кутила","ладЮвый","лажа","лажевый","лажовый","левый","левый","легкомысленный","ледЯной","ленит","лентЯй","ленЯтсЯ","лживый","лицемерный","лишил","ложный","ложь","‹Ћ‹","ломаетсЯ","лох","лошара","мало","Њанда","маркий","материтьсЯ","матерный","мелкий","мертвый","мизерный","микроскопический","мнимый","многословный","молчаливый","мороз","мрак","мрачный","мудак","мука","наруку","наврали","наврать","назад","нарушать","нахуй","некместу","неоправдывать","неправда","неработает","неаккуратный","неблагозвучие","невежда","невежество","невежливый","невежливый","невезение","неверие","неверн","неверность","неверный","невесЮлый","невкусный","невозможно","невпопад","невысокий","негодный","негодный","неграмотный","неграмотный","недалЮкий","недальновидный","недобросовестный","недовер","недоверие","недовольный","недоносок","недоработанный","недоработаный","недоработка","недоработка","недоразвитый","недостаток","недостойний","недостойно","недруг","неживой","незаконный","незаслуженный","нездоровый","незнакомый","незнание","незначительный","незнающий","неизвестный","неинтересный","неискренний","некомпетент","некомпетентный","некомпитент","некорректный","некрасивый","некрепкий","некрепкий","некстати","некудышный","некультурный","немощный","ненастоЯщий","неопрЯтный","неподвижность","непокладистый","непокорный","непорЯдок","непослушный","непостоЯнный","непохожий","неправда","неправильность","неправильный","непрактичн","непрактичный","непригодный","неприличный","неприЯзнь","неприЯтнее","неприЯтный","непроизводительный","неразборчивый","неразговорчивый","нерасположение","нередкий","нерЯшливый","несговорчивый","несговорчивый","несерьЮзный","несловоохотливый","несмелый","несовершенный","несовершенство","несообразительный","несправедливый","несчастливый","несчастный","несчастье","нетактичный","нетвЮрдый","нетолерантный","неуверенный","неудача","неудачливый","неудачный","неудобнее","неудобный","неумный","неучтивый","нехватка","нечЮткий","нечистый","неюзабл","неЯркий","неЯсный","низ","низкий","никто","никчемный","никчЮмный","ничто","ничтожный","нищета","нужда","обвинЯть","облажались","облажалсЯ","обленил","обман","обманчивый","обманщики","обманывать","обременЯть","огорчать","огорчатьсЯ","ограниченный","однобокий","однообразный","однотонный","одноцветный","олигофрен","опускать","опускатьсЯ","опьЯнЯть","осень","ослабеть","осуждать","осуждение","отвлечЮнный","отвратительный","отвращение","отдалЯть","отдалЯтьсЯ","отдрючить","отказ","отказались","отказатьсЯ","отказывать","отключать","отрицательный","отрицать","отсосный","отставать","отстали","отсталый","отстают","отстой","отстойник","отстойный","отступать","отсутствие","отталкивать","отъебать","оцки","ошибочность","ошибочный","ошибсЯ","падаль","падать","падла","падло","палевный","паскуда","пасмурный","пассивный","педераст","педофил","пердун","перевирать","переврал","переменный","пессимизм","печалить","печалитьсЯ","печаль","печальный","пидар","пидарас","пидор","пидорас","пизда","пиздеть","пиздить","пиздовать","писька","плакать","плач","плох","плохой","поверхностный","подавлЯть","поддельный","подсмотрели","подстава","подставлЯть","поздний","понижать","понижатьсЯ","поражение","порвать","порицание","порицать","порожний","порознь","порок","последний","потерЯл","потерЯть","потерЯтьсЯ","потухать","предатель","предательство","предвзЯтый","пресловутый","преувеличивать","преуменьшать","принижать","притворный","провал","провожать","продавать","продались","проигрывает","пропадать","пропасть","пропустили","пропустить","проститутка","противник","прошлыйвек","проштрафитьсЯ","пустой","пьЯный","пьЯнь","развод","разводить","разворовал","разлука","разобщать","разрушать","разъединЯть","расслабились","расстраивать","расстраиватьсЯ","растратить","редкий","робкий","робость","ругать","ругатьсЯ","рыдать","садист","садитьсЯ","самонадеЯнный","сдали","скованный","скопировали","скорбеть","скорбь","скотина","скрыватьсЯ","скупой","скучный","слабоват","слабость","слабый","слизнуть","сложный","сломалсЯ","сломатьсЯ","смазливый","смерть","сокращать","сомневатьсЯ","сохнуть","спер","спереть","сперли","спуск","старинный","старпер","старый","стираютсЯ","стормозили","страдание","страдать","строптивый","стырили","стырит","суживать","сука","сучара","сцуко","сырой","таЯть","темнота","темный","тень","терроризм","террорист","терЯть","тесный","толстеть","толстый","топорный","тормоз","тормозной","тощий","трахнуть","трудный","трус","трусливый","тупаЯ","тупее","тупой","тусклый","тухнуть","тучный","тырить","тьма","тЯжелее","тЯжЮлый","“блюдокК","“блюдокК","уебок","уЮбок","украл","укурок","умалЯть","умирать","унижать","унизит","унылый","урод","уродливый","уступил","утрировать","ушлЮпок","фантазеры","фашист","фигнЯ","фиговый","формально","хам","хаос","херхрен","херь","хилый","хилый","хилЯк","холод","холодно","холодный","хренов","хреново","хреновый","хрень","худой","хуеплет","хуеплЮт","хуже","хуй","хула","хулить","чекнутый","чЮкнутый","чужбина","чужой","шалава","шарлатан","шаха","шибанутый","шкодить","шкурник","шкурничать","шлюха","шрлотан","шум","щегол","щеголеватый","эгоист","экзекуциЯ");

       $gl=array('а','е','ё','и','о','у','ы','э','ю','я','й');
       $e_w = array("ая","ею","яя");
       $arr_word = array("word" => array(), "point" => array(), "endpoint" => array(), "alrused" => array());
       $pos=array();
       $offer=array();
       $j=0;
       $k=0; //TO DO ссылки отбросить, заглавные незаглавные буквы, словарь дополнить.
       $text=strip_tags($text);
       $text=' '.$text;
       if (mb_substr($text,mb_strlen($text,"UTF-8")-1,1,'UTF-8')!='.')
       {
               $text.='.';
       }
       preg_match_all("/\s*(?<phrase>.*?)\s*[\.,!?]/is",$text,$off);
       $offer=$off[phrase];
       foreach ($offer as $oi)
       {
               //echo $oi,"<br>";
       }
       $colpositive=0;
       $colnegative=0;
       $sub=explode(" | ",$subj);
       for ($i=0;$i<count($offer);$i++)
       {
           $t=$offer[$i];
           //echo $offer[$i];
           foreach ($sub as $su)
           {
               $t = mb_convert_case($t, MB_CASE_LOWER, "UTF-8");
                       $su = mb_convert_case($su, MB_CASE_LOWER, "UTF-8");
                       //echo 1;
               if ($su!='')
               {
                   while (in_array(mb_substr($su,mb_strlen($su,'UTF-8')-1,1,'UTF-8'),$gl))
                   {
                       $su=mb_substr($su,0,mb_strlen($su,'UTF-8')-1,'UTF-8');
                   }
               }
               //echo $su;
                       //echo $t;
               $voc_offer=explode(" ",$t);
               if ((mb_stripos($t,$su,0,'UTF-8')!==FALSE) && ($t!=""))
               {
                   //echo "JOPA";
                   $lastword="";
                   foreach ($voc_offer as $value)
                   {
                       $fpos=0;
                       if (($lastword=="ни") || ($lastword=="не"))
                       {
                           $fpos=1;
                       }
                       $lastword=$value;
                       if ($value!='')
                       {
                           while (in_array(mb_substr($value,mb_strlen($value,'UTF-8')-1,1,'UTF-8'),$gl))
                           {
                               $value=mb_substr($value,0,mb_strlen($value,'UTF-8')-1,'UTF-8');
                           }
                       }
                       //echo "/",$value,"/ ";
                       if (in_array($value,$out))
                       {
                               //echo "-";
                               if ($fpos==1)
                               {
                                   $colnegative++;
                               }
                           else
                               {
                                   $colpositive++;
                                   //echo "+|+";
                               }
                           }
                           else
                           if (in_array($value,$out1))
                           {
                               //echo "+";
                                   if ($fpos==1)
                               {
                                   $colpositive++;
                               }
                               else
                               {
                                   $colnegative++;
                               }
                           }
                       }
               }
           }
       }
       //echo 'отрицательных - ',$colnegative,' положительных - ',$colpositive;
       if ($colpositive>$colnegative)
       {
               return 1;
       }
       else
       if ($colnegative>$colpositive)
       {
               return -1;
       }
       else
       if ($colnegative==$colpositive)
       {
               return 0;
       }
}


// metrics functions ////////////////////////////////////////////////////////////////
function speakers($posts)
{
       $out=array("num" => array(), "nick" => array(), "posts" => array());
       foreach ($posts as $post)
       {
               $ii=array_search($post["nick"],$out["nick"]);
               if (($ii!==false) && ($post["nick"]!=""))
               {
                       $out["posts"][$ii]++;
               }
               else
               if (($ii!==true) && ($post["nick"]!=""))
               {
                       $out["num"][count($out["num"])]=count($out["num"]);
                       $out["nick"][count($out["num"])]=$post["nick"];
                       $out["posts"][count($out["num"])]=1;
               }
       }
       array_multisort($out["posts"],SORT_DESC,
       $out["nick"],SORT_DESC);
		unset($out["num"]);
       return $out;
}

function value($posts)
{
       $fol=array();
       $col=0;
       foreach ($posts as $post)
       {
               if (!in_array($post["readers"],$fol))
               {
                       $col+=$post["readers"];
                       $fol[count($fol)]=$post["readers"];
               }
       }
       return $col;
}

function promotion($posts)
{
       $out=array("num" => array(), "nick" => array(), "posts" => array(), "readers" => array());
       foreach ($posts as $post)
       {
               if (in_array($post["readers"],$out["readers"]) && ($post["readers"]!=""))
               {
                       /*for ($i=0;$i<=count($out["num"]);$i++)
                       {
                               if ($out["readers"][$i]==$post["readers"])
                               {
                               }
                       }*/
               }
               else
               if ((!in_array($post["nick"],$out["nick"])) && ($post["nick"]!=""))
               {
                       $out["num"][count($out["num"])]=count($out["num"]);
                       $out["nick"][count($out["num"])]=$post["nick"];
                       $out["posts"][count($out["num"])]=1;
                       $out["readers"][count($out["num"])]=$post["readers"];
               }
       }
       array_multisort($out["readers"],SORT_DESC,
       $out["nick"],SORT_DESC);
		unset($out["num"]);
       return $out;
}

// eof metrics /////////////////////////////////////////////////////////////////
?>
