<?php
/* 
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */

function formatint($number) {
    $prefixes = 'kMGTPEZY';
    if ($number >= 10000) {
        for ($i=-1; $number>=1000; ++$i) {
            $number /= 1000;
        }
        return floor($number).$prefixes[$i];
    }
    return $number;
}



$mwobot=
Array
(
    '36.5 50.6' => Array
        (
            'area' => 'Центр',
            'reg' => 'Белгородская область',
            'city' => 'Белгород',
        ),

    '37.5 51.2' => Array
        (
            'area' => 'Центр',
            'reg' => 'Белгородская область',
            'city' => 'Губкин',
        ),

    '34.3 53.2' => Array
        (
            'area' => 'Центр',
            'reg' => 'Брянская область',
            'city' => 'Брянск',
        ),

    '40.4 56.1' => Array
        (
            'area' => 'Центр',
            'reg' => 'Владимирская область',
            'city' => 'Владимир',
        ),

    '41.3 56.3' => Array
        (
            'area' => 'Центр',
            'reg' => 'Владимирская область',
            'city' => 'Ковров',
        ),

    '42.0 55.5' => Array
        (
            'area' => 'Центр',
            'reg' => 'Владимирская область',
            'city' => 'Муром',
        ),

    '39.2 51.6' => Array
        (
            'area' => 'Центр',
            'reg' => 'Воронежская область',
            'city' => 'Воронеж',
        ),

    '40.9 57.0' => Array
        (
            'area' => 'Центр',
            'reg' => 'Ивановская область',
            'city' => 'Иваново',
        ),

    '36.2 54.5' => Array
        (
            'area' => 'Центр',
            'reg' => 'Калужская область',
            'city' => 'Калуга',
        ),

    '36.6 55.1' => Array
        (
            'area' => 'Центр',
            'reg' => 'Калужская область',
            'city' => 'Обнинск',
        ),

    '40.9 57.7' => Array
        (
            'area' => 'Центр',
            'reg' => 'Костромская область',
            'city' => 'Кострома',
        ),

    '93.6 56.3' => Array
        (
            'area' => 'Центр',
            'reg' => 'Курская область',
            'city' => 'Железногорск',
        ),

    '36.1 51.7' => Array
        (
            'area' => 'Центр',
            'reg' => 'Курская область',
            'city' => 'Курск',
        ),

    '38.5 52.6' => Array
        (
            'area' => 'Центр',
            'reg' => 'Липецкая область',
            'city' => 'Елец',
        ),

    '39.5 52.6' => Array
        (
            'area' => 'Центр',
            'reg' => 'Липецкая область',
            'city' => 'Липецк',
        ),

    '37.8 55.9' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Королев',
        ),

    '37.2 55.6' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Одинцово',
        ),

    '37.3 55.9' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Химки',
        ),

    '36.7 55.3' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Наро-Фоминск',
        ),

    '37.9 55.8' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Балашиха',
        ),

    '37.9 55.4' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Домодедово',
        ),

    '37.1 56.7' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Дубна',
        ),

    '38.0 55.7' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Железнодорожный',
        ),

    '38.1 55.5' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Жуковский',
        ),

    '37.1 55.9' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Зеленоград',
        ),

    '36.8 55.9' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Истра',
        ),

    '36.7 56.3' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Клин',
        ),

    '38.7 55.0' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Коломна',
        ),

    '37.3 55.8' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Красногорск',
        ),

    '37.9 55.6' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Лыткарино',
        ),

    '37.9 55.7' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Люберцы',
        ),

    '37.6 55.7' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Москва',
        ),

    '37.7 55.9' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Мытищи',
        ),

    '37.5 55.3' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Климовск',
        ),

    '37.5 55.4' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Подольск',
        ),

    '37.8 56.0' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Пушкино',
        ),

    '38.2 55.5' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Раменское',
        ),

    '38.1 56.2' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Сергиев-Посад',
        ),

    '37.4 54.9' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Серпухов',
        ),

    '38.0 54.8' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Ступино',
        ),

    '38.0 55.9' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Фрязино',
        ),

    '37.4 55.1' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Чехов',
        ),

    '38.9 55.8' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Орехово-Зуево',
        ),

    '38.4 55.7' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Электросталь',
        ),

    '37.5 56.3' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Яхрома',
        ),

    '37.4 55.9' => Array
        (
            'area' => 'Центр',
            'reg' => 'Московская область',
            'city' => 'Долгопрудный',
        ),

    '36.0 52.9' => Array
        (
            'area' => 'Центр',
            'reg' => 'Орловская область',
            'city' => 'Орел',
        ),

    '39.7 54.6' => Array
        (
            'area' => 'Центр',
            'reg' => 'Рязанская область',
            'city' => 'Рязань',
        ),

    '31.9 54.7' => Array
        (
            'area' => 'Центр',
            'reg' => 'Смоленская область',
            'city' => 'Смоленск',
        ),

    '40.4 52.8' => Array
        (
            'area' => 'Центр',
            'reg' => 'Тамбовская область',
            'city' => 'Мичуринск',
        ),

    '41.4 52.7' => Array
        (
            'area' => 'Центр',
            'reg' => 'Тамбовская область',
            'city' => 'Тамбов',
        ),

    '30.4 54.5' => Array
        (
            'area' => 'Центр',
            'reg' => 'Тверская область',
            'city' => 'Орша',
        ),

    '35.8 56.8' => Array
        (
            'area' => 'Центр',
            'reg' => 'Тверская область',
            'city' => 'Тверь',
        ),

    '35.2 48.6' => Array
        (
            'area' => 'Центр',
            'reg' => 'Тульская область',
            'city' => 'Новомосковск',
        ),

    '37.6 54.1' => Array
        (
            'area' => 'Центр',
            'reg' => 'Тульская область',
            'city' => 'Тула',
        ),

    '39.8 57.6' => Array
        (
            'area' => 'Центр',
            'reg' => 'Ярославская область',
            'city' => 'Ярославль',
        ),

    '44.2 46.3' => Array
        (
            'area' => 'Южный федеральный округ',
            'reg' => 'Республика Калмыкия',
            'city' => 'Элиста',
        ),

    '38.8 45.6' => Array
        (
            'area' => 'Южный федеральный округ',
            'reg' => 'Краснодарский край',
            'city' => 'Тимашевск',
        ),

    '37.3 44.8' => Array
        (
            'area' => 'Южный федеральный округ',
            'reg' => 'Краснодарский край',
            'city' => 'Анапа',
        ),

    '38.0 44.5' => Array
        (
            'area' => 'Южный федеральный округ',
            'reg' => 'Краснодарский край',
            'city' => 'Геленджик',
        ),

    '41.0 44.9' => Array
        (
            'area' => 'Южный федеральный округ',
            'reg' => 'Краснодарский край',
            'city' => 'Армавир',
        ),

    '38.9 45.0' => Array
        (
            'area' => 'Южный федеральный округ',
            'reg' => 'Краснодарский край',
            'city' => 'Краснодар',
        ),

    '39.7 43.5' => Array
        (
            'area' => 'Южный федеральный округ',
            'reg' => 'Краснодарский край',
            'city' => 'Сочи',
        ),

    '48.0 46.3' => Array
        (
            'area' => 'Южный федеральный округ',
            'reg' => 'Астраханская область',
            'city' => 'Астрахань',
        ),

    '44.5 48.7' => Array
        (
            'area' => 'Южный федеральный округ',
            'reg' => 'Волгоградская область',
            'city' => 'Волгоград',
        ),

    '45.4 50.0' => Array
        (
            'area' => 'Южный федеральный округ',
            'reg' => 'Волгоградская область',
            'city' => 'Камышин',
        ),

    '42.1 47.5' => Array
        (
            'area' => 'Южный федеральный округ',
            'reg' => 'Ростовская область',
            'city' => 'Волгодонск',
        ),

    '39.7 47.2' => Array
        (
            'area' => 'Южный федеральный округ',
            'reg' => 'Ростовская область',
            'city' => 'Ростов-на-Дону',
        ),

    '40.2 47.7' => Array
        (
            'area' => 'Южный федеральный округ',
            'reg' => 'Ростовская область',
            'city' => 'Шахты',
        ),

    '34.2 62.1' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Республика Карелия',
            'city' => 'Кандопога',
        ),

    '30.5 64.5' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Республика Карелия',
            'city' => 'Костомукша',
        ),

    '50.8 61.6' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Республика Коми',
            'city' => 'Сыктывкар',
        ),

    '53.7 63.5' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Республика Коми',
            'city' => 'Ухта',
        ),

    '64.0 67.5' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Республика Коми',
            'city' => 'Воркута',
        ),

    '40.5 64.5' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Архангельская область',
            'city' => 'Архангельск',
        ),

    '46.6 61.2' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Архангельская область',
            'city' => 'Котлас',
        ),

    '40.8 64.4' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Архангельская область',
            'city' => 'Новодвинск',
        ),

    '39.8 59.2' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Вологодская область',
            'city' => 'Вологда',
        ),

    '37.9 59.1' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Вологодская область',
            'city' => 'Череповец',
        ),

    '22.0 54.4' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Калининградская область',
            'city' => 'Озерск',
        ),

    '20.5 54.7' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Калининградская область',
            'city' => 'Калининград',
        ),

    '32.0 59.4' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Ленинградская область',
            'city' => 'Кириши',
        ),

    '30.6 60.0' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Ленинградская область',
            'city' => 'Всеволожск',
        ),

    '28.7 60.7' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Ленинградская область',
            'city' => 'Выборг',
        ),

    '28.6 59.3' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Ленинградская область',
            'city' => 'Кингисепп',
        ),

    '30.3 59.9' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Ленинградская область',
            'city' => 'Санкт-петербург',
        ),

    '33.5 59.6' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Ленинградская область',
            'city' => 'Тихвин',
        ),

    '33.3 67.5' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Мурманская область',
            'city' => 'Алатиты',
        ),

    '32.8 67.9' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Мурманская область',
            'city' => 'Мончегорск',
        ),

    '33.0 68.9' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Мурманская область',
            'city' => 'Мурманск',
        ),

    '31.2 58.5' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Новгородская область',
            'city' => 'Великий Новгород',
        ),

    '33.9 58.3' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Псковская область',
            'city' => 'Боровичи',
        ),

    '30.5 56.3' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Псковская область',
            'city' => 'Великие Луки',
        ),

    '28.3 57.8' => Array
        (
            'area' => 'Северо-западный федеральный округ',
            'reg' => 'Псковская область',
            'city' => 'Псков',
        ),

    '129.7 62.0' => Array
        (
            'area' => 'Дальневосточный федеральный округ',
            'reg' => 'Республика Саха (Якутия)',
            'city' => 'Якутск',
        ),

    '113.9 62.5' => Array
        (
            'area' => 'Дальневосточный федеральный округ',
            'reg' => 'Республика Саха (Якутия)',
            'city' => 'Мирный',
        ),

    '158.6 53.0' => Array
        (
            'area' => 'Дальневосточный федеральный округ',
            'reg' => 'Камчатский край',
            'city' => 'Петропавловск-Камчатский',
        ),

    '131.9 43.1' => Array
        (
            'area' => 'Дальневосточный федеральный округ',
            'reg' => 'Приморский край',
            'city' => 'Владивосток',
        ),

    '137.0 50.5' => Array
        (
            'area' => 'Дальневосточный федеральный округ',
            'reg' => 'Хабаровский край',
            'city' => 'Комсомольск-на-Амуре',
        ),

    '135.0 48.4' => Array
        (
            'area' => 'Дальневосточный федеральный округ',
            'reg' => 'Хабаровский край',
            'city' => 'Хабаровск',
        ),

    '127.5 50.2' => Array
        (
            'area' => 'Дальневосточный федеральный округ',
            'reg' => 'Амурская область',
            'city' => 'Благовещенск',
        ),

    '150.8 59.5' => Array
        (
            'area' => 'Дальневосточный федеральный округ',
            'reg' => 'Магаданская область',
            'city' => 'Магадан',
        ),

    '142.7 46.9' => Array
        (
            'area' => 'Дальневосточный федеральный округ',
            'reg' => 'Сахалинская область',
            'city' => 'Южно-Сахалинск',
        ),

    '85.9 51.9' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Республика Алтай',
            'city' => 'Горно-Алтайск',
        ),

    '107.6 51.8' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Республика Бурятия',
            'city' => 'Улан-Удэ',
        ),

    '94.4 51.7' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Республика Тыва',
            'city' => 'Кызыл',
        ),

    '91.4 53.7' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Республика Хакасия',
            'city' => 'Абакан',
        ),

    '83.7 53.3' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Алтайский край',
            'city' => 'Барнаул',
        ),

    '81.2 51.5' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Алтайский край',
            'city' => 'Рубцовск',
        ),

    '85.2 52.5' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Алтайский край',
            'city' => 'Бийск',
        ),

    '113.4 52.0' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Забайкальский край',
            'city' => 'Чита',
        ),

    '90.4 56.2' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Красноярский край',
            'city' => 'Ачинск',
        ),

    '88.2 69.3' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Красноярский край',
            'city' => 'Норильск',
        ),

    '92.8 56.0' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Красноярский край',
            'city' => 'Красноярск',
        ),

    '95.7 56.2' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Красноярский край',
            'city' => 'Канск',
        ),

    '103.9 52.5' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Иркутская область',
            'city' => 'Ангарск',
        ),

    '102.8 58.0' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Иркутская область',
            'city' => 'Усть-Илимск',
        ),

    '104.2 52.3' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Иркутская область',
            'city' => 'Иркутск',
        ),

    '86.7 53.8' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Кемеровская область',
            'city' => 'Прокопьевск',
        ),

    '86.0 55.3' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Кемеровская область',
            'city' => 'Кемерово',
        ),

    '87.1 53.7' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Кемеровская область',
            'city' => 'Новокузнецк',
        ),

    '24.0 42.2' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Новосибирская область',
            'city' => 'Белово',
        ),

    '83.1 54.7' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Новосибирская область',
            'city' => 'Бердск',
        ),

    '82.9 55.0' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Новосибирская область',
            'city' => 'Новосибирск',
        ),

    '73.3 54.9' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Омская область',
            'city' => 'Омск',
        ),

    '84.9 56.4' => Array
        (
            'area' => 'Сибирский федеральный округ',
            'reg' => 'Томская область',
            'city' => 'Томск',
        ),

    '61.9 56.4' => Array
        (
            'area' => 'Уральский федеральный округ',
            'reg' => 'Свердловская область',
            'city' => 'Каменск-Уральский',
        ),

    '39.6 48.0' => Array
        (
            'area' => 'Уральский федеральный округ',
            'reg' => 'Свердловская область',
            'city' => 'Свердловск',
        ),

    '60.5 56.8' => Array
        (
            'area' => 'Уральский федеральный округ',
            'reg' => 'Свердловская область',
            'city' => 'Екатеринбург',
        ),

    '59.9 56.9' => Array
        (
            'area' => 'Уральский федеральный округ',
            'reg' => 'Свердловская область',
            'city' => 'Первоуральск',
        ),

    '68.2 58.1' => Array
        (
            'area' => 'Уральский федеральный округ',
            'reg' => 'Тюменская область',
            'city' => 'Тобольск',
        ),

    '65.5 57.1' => Array
        (
            'area' => 'Уральский федеральный округ',
            'reg' => 'Тюменская область',
            'city' => 'Тюмень',
        ),

    '60.7 56.0' => Array
        (
            'area' => 'Уральский федеральный округ',
            'reg' => 'Челябинская область',
            'city' => 'Снежинск',
        ),

    '59.7 55.1' => Array
        (
            'area' => 'Уральский федеральный округ',
            'reg' => 'Челябинская область',
            'city' => 'Златоуст',
        ),

    '58.9 53.4' => Array
        (
            'area' => 'Уральский федеральный округ',
            'reg' => 'Челябинская область',
            'city' => 'Магнитогорск',
        ),

    '60.1 55.0' => Array
        (
            'area' => 'Уральский федеральный округ',
            'reg' => 'Челябинская область',
            'city' => 'Миасс',
        ),

    '2.3 48.8' => Array
        (
            'area' => 'Уральский федеральный округ',
            'reg' => 'Челябинская область',
            'city' => 'Париж',
        ),

    '37.2 55.4' => Array
        (
            'area' => 'Уральский федеральный округ',
            'reg' => 'Челябинская область',
            'city' => 'Троицк',
        ),

    '61.4 55.1' => Array
        (
            'area' => 'Уральский федеральный округ',
            'reg' => 'Челябинская область',
            'city' => 'Челябинск',
        ),

    '75.4 63.1' => Array
        (
            'area' => 'Уральский федеральный округ',
            'reg' => 'Ямало-Ненецкий автономный округ',
            'city' => 'Ноябрьск',
        ),

    '76.7 66.0' => Array
        (
            'area' => 'Уральский федеральный округ',
            'reg' => 'Ямало-Ненецкий автономный округ',
            'city' => 'Новый Уренгой',
        ),

    '73.4 61.2' => Array
        (
            'area' => 'Уральский федеральный округ',
            'reg' => 'Ханты-Мансийский автономный округ - Югра',
            'city' => 'Сургут',
        ),

    '72.6 61.1' => Array
        (
            'area' => 'Уральский федеральный округ',
            'reg' => 'Ханты-Мансийский автономный округ - Югра',
            'city' => 'Нефтеюганск',
        ),

    '69.0 61.0' => Array
        (
            'area' => 'Уральский федеральный округ',
            'reg' => 'Ханты-Мансийский автономный округ - Югра',
            'city' => 'Ханты-Мансийск',
        ),

    '55.9 53.3' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Республика Башкортостан',
            'city' => 'Салават',
        ),

    '85.4 56.7' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Республика Башкортостан',
            'city' => 'Октябрьский',
        ),

    '55.9 54.7' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Республика Башкортостан',
            'city' => 'Уфа',
        ),

    '54.2 56.0' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Республика Башкортостан',
            'city' => 'Нефтекамск',
        ),

    '47.8 56.6' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Республика Марий Эл',
            'city' => 'Йошкар-Ола',
        ),

    '45.1 54.1' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Республика Мордовия',
            'city' => 'Саранск',
        ),

    '52.3 54.8' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Республика Татарстан',
            'city' => 'Альметьевск',
        ),

    '52.8 54.5' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Республика Татарстан',
            'city' => 'Бугульма',
        ),

    '52.0 55.7' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Республика Татарстан',
            'city' => 'Елабуга',
        ),

    '49.1 55.7' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Республика Татарстан',
            'city' => 'Казань',
        ),

    '52.4 55.7' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Республика Татарстан',
            'city' => 'Набережные Челны',
        ),

    '49.6 58.6' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Кировская область',
            'city' => 'Киров',
        ),

    '35.6 58.4' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Кировская область',
            'city' => 'Вятка',
        ),

    '44.7 56.3' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Нижегородская область',
            'city' => 'Нижегородская область',
        ),

    '43.8 55.3' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Нижегородская область',
            'city' => 'Арзамас',
        ),

    '43.3 54.9' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Нижегородская область',
            'city' => 'Саров',
        ),

    '44.1 56.1' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Нижегородская область',
            'city' => 'Кстово',
        ),

    '44.0 56.3' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Нижегородская область',
            'city' => 'Нижний Новгород',
        ),

    '58.3 51.2' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Оренбургская область',
            'city' => 'Новотроицк',
        ),

    '55.0 51.7' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Оренбургская область',
            'city' => 'Оренбург',
        ),

    '58.5 51.2' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Оренбургская область',
            'city' => 'Орск',
        ),

    '44.9 53.1' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Пензенская область',
            'city' => 'Пенза',
        ),

    '54.1 56.7' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Пермский край',
            'city' => 'Чайковский',
        ),

    '56.2 58.0' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Пермский край',
            'city' => 'Пермь',
        ),

    '56.7 59.4' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Пермский край',
            'city' => 'Усолье',
        ),

    '50.1 53.2' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Самарская область',
            'city' => 'Самара',
        ),

    '48.4 53.1' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Самарская область',
            'city' => 'Сызрань',
        ),

    '49.4 53.5' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Самарская область',
            'city' => 'Тольятти',
        ),

    '47.8 51.9' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Саратовская область',
            'city' => 'Балаково',
        ),

    '46.1 51.4' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Саратовская область',
            'city' => 'Саратов',
        ),

    '25.6 42.0' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Ульяновская область',
            'city' => 'Димитровград',
        ),

    '48.4 54.3' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Ульяновская область',
            'city' => 'Ульяновск',
        ),

    '53.9 57.0' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Республика Удмуртия',
            'city' => 'Воткинск',
        ),

    '53.1 56.8' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Республика Удмуртия',
            'city' => 'Ижевск',
        ),

    '47.2 56.1' => Array
        (
            'area' => 'Приволжский федеральный округ',
            'reg' => 'Республика Чувашия',
            'city' => 'Чебоксары',
        ),

    '47.4 42.9' => Array
        (
            'area' => 'Северо-Кавказский федеральный округ',
            'reg' => 'Республика Дагестан',
            'city' => 'Махачкала',
        ),

    '45.6 43.3' => Array
        (
            'area' => 'Северо-Кавказский федеральный округ',
            'reg' => 'Чеченская Республика',
            'city' => 'Грозный',
        ),

    '43.0 44.0' => Array
        (
            'area' => 'Северо-Кавказский федеральный округ',
            'reg' => 'Ставропольский край',
            'city' => 'Есентуки',
        ),

    '43.1 44.1' => Array
        (
            'area' => 'Северо-Кавказский федеральный округ',
            'reg' => 'Ставропольский край',
            'city' => 'Минеральные Воды',
        ),

    '42.7 43.9' => Array
        (
            'area' => 'Северо-Кавказский федеральный округ',
            'reg' => 'Ставропольский край',
            'city' => 'Кисловодск',
        ),

    '41.9 45.0' => Array
        (
            'area' => 'Северо-Кавказский федеральный округ',
            'reg' => 'Ставропольский край',
            'city' => 'Ставрополь',
        ),

    '43.6 43.4' => Array
        (
            'area' => 'Северо-Кавказский федеральный округ',
            'reg' => 'Республика Кабардино-Балкария',
            'city' => 'Нальчик',
        ),

);

$wobot['destn'] = array(
'moskva'=>array('37.609218','55.753559'),
'sankt-peterburg'=>array('30.313497','59.938531'),
'ekaterinburg'=>array('60.617435','56.829748'),
'odessa'=>array('30.7058','46.466444'),
'kaluga'=>array('36.247686','54.535128'),
'minsk'=>array('27.696614','53.881961'),
'sevastopol'=>array('33.558616','44.585098'),
'astrahan'=>array('48.067419','46.316913'),
'krasnodar'=>array('38.963672','45.0141'),
'kiev'=>array('30.532685','50.40241'),
'harkov'=>array('36.280574','49.98776'),
'samara'=>array('50.19908','53.244418'),
'berestovitsa'=>array('24.380753','53.844627'),
'ulyanovsk'=>array('48.472015','54.316581'),
'pekin'=>array('116.323017','39.876918'),
'kishinev'=>array('28.838526','47.012925'),
'orenburg'=>array('55.09735','51.768099'),
'volgograd'=>array('44.51420799999999','48.708898'),
'donetsk'=>array('37.763791','47.992324'),
'kazan'=>array('49.122853','55.786764'),
'riga'=>array('24.099454','56.958257')
);

$wobot1['destn1'] = array(
'37.609218 55.753559'=>'Москва',
'30.314772 59.938189'=>'Санкт-петербург',
'60.597340 56.837982'=>'Екатеринбург',
'103.682149 65.084965'=>'Россия',
'30.739846 46.469517'=>'Одесса',
'36.247686 54.535128'=>'Калуга',
'27.561741 53.903499'=>'Минск',
'33.558616 44.585098'=>'Севастопль',
'82.919388 55.029838'=>'Новосибирск',
'48.067419 46.316913'=>'Астрахань',
'38.963672 45.0141'=>'Краснодар',
'30.522301 50.451118'=>'Киев',
'36.280574 49.98776'=>'Харьков',
'50.199080 53.244418'=>'Самара',
'44.001890 56.324461'=>'Нижний Новгород',
'56.241077 58.008490'=>'Пермь',
'39.744918 47.227163'=>'Ростов-на-Дону',
'61.400820 55.160324'=>'Челябинск',
'49.122853 55.786764'=>'Казань',
'38.976032 45.034942'=>'Краснодар',
'39.204078 51.662507'=>'Воронеж',
'55.983161 54.738437'=>'Уфа',
'73.365364 54.990302'=>'Омск',
'44.515942 48.707793'=>'Волгоград',
'46.004459 51.537775'=>'Саратов',
'104.275630 52.313021'=>'Иркутск',
'92.870412 56.008711'=>'Красноярск',
'84.962543 56.463988'=>'Томск',
'131.928478 43.134091'=>'Владивосток',
'48.472015 54.316581'=>'Ульяновск',
'37.619028 54.193802'=>'Тула',
'24.099454 56.958257'=>'Рига',
'35.892250 56.855526'=>'Тверь',
'65.558412 57.182631'=>'Тюмень',
'83.761648 53.356336'=>'Барнаул',
'48.030340 46.349636'=>'Астрахань',
'35.045408 48.464567'=>'Днепропетровск',
'53.174075 56.856702'=>'Ижевск',
'135.056475 48.460732'=>'Хабаровск',
'20.500803 54.719700'=>'Калининград',
'39.887714 57.622506'=>'Ярославль',
'76.912335 43.280810'=>'Алматы', 
'49.667232 58.603394'=>'Киров',
'55.097350 51.768099'=>'Оренбург',
'44.997376 53.183188'=>'Пенза',
'40.996702 57.008607'=>'Иваново',
'47.249156 56.138950'=>'Чебоксары',
'37.801898 48.016058'=>'Донецк',
'24.031200 49.842164'=>'Львов',
'33.077819 68.963322'=>'Мурманск',
'-0.078989 51.490054'=>'Лондон',
'33.524641 44.617470'=>'Севастополь',
'86.052433 55.371234'=>'Кемерово',
'39.597594 52.603587'=>'Липецк',
'-95.854104 38.041216'=>'США',
'27.979781 53.791257'=>'Беларусь',
'31.999095 54.779800'=>'Смоленск',
'47.874509 56.636382'=>'Йошкар-Ола',
'41.965167 45.042935'=>'Ставрополь',
'40.420325 56.134450'=>'Владимир',
'39.731039 54.619432'=>'Рязань',
'39.722271 43.582795'=>'Сочи',
'24.734779 59.405984'=>'Таллин',
'-74.039784 40.802941'=>'Нью-Йорк',
'49.418084 53.511311'=>'Тольятти',
'28.838526 47.012925'=>'Кишинев',
'40.551776 64.545818'=>'Архангельск',
'53.728444 32.722462'=>'Иран',
'34.376235 53.281039'=>'Брянск',
'37.199955 55.984421'=>'Зеленоград',
'36.598155 50.600486'=>'Белгород',
'39.883869 59.223043'=>'Вологда',
'41.442401 52.719785'=>'Тамбов',
'34.869635 32.111343'=>'Тель-Авив',
'36.079818 52.965679'=>'Орел',
'36.181714 51.717178'=>'Курск',
'50.837189 61.669587'=>'Сыктывкар',
'14.439385 50.071737'=>'Прага',
'34.097111 44.952333'=>'Симферополь',
'35.242355 31.763526'=>'Иерусалим',
'49.977852 40.420103'=>'Баку',
'2.348825 48.859917'=>'Париж',
'35.139588 47.839497'=>'Запорожье',
'52.407911 55.741678'=>'Набережные Челны',
'-79.427061 43.691014'=>'Торонто'
);


$wobot['destn2'] = array(
	'Москва'=>'37.6 55.7',
	'Санкт-петербург'=>'30.3 59.9',
	'Екатеринбург'=>'60.5 56.8',
	//'Россия'=>'103.6 65.0',
	'Одесса'=>'30.7 46.4',
	'Калуга'=>'36.2 54.5',
	'Минск'=>'27.5 53.9',
	'Севастопль'=>'33.5 44.5',
	'Новосибирск'=>'82.9 55.0',
	'Астрахань'=>'48.0 46.3',
	'Краснодар'=>'38.9 45.0',
	'Киев'=>'30.5 50.4',
	'Харьков'=>'36.2 49.9',
	'Самара'=>'50.1 53.2',
	'Нижний Новгород'=>'44.0 56.3',
	'Пермь'=>'56.2 58.0',
	'Ростов-на-Дону'=>'39.7 47.2',
	'Челябинск'=>'61.4 55.1',
	'Казань'=>'49.1 55.7',
	'Краснодар'=>'38.9 45.0',
	'Воронеж'=>'39.2 51.6',
	'Уфа'=>'55.9 54.7',
	'Омск'=>'73.3 54.9',
	'Волгоград'=>'44.5 48.7',
	'Саратов'=>'46.0 51.5',
	'Иркутск'=>'104.2 52.3',
	'Красноярск'=>'92.8 56.0',
	'Томск'=>'84.9 56.4',
	'Владивосток'=>'131.9 43.1',
	'Ульяновск'=>'48.4 54.3',
	'Тула'=>'37.6 54.1',
	'Рига'=>'24.0 56.9',
	'Тверь'=>'35.8 56.8',
	'Тюмень'=>'65.5 57.1',
	'Барнаул'=>'83.7 53.3',
	'Астрахань'=>'48.0 46.3',
	'Днепропетровск'=>'35.0 48.4',
	'Ижевск'=>'53.1 56.8',
	'Хабаровск'=>'135.0 48.4',
	'Калининград'=>'20.5 54.7',
	'Ярославль'=>'39.8 57.6',
	'Алматы'=>'76.9 43.2', 
	'Киров'=>'49.6 58.6',
	'Оренбург'=>'55.0 51.7',
	'Пенза'=>'44.9 53.1',
	'Иваново'=>'40.9 57.0',
	'Чебоксары'=>'47.2 56.1',
	'Донецк'=>'37.8 48.0',
	'Львов'=>'24.0 49.8',
	'Мурманск'=>'33.0 68.9',
	'Лондон'=>'-0.0 51.4',
	'Севастополь'=>'33.5 44.6',
	'Кемерово'=>'86.0 55.3',
	'Липецк'=>'39.5 52.6',
	'США'=>'-95.8 38.0',
	'Беларусь'=>'27.9 53.7',
	'Смоленск'=>'31.9 54.7',
	'Йошкар-Ола'=>'47.8 56.6',
	'Ставрополь'=>'41.9 45.0',
	'Владимир'=>'40.4 56.1',
	'Рязань'=>'39.7 54.6',
	'Сочи'=>'39.7 43.5',
	'Таллин'=>'24.7 59.4',
	'Нью-Йорк'=>'-74.0 40.8',
	'Тольятти'=>'49.4 53.5',
	'Кишинев'=>'28.8 47.0',
	'Архангельск'=>'40.5 64.5',
	'Иран'=>'53.7 32.7',
	'Брянск'=>'34.3 53.2',
	'Зеленоград'=>'37.1 55.9',
	'Белгород'=>'36.5 50.6',
	'Вологда'=>'39.8 59.2',
	'Тамбов'=>'41.4 52.7',
	'Тель-Авив'=>'34.8 32.1',
	'Орел'=>'36.0 52.9',
	'Курск'=>'36.1 51.7',
	'Сыктывкар'=>'50.8 61.6',
	'Прага'=>'14.4 50.0',
	'Симферополь'=>'34.0 44.9',
	'Иерусалим'=>'35.2 31.7',
	'Баку'=>'49.9 40.4',
	'Париж'=>'2.3 48.8',
	'Запорожье'=>'35.1 47.8',
	'Набережные Челны'=>'52.4 55.7',
	'Торонто'=>'-79.4 43.6',
	'Махачкала'=>'47.4 42.9',
	'Баку'=>'49.9 40.4',
	'Тбилиси'=>'44.8 41.6',
	'Химки'=>'37.3 55.9',
	'Псков'=>'28.3 57.8',
	'Казахстан'=>'66.9 48.5',
	'Кувейт'=>'47.4 29.2',
	'Мексика'=>'-98.9 19.3',
	'Новокузнецк'=>'87.1 53.7',
	'Бишкек'=>'74.5 42.8',
	'Ошава'=>'-78.6 43.6',
	'Ташкент'=>'69.2 41.2',
	'Луганск'=>'39.3 48.5',
	'Болгария'=>'26.7 43.0',
	'Подольск'=>'37.5 55.4',
	'Одинцово'=>'37.2 55.6',
	'Берлин'=>'13.4 52.4',
	'Саранск'=>'45.1 54.1',
	'Мытищи'=>'37.7 55.9',
	'Джакарта'=>'106.8 -5.8',
	'Кострома'=>'40.9 57.7',
	'Николаев'=>'31.9 46.9',
	'Израиль'=>'35.0 32.7',
	'Великий Новгород'=>'31.2 58.5',
	//'Израиль'=>'35.0 31.3',
	'Королев'=>'37.8 55.9',
	'Тимашевск'=>'38.8 45.6',
	'Люберцы'=>'37.9 55.7',
	'Индонезия'=>'113.9 0.0',
	'Астана'=>'71.4 51.1',
	'Магнитогорск'=>'58.9 53.4',
	'Будапешт'=>'19.0 47.4',
	'Долгопрудный'=>'37.4 55.9',
	'Магадан'=>'150.8 59.5',
	'Сургут'=>'73.4 61.2',
	'Череповец'=>'37.9 59.1',
	'Жуковский'=>'38.1 55.5',
	'Германия'=>'10.4 51.2',
	'Литва'=>'25.2 54.6',
	'Чита'=>'113.4 52.0',
	'Молдавия'=>'28.3 47.0',
	'Кременчуг'=>'33.4 49.0',
	'Улан-Удэ'=>'107.6 51.8',
	'Грондо'=>'23.8 53.6',
	'Раменское'=>'38.2 55.5',
	'Нижегородская область'=>'44.7 56.3',
	'Абакан'=>'91.4 53.7',
	'Якутск'=>'129.7 62.0',
	'Гоа'=>'24.6 -27.4',
	'Токио'=>'139.7 35.6',
	'Вена'=>'16.3 48.1',
	'Есентуки'=>'43.0 44.0',
	'Дубна'=>'37.1 56.7',
	'Серпухов'=>'37.4 54.9',
	'Хабаровск'=>'135.0 48.4',
	'Вашингтон'=>'-77.0 38.8',
	//'Москва'=>'38.8 58.0',
	'США'=>'-95.8 38.0',
	'ровно'=>'26.2 50.6',
	'Торонто'=>'-79.4 43.6',
	'Бишкек'=>'74.5 42.8',
	'Ташкент'=>'69.2 41.2',
	'Балаково'=>'47.8 51.9',
	//'Москва'=>'37.4 55.8',
	'Ужгород'=>'22.2 48.6',
	'Альметьевск'=>'52.3 54.8',
	'Ухта'=>'53.7 63.5',
	'Выборг'=>'28.7 60.7',
	'Караганда'=>'73.1 49.8',
	'Орск'=>'58.5 51.2',
	'Красногорск'=>'37.3 55.8',
	'Болгария'=>'26.7 43.0',
	'Новомосковск'=>'35.2 48.6',
	'Анапа'=>'37.3 44.8',
	//'Москва'=>'37.5 48.7',
	//'США'=>'-94.2 38.0',
	//'Россия'=>'30.1 59.5',
	'Электросталь'=>'38.4 55.7',
	'Днепродзержинск'=>'34.5 48.5',
	'Луцк'=>'25.3 50.7',
	'Южно-Сахалинск'=>'142.7 46.9',
	'Коломна'=>'38.7 55.0',
	'Ангарск'=>'103.9 52.5',
	'Димитровград'=>'25.6 42.0',
	'Вильнюс'=>'25.2 54.6',
	'Железнодорожный'=>'38.0 55.7',
	'Сергиев Посад'=>'38.1 56.3',
	'Обнинск'=>'36.6 55.1',
	'Бийск'=>'85.2 52.5',
	//'Электросталь'=>'38.4 55.8',
	'Горловка'=>'38.1 48.3',
	//'Королёв'=>'37.9 55.9',
	'Вашингтон'=>'-77.0 38.8',
	'Кингисепп'=>'28.6 59.3',
	//'Чебоксары'=>'47.4 56.0',
	//'Лондон'=>'0.0 51.4',
	'Измаил'=>'28.8 45.3',
	'Ачинск'=>'90.4 56.2',
	'Великие Луки'=>'30.5 56.3',
	'Ставрополь'=>'41.9 45.0',
	'Троицк'=>'37.2 55.4',
	'Иваново'=>'40.9 57.0',
	'Бостон'=>'-71.1 42.3',
	'Лисичанск'=>'38.4 48.9',
	'Нальчик'=>'43.6 43.4',
	'Первоуральск'=>'59.9 56.9',
	'Чикаго'=>'-87.7 41.8',
	'Димитров'=>'38.8 45.6',
	'Миасс'=>'60.1 55.0',
	'Алупка'=>'34.1 44.4',
	'Мелитополь'=>'35.3 46.8',
	'Ханты-Мансийск'=>'69.0 61.0',
	'Вена'=>'16.3 48.1',
	'Тирасполь'=>'29.6 46.8',
	'Пушкино'=>'37.8 56.0',
	'Яхрома'=>'37.5 56.3',
	'Барселона'=>'2.1 41.3',
	'Камышин'=>'45.4 50.0',
	'Хельсинки'=>'24.9 60.2',
	'Балашиха'=>'37.9 55.8',
	'Волгодонск'=>'42.1 47.5',
	'Орехово-Зуево'=>'38.9 55.8',
	'Алатиты'=>'33.3 67.5',
	'Амстердам'=>'4.8 52.3',
	'Клин'=>'36.7 56.3',
	'Воркута'=>'64.0 67.5',
	'Саратов'=>'46.1 51.4',
	'Шахты'=>'40.2 47.7',
	'Нефтекамск'=>'54.2 56.0',
	'Нефтеюганск'=>'72.6 61.1',
	'Кызыл'=>'94.4 51.7',
	'Елец'=>'38.5 52.6',
	'Истра'=>'36.8 55.9',
	'Елабуга'=>'52.0 55.7',
	'Канск'=>'95.7 56.2',
	'Феодосия'=>'35.3 45.0',
	'Ковров'=>'41.3 56.3',
	'Сызрань'=>'48.4 53.1',
	'Алчевск'=>'38.7 48.4',
	'Саров'=>'43.3 54.9',
	'Евпатория'=>'33.3 45.1',
	'Бердянск'=>'36.7 46.7',
	'Бердск'=>'83.1 54.7',
	'Белая Церковь'=>'30.1 49.8',
	'Лыткарино'=>'37.9 55.6',
	'Муром'=>'42.0 55.5',
	'Молдавия'=>'28.3 47.0',
	'Чехов'=>'37.4 55.1',
	'Прокопьевск'=>'86.7 53.8',
	'Кисловодск'=>'42.7 43.9',
	'Бобруйск'=>'29.1 53.1',
	//'Москва'=>'37.8 55.7',
	'Элиста'=>'44.2 46.3',
	//'Санкт-Петербург'=>'30.9 59.8',
	//'Джакарта'=>'106.8 -6.2',
	'Огре'=>'24.6 56.8',
	'Сан-Франциско'=>'-122.3 37.5',
	'Фрязино'=>'38.0 55.9',
	'Дрогобыч'=>'23.5 49.3',
	'Салават'=>'55.9 53.3',
	'Железногорск'=>'93.6 56.3',
	'Керчь'=>'36.4 45.3',
	'Грозный'=>'45.6 43.3',
	//'Иран'=>'55.7 37.5',
	'Чайковский'=>'54.1 56.7',
	'Геленджик'=>'38.0 44.5',
	'Гамбург'=>'9.9 53.6',
	'Златоуст'=>'59.7 55.1',
	'Наро-Фоминск'=>'36.7 55.3',
	//'Екатеринбург'=>'60.7 56.8',
	'Свердловск'=>'39.6 48.0',
	'Енакиево'=>'38.2 48.2',
	'Домодедово'=>'37.9 55.4',
	'Брянка'=>'38.6 48.5',
	'Каменск-Уральский'=>'61.9 56.4',
	'Павлоград'=>'35.8 48.5',
	//'Россия'=>'49.3 58.4',
	'Барановичи'=>'26.0 53.1',
	'Мончегорск'=>'32.8 67.9',
	'Первомайск'=>'38.5 48.6',
	'Октябрьский'=>'85.4 56.7',
	'Пекин'=>'116.3 39.8',
	'Бровары'=>'30.7 50.5',
	'Котлас'=>'46.6 61.2',
	'Бангкок'=>'100.5 13.7',
	'Мексика'=>'-98.9 19.3',
	'Херсон'=>'32.7 46.6',
	'Пинск'=>'26.0 52.1',
	'Благовещенск'=>'127.5 50.2',
	//'Благовещенск'=>'55.9 55.0',
	'Франкфурт-на-Майне'=>'8.6 50.1',
	'Новый Уренгой'=>'76.7 66.0',
	'Арзамас'=>'43.8 55.3',
	'Ильичевск'=>'30.6 46.2',
	//'Киев'=>'30.2 50.5',
	'Глазгов'=>'52.6 58.1',
	'Армавир'=>'41.0 44.9',
	'Озерск'=>'22.0 54.4',
	'Мирный'=>'113.9 62.5',
	'Тихвин'=>'33.5 59.6',
	'Комсомольск-на-Амуре'=>'137.0 50.5',
	'Новополоцк'=>'28.6 55.5',
	'Орша'=>'30.4 54.5',
	'Петропавловск-Камчатский'=>'158.6 53.0',
	'Всеволожск'=>'30.6 60.0',
	'Усть-Илимск'=>'102.8 58.0',
	'Горно-Алтайск'=>'85.9 51.9',
	'Норильск'=>'88.2 69.3',
	//'Германия'=>'11.9 50.8',
	'Кстово'=>'44.1 56.1',
	//'Иран'=>'55.7 37.6',
	'Снежинск'=>'60.7 56.0',
	'Даугавлипс'=>'26.5 55.8',
	'Тобольск'=>'68.2 58.1',
	'Коараз'=>'-0.2 43.1',
	'Усолье'=>'56.7 59.4',
	'Актобе'=>'57.1 50.2',
	'Минудешт'=>'55.8 37.5',
	'Манчестер'=>'-2.2 53.4',
	'Нарва'=>'28.0 59.4',
	'Вятка'=>'35.6 58.4',
	'Новодвинск'=>'40.8 64.4',
	'Ноябрьск'=>'75.4 63.1',
	//'Королёв'=>'27.7 53.9',
	'Ступино'=>'38.0 54.8',
	'Боровичи'=>'33.9 58.3',
	'Губкин'=>'37.5 51.2',
	'Кандопога'=>'34.2 62.1',
	'Менфи'=>'12.9 37.6',
	'Костомукша'=>'30.5 64.5',
	'Мичуринск'=>'40.4 52.8',
	'Бугульма'=>'52.8 54.5',
	//'Химки'=>'37.5 55.9',
	'Новотроицк'=>'58.3 51.2',
	//'Санкт-Петербург'=>'8.6 54.3',
	'Воткинск'=>'53.9 57.0',
	'Минеральные Воды'=>'43.1 44.1',
	'Прага'=>'14.4 50.0',
	'Симферополь'=>'34.0 44.9',
	'Сергиев-Посад'=>'38.1 56.2',
	'Семипалатинск'=>'80.2 50.4',
	'Белово'=>'24.0 42.2',
	//'Минск'=>'21.5 52.1',
	'Рубцовск'=>'81.2 51.5',
	'Климовск'=>'37.5 55.3',
	'Кириши'=>'32.0 59.4',
	'Дублин'=>'-6.2 53.3',
	'Украина'=>'31.0 48.0'
);

$wobot['destn1'] = array(
	'37.6 55.7'=>'Москва',
	'30.3 59.9'=>'Санкт-петербург',
	'60.5 56.8'=>'Екатеринбург',
	'103.6 65.0'=>'Россия',
	'30.7 46.4'=>'Одесса',
	'36.2 54.5'=>'Калуга',
	'27.5 53.9'=>'Минск',
	'33.5 44.5'=>'Севастопль',
	'82.9 55.0'=>'Новосибирск',
	'48.0 46.3'=>'Астрахань',
	'38.9 45.0'=>'Краснодар',
	'30.5 50.4'=>'Киев',
	'36.2 49.9'=>'Харьков',
	'50.1 53.2'=>'Самара',
	'44.0 56.3'=>'Нижний Новгород',
	'56.2 58.0'=>'Пермь',
	'39.7 47.2'=>'Ростов-на-Дону',
	'61.4 55.1'=>'Челябинск',
	'49.1 55.7'=>'Казань',
	'38.9 45.0'=>'Краснодар',
	'39.2 51.6'=>'Воронеж',
	'55.9 54.7'=>'Уфа',
	'73.3 54.9'=>'Омск',
	'44.5 48.7'=>'Волгоград',
	'46.0 51.5'=>'Саратов',
	'104.2 52.3'=>'Иркутск',
	'92.8 56.0'=>'Красноярск',
	'84.9 56.4'=>'Томск',
	'131.9 43.1'=>'Владивосток',
	'48.4 54.3'=>'Ульяновск',
	'37.6 54.1'=>'Тула',
	'24.0 56.9'=>'Рига',
	'35.8 56.8'=>'Тверь',
	'65.5 57.1'=>'Тюмень',
	'83.7 53.3'=>'Барнаул',
	'48.0 46.3'=>'Астрахань',
	'35.0 48.4'=>'Днепропетровск',
	'53.1 56.8'=>'Ижевск',
	'135.0 48.4'=>'Хабаровск',
	'20.5 54.7'=>'Калининград',
	'39.8 57.6'=>'Ярославль',
	'76.9 43.2'=>'Алматы', 
	'49.6 58.6'=>'Киров',
	'55.0 51.7'=>'Оренбург',
	'44.9 53.1'=>'Пенза',
	'40.9 57.0'=>'Иваново',
	'47.2 56.1'=>'Чебоксары',
	'37.8 48.0'=>'Донецк',
	'24.0 49.8'=>'Львов',
	'33.0 68.9'=>'Мурманск',
	'-0.0 51.4'=>'Лондон',
	'33.5 44.6'=>'Севастополь',
	'86.0 55.3'=>'Кемерово',
	'39.5 52.6'=>'Липецк',
	'-95.8 38.0'=>'США',
	'27.9 53.7'=>'Беларусь',
	'31.9 54.7'=>'Смоленск',
	'47.8 56.6'=>'Йошкар-Ола',
	'41.9 45.0'=>'Ставрополь',
	'40.4 56.1'=>'Владимир',
	'39.7 54.6'=>'Рязань',
	'39.7 43.5'=>'Сочи',
	'24.7 59.4'=>'Таллин',
	'-74.0 40.8'=>'Нью-Йорк',
	'49.4 53.5'=>'Тольятти',
	'28.8 47.0'=>'Кишинев',
	'40.5 64.5'=>'Архангельск',
	'53.7 32.7'=>'Иран',
	'34.3 53.2'=>'Брянск',
	'37.1 55.9'=>'Зеленоград',
	'36.5 50.6'=>'Белгород',
	'39.8 59.2'=>'Вологда',
	'41.4 52.7'=>'Тамбов',
	'34.8 32.1'=>'Тель-Авив',
	'36.0 52.9'=>'Орел',
	'36.1 51.7'=>'Курск',
	'50.8 61.6'=>'Сыктывкар',
	'14.4 50.0'=>'Прага',
	'34.0 44.9'=>'Симферополь',
	'35.2 31.7'=>'Иерусалим',
	'49.9 40.4'=>'Баку',
	'2.3 48.8'=>'Париж',
	'35.1 47.8'=>'Запорожье',
	'52.4 55.7'=>'Набережные Челны',
	'-79.4 43.6'=>'Торонто',
	'47.4 42.9'=>'Махачкала',
	'49.9 40.4'=>'Баку',
	'44.8 41.6'=>'Тбилиси',
	'37.3 55.9'=>'Химки',
	'28.3 57.8'=>'Псков',
	'66.9 48.5'=>'Казахстан',
	'47.4 29.2'=>'Кувейт',
	'-98.9 19.3'=>'Мексика',
	'87.1 53.7'=>'Новокузнецк',
	'74.5 42.8'=>'Бишкек',
	'-78.6 43.6'=>'Ошава',
	'69.2 41.2'=>'Ташкент',
	'39.3 48.5'=>'Луганск',
	'26.7 43.0'=>'Болгария',
	'37.5 55.4'=>'Подольск',
	'37.2 55.6'=>'Одинцово',
	'13.4 52.4'=>'Берлин',
	'45.1 54.1'=>'Саранск',
	'37.7 55.9'=>'Мытищи',
	'106.8 -5.8'=>'Джакарта',
	'40.9 57.7'=>'Кострома',
	'31.9 46.9'=>'Николаев',
	'35.0 32.7'=>'Израиль',
	'31.2 58.5'=>'Великий Новгород',
	//'35.0 31.3'=>'Израиль',
	'37.8 55.9'=>'Королев',
	'38.8 45.6'=>'Тимашевск',
	'37.9 55.7'=>'Люберцы',
	'113.9 0.0'=>'Индонезия',
	'71.4 51.1'=>'Астана',
	'58.9 53.4'=>'Магнитогорск',
	'19.0 47.4'=>'Будапешт',
	'37.4 55.9'=>'Долгопрудный',
	'150.8 59.5'=>'Магадан',
	'73.4 61.2'=>'Сургут',
	'37.9 59.1'=>'Череповец',
	'38.1 55.5'=>'Жуковский',
	'10.4 51.2'=>'Германия',
	'25.2 54.6'=>'Литва',
	'113.4 52.0'=>'Чита',
	'28.3 47.0'=>'Молдавия',
	'33.4 49.0'=>'Кременчуг',
	'107.6 51.8'=>'Улан-Удэ',
	'23.8 53.6'=>'Грондо',
	'38.2 55.5'=>'Раменское',
	'44.7 56.3'=>'Нижегородская область',
	'91.4 53.7'=>'Абакан',
	'129.7 62.0'=>'Якутск',
	'24.6 -27.4'=>'Гоа',
	'139.7 35.6'=>'Токио',
	'16.3 48.1'=>'Вена',
	'43.0 44.0'=>'Есентуки',
	'37.1 56.7'=>'Дубна',
	'37.4 54.9'=>'Серпухов',
	'135.0 48.4'=>'Хабаровск',
	'-77.0 38.8'=>'Вашингтон',
	//'38.8 58.0'=>'Москва',
	'-95.8 38.0'=>'США',
	'26.2 50.6'=>'ровно',
	'-79.4 43.6'=>'Торонто',
	'74.5 42.8'=>'Бишкек',
	'69.2 41.2'=>'Ташкент',
	'47.8 51.9'=>'Балаково',
	//'37.4 55.8'=>'Москва',
	'22.2 48.6'=>'Ужгород',
	'52.3 54.8'=>'Альметьевск',
	'53.7 63.5'=>'Ухта',
	'28.7 60.7'=>'Выборг',
	'73.1 49.8'=>'Караганда',
	'58.5 51.2'=>'Орск',
	'37.3 55.8'=>'Красногорск',
	'26.7 43.0'=>'Болгария',
	'35.2 48.6'=>'Новомосковск',
	'37.3 44.8'=>'Анапа',
	//'37.5 48.7'=>'Москва',
	//'-94.2 38.0'=>'США',
	//'30.1 59.5'=>'Россия',
	'38.4 55.7'=>'Электросталь',
	'34.5 48.5'=>'Днепродзержинск',
	'25.3 50.7'=>'Луцк',
	'142.7 46.9'=>'Южно-Сахалинск',
	'38.7 55.0'=>'Коломна',
	'103.9 52.5'=>'Ангарск',
	'25.6 42.0'=>'Димитровград',
	'25.2 54.6'=>'Вильнюс',
	'38.0 55.7'=>'Железнодорожный',
	'38.1 56.3'=>'Сергиев Посад',
	'36.6 55.1'=>'Обнинск',
	'85.2 52.5'=>'Бийск',
	//'38.4 55.8'=>'Электросталь',
	'38.1 48.3'=>'Горловка',
	//'37.9 55.9'=>'Королёв',
	'-77.0 38.8'=>'Вашингтон',
	'28.6 59.3'=>'Кингисепп',
	//'47.4 56.0'=>'Чебоксары',
	//'0.0 51.4'=>'Лондон',
	'28.8 45.3'=>'Измаил',
	'90.4 56.2'=>'Ачинск',
	'30.5 56.3'=>'Великие Луки',
	'41.9 45.0'=>'Ставрополь',
	'37.2 55.4'=>'Троицк',
	'40.9 57.0'=>'Иваново',
	'-71.1 42.3'=>'Бостон',
	'38.4 48.9'=>'Лисичанск',
	'43.6 43.4'=>'Нальчик',
	'59.9 56.9'=>'Первоуральск',
	'-87.7 41.8'=>'Чикаго',
	'38.8 45.6'=>'Димитров',
	'60.1 55.0'=>'Миасс',
	'34.1 44.4'=>'Алупка',
	'35.3 46.8'=>'Мелитополь',
	'69.0 61.0'=>'Ханты-Мансийск',
	'16.3 48.1'=>'Вена',
	'29.6 46.8'=>'Тирасполь',
	'37.8 56.0'=>'Пушкино',
	'37.5 56.3'=>'Яхрома',
	'2.1 41.3'=>'Барселона',
	'45.4 50.0'=>'Камышин',
	'24.9 60.2'=>'Хельсинки',
	'37.9 55.8'=>'Балашиха',
	'42.1 47.5'=>'Волгодонск',
	'38.9 55.8'=>'Орехово-Зуево',
	'33.3 67.5'=>'Алатиты',
	'4.8 52.3'=>'Амстердам',
	'36.7 56.3'=>'Клин',
	'64.0 67.5'=>'Воркута',
	'46.1 51.4'=>'Саратов',
	'40.2 47.7'=>'Шахты',
	'54.2 56.0'=>'Нефтекамск',
	'72.6 61.1'=>'Нефтеюганск',
	'94.4 51.7'=>'Кызыл',
	'38.5 52.6'=>'Елец',
	'36.8 55.9'=>'Истра',
	'52.0 55.7'=>'Елабуга',
	'95.7 56.2'=>'Канск',
	'35.3 45.0'=>'Феодосия',
	'41.3 56.3'=>'Ковров',
	'48.4 53.1'=>'Сызрань',
	'38.7 48.4'=>'Алчевск',
	'43.3 54.9'=>'Саров',
	'33.3 45.1'=>'Евпатория',
	'36.7 46.7'=>'Бердянск',
	'83.1 54.7'=>'Бердск',
	'30.1 49.8'=>'Белая Церковь',
	'37.9 55.6'=>'Лыткарино',
	'42.0 55.5'=>'Муром',
	'28.3 47.0'=>'Молдавия',
	'37.4 55.1'=>'Чехов',
	'86.7 53.8'=>'Прокопьевск',
	'42.7 43.9'=>'Кисловодск',
	'29.1 53.1'=>'Бобруйск',
	//'37.8 55.7'=>'Москва',
	'44.2 46.3'=>'Элиста',
	//'30.9 59.8'=>'Санкт-Петербург',
	//'106.8 -6.2'=>'Джакарта',
	'24.6 56.8'=>'Огре',
	'-122.3 37.5'=>'Сан-Франциско',
	'38.0 55.9'=>'Фрязино',
	'23.5 49.3'=>'Дрогобыч',
	'55.9 53.3'=>'Салават',
	'93.6 56.3'=>'Железногорск',
	'36.4 45.3'=>'Керчь',
	'45.6 43.3'=>'Грозный',
	//'55.7 37.5'=>'Иран',
	'54.1 56.7'=>'Чайковский',
	'38.0 44.5'=>'Геленджик',
	'9.9 53.6'=>'Гамбург',
	'59.7 55.1'=>'Златоуст',
	'36.7 55.3'=>'Наро-Фоминск',
	//'60.7 56.8'=>'Екатеринбург',
	'39.6 48.0'=>'Свердловск',
	'38.2 48.2'=>'Енакиево',
	'37.9 55.4'=>'Домодедово',
	'38.6 48.5'=>'Брянка',
	'61.9 56.4'=>'Каменск-Уральский',
	'35.8 48.5'=>'Павлоград',
	//'49.3 58.4'=>'Россия',
	'26.0 53.1'=>'Барановичи',
	'32.8 67.9'=>'Мончегорск',
	'38.5 48.6'=>'Первомайск',
	'85.4 56.7'=>'Октябрьский',
	'116.3 39.8'=>'Пекин',
	'30.7 50.5'=>'Бровары',
	'46.6 61.2'=>'Котлас',
	'100.5 13.7'=>'Бангкок',
	'-98.9 19.3'=>'Мексика',
	'32.7 46.6'=>'Херсон',
	'26.0 52.1'=>'Пинск',
	'127.5 50.2'=>'Благовещенск',
	//'55.9 55.0'=>'Благовещенск',
	'8.6 50.1'=>'Франкфурт-на-Майне',
	'76.7 66.0'=>'Новый Уренгой',
	'43.8 55.3'=>'Арзамас',
	'30.6 46.2'=>'Ильичевск',
	//'30.2 50.5'=>'Киев',
	'52.6 58.1'=>'Глазгов',
	'41.0 44.9'=>'Армавир',
	'22.0 54.4'=>'Озерск',
	'113.9 62.5'=>'Мирный',
	'33.5 59.6'=>'Тихвин',
	'137.0 50.5'=>'Комсомольск-на-Амуре',
	'28.6 55.5'=>'Новополоцк',
	'30.4 54.5'=>'Орша',
	'158.6 53.0'=>'Петропавловск-Камчатский',
	'30.6 60.0'=>'Всеволожск',
	'102.8 58.0'=>'Усть-Илимск',
	'85.9 51.9'=>'Горно-Алтайск',
	'88.2 69.3'=>'Норильск',
	//'11.9 50.8'=>'Германия',
	'44.1 56.1'=>'Кстово',
	//'55.7 37.6'=>'Иран',
	'60.7 56.0'=>'Снежинск',
	'26.5 55.8'=>'Даугавлипс',
	'68.2 58.1'=>'Тобольск',
	'-0.2 43.1'=>'Коараз',
	'56.7 59.4'=>'Усолье',
	'57.1 50.2'=>'Актобе',
	'55.8 37.5'=>'Минудешт',
	'-2.2 53.4'=>'Манчестер',
	'28.0 59.4'=>'Нарва',
	'35.6 58.4'=>'Вятка',
	'40.8 64.4'=>'Новодвинск',
	'75.4 63.1'=>'Ноябрьск',
	//'27.7 53.9'=>'Королёв',
	'38.0 54.8'=>'Ступино',
	'33.9 58.3'=>'Боровичи',
	'37.5 51.2'=>'Губкин',
	'34.2 62.1'=>'Кандопога',
	'12.9 37.6'=>'Менфи',
	'30.5 64.5'=>'Костомукша',
	'40.4 52.8'=>'Мичуринск',
	'52.8 54.5'=>'Бугульма',
	//'37.5 55.9'=>'Химки',
	'58.3 51.2'=>'Новотроицк',
	//'8.6 54.3'=>'Санкт-Петербург',
	'53.9 57.0'=>'Воткинск',
	'43.1 44.1'=>'Минеральные Воды',
	'14.4 50.0'=>'Прага',
	'34.0 44.9'=>'Симферополь',
	'38.1 56.2'=>'Сергиев-Посад',
	'80.2 50.4'=>'Семипалатинск',
	'24.0 42.2'=>'Белово',
	//'21.5 52.1'=>'Минск',
	'81.2 51.5'=>'Рубцовск',
	'37.5 55.3'=>'Климовск',
	'32.0 59.4'=>'Кириши',
	'-6.2 53.3'=>'Дублин',
	'31.1 48.5'=>'Украина',
	'36.2 50.0'=>'Харьков',
	'37.7 55.5'=>'Россия'
);

$wobot['destn3'] = array(
'Москва'=>'Россия',
'Санкт-петербург'=>'Россия',
'Екатеринбург'=>'Россия',
//'Россия'=>'Россия',
'Одесса'=>'Украина',
'Калуга'=>'Россия',
'Минск'=>'Россия',
'Севастопль'=>'Россия',
'Новосибирск'=>'Россия',
'Астрахань'=>'Россия',
'Краснодар'=>'Россия',
'Киев'=>'Украина',
'Харьков'=>'Украина',
'Самара'=>'Россия',
'Нижний Новгород'=>'Россия',
'Пермь'=>'Россия',
'Ростов-на-Дону'=>'Россия',
'Челябинск'=>'Россия',
'Казань'=>'Россия',
'Краснодар'=>'Россия',
'Воронеж'=>'Россия',
'Уфа'=>'Россия',
'Омск'=>'Россия',
'Волгоград'=>'Россия',
'Саратов'=>'Россия',
'Иркутск'=>'Россия',
'Красноярск'=>'Россия',
'Томск'=>'Россия',
'Владивосток'=>'Россия',
'Ульяновск'=>'Россия',
'Тула'=>'Россия',
'Рига'=>'Латвия',
'Тверь'=>'Россия',
'Тюмень'=>'Россия',
'Барнаул'=>'Россия',
'Астрахань'=>'Россия',
'Днепропетровск'=>'Украина',
'Ижевск'=>'Россия',
'Хабаровск'=>'Россия',
'Калининград'=>'Россия',
'Ярославль'=>'Россия',
'Алматы'=>'Казахстан', 
'Киров'=>'Россия',
'Оренбург'=>'Россия',
'Пенза'=>'Россия',
'Иваново'=>'Россия',
'Чебоксары'=>'Россия',
'Донецк'=>'Украина',
'Львов'=>'Украина',
'Мурманск'=>'Россия',
'Лондон'=>'Англия',
'Севастополь'=>'Украина',
'Кемерово'=>'Россия',
'Липецк'=>'Россия',
'США'=>'США',
'Беларусь'=>'Беларусь',
'Смоленск'=>'Россия',
'Йошкар-Ола'=>'Россия',
'Ставрополь'=>'Россия',
'Владимир'=>'Россия',
'Рязань'=>'Россия',
'Сочи'=>'Россия',
'Таллин'=>'Эстония',
'Нью-Йорк'=>'США',
'Тольятти'=>'Россия',
'Кишинев'=>'Молдавия',
'Архангельск'=>'Россия',
'Иран'=>'Иран',
'Брянск'=>'Россия',
'Зеленоград'=>'Россия',
'Белгород'=>'Россия',
'Вологда'=>'Россия',
'Тамбов'=>'Россия',
'Тель-Авив'=>'Израиль',
'Орел'=>'Россия',
'Курск'=>'Россия',
'Сыктывкар'=>'Россия',
'Прага'=>'Чехия',
'Симферополь'=>'Украина',
'Иерусалим'=>'Израиль',
'Баку'=>'Азербайджан',
'Париж'=>'Франция',
'Запорожье'=>'Украина',
'Набережные Челны'=>'Россия',
'Торонто'=>'Канада',
'Махачкала'=>'Россия',
'Тбилиси'=>'Грузия',
'Химки'=>'Россия',
'Псков'=>'Россия',
'Казахстан'=>'Казахстан',
'Кувейт'=>'Кувейт',
'Мексика'=>'Мексика',
'Новокузнецк'=>'Россия',
'Бишкек'=>'Киргизия',
'Ошава'=>'Канада',
'Ташкент'=>'Узбекистан',
'Луганск'=>'Украина',
'Болгария'=>'Болгария',
'Подольск'=>'Россия',
'Одинцово'=>'Россия',
'Берлин'=>'Германия',
'Саранск'=>'Россия',
'Мытищи'=>'Россия',
'Джакарта'=>'Индонезия',
'Кострома'=>'Россия',
'Николаев'=>'Украина',
'Израиль'=>'Израиль',
'Великий Новгород'=>'Россия',
'Королев'=>'Россия',
'Тимашевск'=>'Россия',
'Люберцы'=>'Россия',
'Индонезия'=>'Индонезия',
'Астана'=>'Казахстан',
'Магнитогорск'=>'Россия',
'Будапешт'=>'Венгрия',
'Долгопрудный'=>'Россия',
'Магадан'=>'Россия',
'Сургут'=>'Россия',
'Череповец'=>'Россия',
'Жуковский'=>'Россия',
'Германия'=>'Германия',
'Литва'=>'Литва',
'Чита'=>'Россия',
'Молдавия'=>'Молдавия',
'Кременчуг'=>'Украина',
'Улан-Удэ'=>'Россия',
'Грондо'=>'Беларусь',
'Раменское'=>'Россия',
'Нижегородская область'=>'Россия',
'Абакан'=>'Россия',
'Якутск'=>'Россия',
'Гоа'=>'Индия',
'Токио'=>'Япония',
'Вена'=>'Австрия',
'Есентуки'=>'Россия',
'Дубна'=>'Россия',
'Серпухов'=>'Россия',
'Хабаровск'=>'Россия',
'Вашингтон'=>'США',
'Москва'=>'Россия',
'США'=>'США',
'Ровно'=>'Украина',
'Торонто'=>'Канада',
'Бишкек'=>'Киргизия',
'Ташкент'=>'Узбекистан',
'Балаково'=>'Россия',
'Москва'=>'Россия',
'Ужгород'=>'Украина',
'Альметьевск'=>'Россия',
'Ухта'=>'Россия',
'Выборг'=>'Россия',
'Караганда'=>'Казахстан',
'Орск'=>'Россия',
'Красногорск'=>'Россия',
'Болгария'=>'Болгария',
'Новомосковск'=>'Россия',
'Анапа'=>'Россия',
'Москва'=>'Россия',
'США'=>'США',
//'Россия'=>'Россия',
'Электросталь'=>'Россия',
'Днепродзержинск'=>'Украина',
'Луцк'=>'Украина',
'Южно-Сахалинск'=>'Россия',
'Коломна'=>'Россия',
'Ангарск'=>'Россия',
'Димитровград'=>'Болгария',
'Вильнюс'=>'Литва',
'Железнодорожный'=>'Россия',
'Сергиев Посад'=>'Россия',
'Обнинск'=>'Россия',
'Бийск'=>'Россия',
'Электросталь'=>'Россия',
'Горловка'=>'Украина',
'Королев'=>'Россия',
'Вашингтон'=>'США',
'Кингисепп'=>'Россия',
'Чебоксары'=>'Россия',
'Лондон'=>'Англия',
'Измаил'=>'Румыния',
'Ачинск'=>'Россия',
'Великие Луки'=>'Россия',
'Ставрополь'=>'Россия',
'Троицк'=>'Россия',
'Иваново'=>'Россия',
'Бостон'=>'США',
'Лисичанск'=>'Украина',
'Нальчик'=>'Россия',
'Первоуральск'=>'Россия',
'Чикаго'=>'США',
'Димитров'=>'Украина',
'Миасс'=>'Россия',
'Алупка'=>'Украина',
'Мелитополь'=>'Украина',
'Ханты-Мансийск'=>'Россия',
'Вена'=>'Австрия',
'Тирасполь'=>'Молдавич',
'Пушкино'=>'Россия',
'Яхрома'=>'Россия',
'Барселона'=>'Испани',
'Камышин'=>'Россия',
'Хельсинки'=>'Финляндия',
'Балашиха'=>'Россия',
'Волгодонск'=>'Россия',
'Орехово-Зуево'=>'Россия',
'Алатиты'=>'Россия',
'Амстердам'=>'Голандия',
'Клин'=>'Россия',
'Воркута'=>'Россия',
'Саратов'=>'Россия',
'Шахты'=>'Россия',
'Нефтекамск'=>'Россия',
'Нефтеюганск'=>'Россия',
'Кызыл'=>'Россия',
'Елец'=>'Россия',
'Истра'=>'Россия',
'Елабуга'=>'Россия',
'Канск'=>'Россия',
'Феодосия'=>'Украина',
'Ковров'=>'Россия',
'Сызрань'=>'Россия',
'Алчевск'=>'Украина',
'Саров'=>'Россия',
'Евпатория'=>'Украина',
'Бердянск'=>'Украина',
'Бердск'=>'Россия',
'Белая Церковь'=>'Украина',
'Лыткарино'=>'Россия',
'Муром'=>'Россия',
'Молдавия'=>'Молдавия',
'Чехов'=>'Россия',
'Прокопьевск'=>'Россия',
'Кисловодск'=>'Россия',
'Бобруйск'=>'Беларусь',
'Москва'=>'Россия',
'Элиста'=>'Россия',
'Санкт-Петербург'=>'Россия',
'Джакарта'=>'Индонезия',
'Огре'=>'Латвия',
'Сан-Франциско'=>'США',
'Фрязино'=>'Россия',
'Дрогобыч'=>'Украина',
'Салават'=>'Россия',
'Железногорск'=>'Россия',
'Керчь'=>'Украина',
'Грозный'=>'Россия',
'Иран'=>'Иран',
'Чайковский'=>'Россия',
'Геленджик'=>'Россия',
'Гамбург'=>'Германия',
'Златоуст'=>'Россия',
'Наро-Фоминск'=>'Россия',
'Екатеринбург'=>'Россия',
'Свердловск'=>'Россия',
'Енакиево'=>'Украина',
'Домодедово'=>'Россия',
'Брянка'=>'Украина',
'Каменск-Уральский'=>'Россия',
'Павлоград'=>'Украина',
//'Россия'=>'Россия',
'Барановичи'=>'Беларусь',
'Мончегорск'=>'Россия',
'Первомайск'=>'Украина',
'Октябрьский'=>'Россия',
'Пекин'=>'Китай',
'Бровары'=>'Украина',
'Котлас'=>'Россия',
'Бангкок'=>'Таиланд',
'Мексика'=>'Мексика',
'Херсон'=>'Украина',
'Пинск'=>'Беларусь',
'Благовещенск'=>'Россия',
'Благовещенск'=>'Россия',
'Франкфурт-на-Майне'=>'Германия',
'Новый Уренгой'=>'Россия',
'Арзамас'=>'Россия',
'Ильичевск'=>'Украина',
'Киев'=>'Украина',
'Глазгов'=>'Россия',
'Армавир'=>'Россия',
'Озерск'=>'Россия',
'Мирный'=>'Россия',
'Тихвин'=>'Россия',
'Комсомольск-на-Амуре'=>'Россия',
'Новополоцк'=>'Беларусь',
'Орша'=>'Беларусь',
'Петропавловск-Камчатский'=>'Россия',
'Всеволожск'=>'Россия',
'Усть-Илимск'=>'Россия',
'Горно-Алтайск'=>'Россия',
'Норильск'=>'Россия',
'Германия'=>'Германия',
'Кстово'=>'Россия',
'Иран'=>'Иран',
'Снежинск'=>'Россия',
'Даугавлипс'=>'Латвия',
'Тобольск'=>'Россия',
'Коараз'=>'Франция',
'Усолье'=>'Россия',
'Актобе'=>'Казахстан',
'Минудешт'=>'Иран',
'Манчестер'=>'Англия',
'Нарва'=>'Эстония',
'Вятка'=>'Россия',
'Новодвинск'=>'Россия',
'Ноябрьск'=>'Россия',
'Королёв'=>'Россия',
'Ступино'=>'Россия',
'Боровичи'=>'Россия',
'Губкин'=>'Россия',
'Кандопога'=>'Россия',
'Менфи'=>'Италия',
'Костомукша'=>'Россия',
'Мичуринск'=>'Россия',
'Бугульма'=>'Россия',
'Химки'=>'Россия',
'Новотроицк'=>'Россия',
'Санкт-Петербург'=>'Россия',
'Воткинск'=>'Россия',
'Минеральные Воды'=>'Россия',
'Прага'=>'Чехия',
'Симферополь'=>'Украина',
'Сергиев-Посад'=>'Россия',
'Семипалатинск'=>'Казахстан',
'Белово'=>'Россия',
'Минск'=>'Беларусь',
'Рубцовск'=>'Россия',
'Климовск'=>'Россия',
'Кириши'=>'Россия',
'Дублин'=>'Ирландия'
);


$wobot['destngeo'] = array(
'Москва'=>array('37','55'),
'Санкт-петербург'=>array('30','59'),
'Екатеринбург'=>array('60','56'),
'Одесса'=>array('30','46'),
'Калуга'=>array('36','54'),
'Минск'=>array('27','53'),
'Севастополь'=>array('33','44'),
'Астрахань'=>array('48','46'),
'Краснодар'=>array('38','45'),
'Киев'=>array('30','50'),
'Харьков'=>array('36','49'),
'Самара'=>array('50','53'),
'Ульяновск'=>array('48','54'),
'Пекин'=>array('116','39'),
'Кишинев'=>array('28','47'),
'Оренбург'=>array('55','51'),
'Волгоград'=>array('44','48'),
'Донецк'=>array('37','47'),
'Казань'=>array('49','55'),
'Рига'=>array('24','56')
);


$wobot['cities']=array(
'moscow'=>'moskva',
'kyev'=>'kiev',
'ёбург'=>'ekaterinburg',
'kharkov'=>'harkov',
'beijing'=>'pekin',
'москва'=>'moskva',
'санкт-петербург'=>'sankt-peterburg',
'saint petersburg'=>'sankt-peterburg',
'saint-p'=>'sankt-peterburg',
'st. petersburg'=>'sankt-peterburg',
'spb'=>'sankt-peterburg',
'екатеринбург'=>'ekaterinburg',
'одесса'=>'odessa',
'калуга'=>'kaluga',
'минск'=>'minsk',
'севастополь'=>'sevastopol',
'астрахань'=>'astrahan',
'краснодар'=>'krasnodar',
'киев'=>'kiev',
'харьков'=>'harkov',
'самара'=>'samara',
'берестовица'=>'berestovitsa',
'ульяновск'=>'ulyanovsk',
'пекин'=>'pekin',
'кишинев'=>'kishinev',
'оренбург'=>'orenburg',
'волгоград'=>'volgograd',
'казань'=>'kazan',
'питер'=>'sankt-peterburg',
'минская область'=>'minsk',
'russian'=>'moskva',
'russia'=>'moskva',
'belarus'=>'minsk',
'ukraine'=>'kiev',
'донецк'=>'donetsk',
'рига'=>'riga'
);


/*$wobot['destn'] = array(
'moskva'=>array('37.609218','55.753559'),
'sankt-peterburg'=>array('30.313497','59.938531'),
'ekaterinburg'=>array('60.617435','56.829748'),
'odessa'=>array('30.7058','46.466444'),
'kaluga'=>array('36.247686','54.535128'),
'minsk'=>array('27.696614','53.881961'),
'sevastopol'=>array('33.558616','44.585098'),
'astrahan'=>array('48.067419','46.316913'),
'krasnodar'=>array('38.963672','45.0141'),
'kiev'=>array('30.532685','50.40241'),
'harkov'=>array('36.280574','49.98776'),
'samara'=>array('50.19908','53.244418'),
'berestovitsa'=>array('24.380753','53.844627'),
'ulyanovsk'=>array('48.472015','54.316581'),
'pekin'=>array('116.323017','39.876918'),
'kishinev'=>array('28.838526','47.012925'),
'orenburg'=>array('55.09735','51.768099'),
'volgograd'=>array('44.51420799999999','48.708898'),
'donetsk'=>array('37.763791','47.992324'),
'kazan'=>array('49.122853','55.786764'),
'riga'=>array('24.099454','56.958257')
);

$wobot1['destn2'] = array(
'Москва'=>'37.609218 55.753559',
'Санкт-петербург'=>'30.314772 59.938189',
'Екатеринбург'=>'60.597340 56.837982',
'Одесса'=>'30.739846 46.469517',
'Россия'=>'103.682149 65.084965',
'Калуга'=>'36.247686 54.535128',
'Минск'=>'27.561741 53.903499',
'Севастополь'=>'33.558616 44.585098',
'Новосибирск'=>'82.919388 55.029838',
'Астрахань'=>'48.067419 46.316913',
'Краснодар'=>'38.963672 45.0141',
'Киев'=>'30.522301 50.451118',
'Харьков'=>'36.280574 49.98776',
'Самара'=>'50.199080 53.244418',
'Нижний Новгород'=>'44.001890 56.324461',
'Пермь'=>'56.241077 58.008490',
'Ростов-на-Дону'=>'39.744918 47.227163',
'Челябинск'=>'61.400820 55.160324',
'Казань'=>'49.122853 55.786764',
'Краснодар'=>'38.976032 45.034942',
'Воронеж'=>'39.204078 51.662507',
'Уфа'=>'55.983161 54.738437',
'Омск'=>'73.365364 54.990302',
'Волгоград'=>'44.515942 48.707793',
'Саратов'=>'46.004459 51.537775',
'Иркутск'=>'104.275630 52.313021',
'Красноярск'=>'92.870412 56.008711',
'Томск'=>'84.962543 56.463988',
'Владивосток'=>'131.928478 43.134091',
'Ульяновск'=>'48.472015 54.316581',
);

$wobot1['destn1'] = array(
'37.609218 55.753559'=>'Москва',
'30.314772 59.938189'=>'Санкт-петербург',
'60.597340 56.837982'=>'Екатеринбург',
'30.739846 46.469517'=>'Одесса',
'103.682149 65.084965'=>'Россия',
'36.247686 54.535128'=>'Калуга',
'27.561741 53.903499'=>'Минск',
'82.919388 55.029838'=>'Новосибирск',
'33.558616 44.585098'=>'Севастополь',
'48.067419 46.316913'=>'Астрахань',
'38.963672 45.0141'=>'Краснодар',
'30.522301 50.451118'=>'Киев',
'36.280574 49.98776'=>'Харьков',
'50.199080 53.244418'=>'Самара',
'44.001890 56.324461'=>'Нижний Новгород',
'56.241077 58.008490'=>'Пермь',
'39.744918 47.227163'=>'Ростов-на-Дону',
'61.400820 55.160324'=>'Челябинск',
'49.122853 55.786764'=>'Казань',
'38.976032 45.034942'=>'Краснодар',
'39.204078 51.662507'=>'Воронеж',
'55.983161 54.738437'=>'Уфа',
'73.365364 54.990302'=>'Омск',
'44.515942 48.707793'=>'Волгоград',
'46.004459 51.537775'=>'Саратов',
'104.275630 52.313021'=>'Иркутск',
'92.870412 56.008711'=>'Красноярск',
'84.962543 56.463988'=>'Томск',
'131.928478 43.134091'=>'Владивосток',
'48.472015 54.316581'=>'Ульяновск'
);

$wobot22['destn2'] = array(
'Москва'=>'37.6 55.7',
'Санкт-петербург'=>'30.3 59.9',
'Екатеринбург'=>'60.5 56.8',
'Россия'=>'103.6 65.0',
'Одесса'=>'30.7 46.4',
'Калуга'=>'36.2 54.5',
'Минск'=>'27.5 53.9',
'Севастопль'=>'33.5 44.5',
'Новосибирск'=>'82.9 55.0',
'Астрахань'=>'48.0 46.3',
'Краснодар'=>'38.9 45.0',
'Киев'=>'30.5 50.4',
'Харьков'=>'36.2 49.9',
'Самара'=>'50.1 53.2',
'Нижний Новгород'=>'44.0 56.3',
'Пермь'=>'56.2 58.0',
'Ростов-на-Дону'=>'39.7 47.2',
'Челябинск'=>'61.4 55.1',
'Казань'=>'49.1 55.7',
'Краснодар'=>'38.9 45.0',
'Воронеж'=>'39.2 51.6',
'Уфа'=>'55.9 54.7',
'Омск'=>'73.3 54.9',
'Волгоград'=>'44.5 48.7',
'Саратов'=>'46.0 51.5',
'Иркутск'=>'104.2 52.3',
'Красноярск'=>'92.8 56.0',
'Томск'=>'84.9 56.4',
'Владивосток'=>'131.9 43.1',
'Ульяновск'=>'48.4 54.3',
'Тула'=>'37.6 54.1',
'Рига'=>'24.0 56.9',
'Тверь'=>'35.8 56.8',
'Тюмень'=>'65.5 57.1',
'Барнаул'=>'83.7 53.3',
'Астрахань'=>'48.0 46.3',
'Днепропетровск'=>'35.0 48.4',
'Ижевск'=>'53.1 56.8',
'Хабаровск'=>'135.0 48.4',
'Калининград'=>'20.5 54.7',
'Ярославль'=>'39.8 57.6',
'Алматы'=>'76.9 43.2', 
'Киров'=>'49.6 58.6',
'Оренбург'=>'55.0 51.7',
'Пенза'=>'44.9 53.1',
'Иваново'=>'40.9 57.0',
'Чебоксары'=>'47.2 56.1',
'Донецк'=>'37.8 48.0',
'Львов'=>'24.0 49.8',
'Мурманск'=>'33.0 68.9',
'Лондон'=>'-0.0 51.4',
'Севастополь'=>'33.5 44.6',
'Кемерово'=>'86.0 55.3',
'Липецк'=>'39.5 52.6',
'США'=>'-95.8 38.0',
'Беларусь'=>'27.9 53.7',
'Смоленск'=>'31.9 54.7',
'Йошкар-Ола'=>'47.8 56.6',
'Ставрополь'=>'41.9 45.0',
'Владимир'=>'40.4 56.1',
'Рязань'=>'39.7 54.6',
'Сочи'=>'39.7 43.5',
'Таллин'=>'24.7 59.4',
'Нью-Йорк'=>'-74.0 40.8',
'Тольятти'=>'49.4 53.5',
'Кишинев'=>'28.8 47.0',
'Архангельск'=>'40.5 64.5',
'Иран'=>'53.7 32.7',
'Брянск'=>'34.3 53.2',
'Зеленоград'=>'37.1 55.9',
'Белгород'=>'36.5 50.6',
'Вологда'=>'39.8 59.2',
'Тамбов'=>'41.4 52.7',
'Тель-Авив'=>'34.8 32.1',
'Орел'=>'36.0 52.9',
'Курск'=>'36.1 51.7',
'Сыктывкар'=>'50.8 61.6',
'Прага'=>'14.4 50.0',
'Симферополь'=>'34.0 44.9',
'Иерусалим'=>'35.2 31.7',
'Баку'=>'49.9 40.4',
'Париж'=>'2.3 48.8',
'Запорожье'=>'35.1 47.8',
'Набережные Челны'=>'52.4 55.7',
'Торонто'=>'-79.4 43.6',
'Махачкала'=>'47.4 42.9',
'Баку'=>'49.9 40.4',
'Тбилиси'=>'44.8 41.6',
'Химки'=>'37.3 55.9',
'Псков'=>'28.3 57.8',
'Казахстан'=>'66.9 48.5',
'Кувейт'=>'47.4 29.2',
'Мексика'=>'-98.9 19.3',
'Новокузнецк'=>'87.1 53.7',
'Бишкек'=>'74.5 42.8',
'Ошава'=>'-78.6 43.6',
'Ташкент'=>'69.2 41.2',
'Луганск'=>'39.3 48.5',
'Болгария'=>'26.7 43.0',
'Подольск'=>'37.5 55.4',
'Одинцово'=>'37.2 55.6',
'Берлин'=>'13.4 52.4',
'Саранск'=>'45.1 54.1',
'Мытищи'=>'37.7 55.9',
'Джакарта'=>'106.8 -5.8',
'Кострома'=>'40.9 57.7',
'Николаев'=>'31.9 46.9',
'Израиль'=>'35.0 32.7',
'Великий Новгород'=>'31.2 58.5',
'Израиль'=>'35.0 31.3',
'Королев'=>'37.8 55.9',
'Тимашевск'=>'38.8 45.6',
'Люберцы'=>'37.9 55.7',
'Индонезия'=>'113.9 0.0',
'Астана'=>'71.4 51.1',
'Магнитогорск'=>'58.9 53.4',
'Будапешт'=>'19.0 47.4',
'Долгопрудный'=>'37.4 55.9',
'Магадан'=>'150.8 59.5',
'Сургут'=>'73.4 61.2',
'Череповец'=>'37.9 59.1',
'Жуковский'=>'38.1 55.5',
'Германия'=>'10.4 51.2',
'Литва'=>'25.2 54.6',
'Чита'=>'113.4 52.0',
'Молдавия'=>'28.3 47.0',
'Кременчуг'=>'33.4 49.0',
'Улан-Удэ'=>'107.6 51.8',
'Грондо'=>'23.8 53.6',
'Раменское'=>'38.2 55.5',
'Нижегородская область'=>'44.7 56.3',
'Абакан'=>'91.4 53.7',
'Якутск'=>'129.7 62.0',
'Гоа'=>'24.6 -27.4',
'Токио'=>'139.7 35.6',
'Вена'=>'16.3 48.1',
'Есентуки'=>'43.0 44.0',
'Дубна'=>'37.1 56.7',
'Серпухов'=>'37.4 54.9',
'Хабаровск'=>'135.0 48.4',
'Вашингтон'=>'-77.0 38.8',
);


$wobot['destn1'] = array(
	'Москва'=>'37.6 55.7',
	'Санкт-петербург'=>'30.3 59.9',
	'Екатеринбург'=>'60.5 56.8',
	'Россия'=>'103.6 65.0',
	'Одесса'=>'30.7 46.4',
	'Калуга'=>'36.2 54.5',
	'Минск'=>'27.5 53.9',
	'Севастопль'=>'33.5 44.5',
	'Новосибирск'=>'82.9 55.0',
	'Астрахань'=>'48.0 46.3',
	'Краснодар'=>'38.9 45.0',
	'Киев'=>'30.5 50.4',
	'Харьков'=>'36.2 49.9',
	'Самара'=>'50.1 53.2',
	'Нижний Новгород'=>'44.0 56.3',
	'Пермь'=>'56.2 58.0',
	'Ростов-на-Дону'=>'39.7 47.2',
	'Челябинск'=>'61.4 55.1',
	'Казань'=>'49.1 55.7',
	'Краснодар'=>'38.9 45.0',
	'Воронеж'=>'39.2 51.6',
	'Уфа'=>'55.9 54.7',
	'Омск'=>'73.3 54.9',
	'Волгоград'=>'44.5 48.7',
	'Саратов'=>'46.0 51.5',
	'Иркутск'=>'104.2 52.3',
	'Красноярск'=>'92.8 56.0',
	'Томск'=>'84.9 56.4',
	'Владивосток'=>'131.9 43.1',
	'Ульяновск'=>'48.4 54.3',
	'Тула'=>'37.6 54.1',
	'Рига'=>'24.0 56.9',
	'Тверь'=>'35.8 56.8',
	'Тюмень'=>'65.5 57.1',
	'Барнаул'=>'83.7 53.3',
	'Астрахань'=>'48.0 46.3',
	'Днепропетровск'=>'35.0 48.4',
	'Ижевск'=>'53.1 56.8',
	'Хабаровск'=>'135.0 48.4',
	'Калининград'=>'20.5 54.7',
	'Ярославль'=>'39.8 57.6',
	'Алматы'=>'76.9 43.2', 
	'Киров'=>'49.6 58.6',
	'Оренбург'=>'55.0 51.7',
	'Пенза'=>'44.9 53.1',
	'Иваново'=>'40.9 57.0',
	'Чебоксары'=>'47.2 56.1',
	'Донецк'=>'37.8 48.0',
	'Львов'=>'24.0 49.8',
	'Мурманск'=>'33.0 68.9',
	'Лондон'=>'-0.0 51.4',
	'Севастополь'=>'33.5 44.6',
	'Кемерово'=>'86.0 55.3',
	'Липецк'=>'39.5 52.6',
	'США'=>'-95.8 38.0',
	'Беларусь'=>'27.9 53.7',
	'Смоленск'=>'31.9 54.7',
	'Йошкар-Ола'=>'47.8 56.6',
	'Ставрополь'=>'41.9 45.0',
	'Владимир'=>'40.4 56.1',
	'Рязань'=>'39.7 54.6',
	'Сочи'=>'39.7 43.5',
	'Таллин'=>'24.7 59.4',
	'Нью-Йорк'=>'-74.0 40.8',
	'Тольятти'=>'49.4 53.5',
	'Кишинев'=>'28.8 47.0',
	'Архангельск'=>'40.5 64.5',
	'Иран'=>'53.7 32.7',
	'Брянск'=>'34.3 53.2',
	'Зеленоград'=>'37.1 55.9',
	'Белгород'=>'36.5 50.6',
	'Вологда'=>'39.8 59.2',
	'Тамбов'=>'41.4 52.7',
	'Тель-Авив'=>'34.8 32.1',
	'Орел'=>'36.0 52.9',
	'Курск'=>'36.1 51.7',
	'Сыктывкар'=>'50.8 61.6',
	'Прага'=>'14.4 50.0',
	'Симферополь'=>'34.0 44.9',
	'Иерусалим'=>'35.2 31.7',
	'Баку'=>'49.9 40.4',
	'Париж'=>'2.3 48.8',
	'Запорожье'=>'35.1 47.8',
	'Набережные Челны'=>'52.4 55.7',
	'Торонто'=>'-79.4 43.6',
	'Махачкала'=>'47.4 42.9',
	'Баку'=>'49.9 40.4',
	'Тбилиси'=>'44.8 41.6',
	'Химки'=>'37.3 55.9',
	'Псков'=>'28.3 57.8',
	'Казахстан'=>'66.9 48.5',
	'Кувейт'=>'47.4 29.2',
	'Мексика'=>'-98.9 19.3',
	'Новокузнецк'=>'87.1 53.7',
	'Бишкек'=>'74.5 42.8',
	'Ошава'=>'-78.6 43.6',
	'Ташкент'=>'69.2 41.2',
	'Луганск'=>'39.3 48.5',
	'Болгария'=>'26.7 43.0',
	'Подольск'=>'37.5 55.4',
	'Одинцово'=>'37.2 55.6',
	'Берлин'=>'13.4 52.4',
	'Саранск'=>'45.1 54.1',
	'Мытищи'=>'37.7 55.9',
	'Джакарта'=>'106.8 -5.8',
	'Кострома'=>'40.9 57.7',
	'Николаев'=>'31.9 46.9',
	'Израиль'=>'35.0 32.7',
	'Великий Новгород'=>'31.2 58.5',
	//'Израиль'=>'35.0 31.3',
	'Королев'=>'37.8 55.9',
	'Тимашевск'=>'38.8 45.6',
	'Люберцы'=>'37.9 55.7',
	'Индонезия'=>'113.9 0.0',
	'Астана'=>'71.4 51.1',
	'Магнитогорск'=>'58.9 53.4',
	'Будапешт'=>'19.0 47.4',
	'Долгопрудный'=>'37.4 55.9',
	'Магадан'=>'150.8 59.5',
	'Сургут'=>'73.4 61.2',
	'Череповец'=>'37.9 59.1',
	'Жуковский'=>'38.1 55.5',
	'Германия'=>'10.4 51.2',
	'Литва'=>'25.2 54.6',
	'Чита'=>'113.4 52.0',
	'Молдавия'=>'28.3 47.0',
	'Кременчуг'=>'33.4 49.0',
	'Улан-Удэ'=>'107.6 51.8',
	'Грондо'=>'23.8 53.6',
	'Раменское'=>'38.2 55.5',
	'Нижегородская область'=>'44.7 56.3',
	'Абакан'=>'91.4 53.7',
	'Якутск'=>'129.7 62.0',
	'Гоа'=>'24.6 -27.4',
	'Токио'=>'139.7 35.6',
	'Вена'=>'16.3 48.1',
	'Есентуки'=>'43.0 44.0',
	'Дубна'=>'37.1 56.7',
	'Серпухов'=>'37.4 54.9',
	'Хабаровск'=>'135.0 48.4',
	'Вашингтон'=>'-77.0 38.8',
	//'Москва'=>'38.8 58.0',
	'США'=>'-95.8 38.0',
	'ровно'=>'26.2 50.6',
	'Торонто'=>'-79.4 43.6',
	'Бишкек'=>'74.5 42.8',
	'Ташкент'=>'69.2 41.2',
	'Балаково'=>'47.8 51.9',
	//'Москва'=>'37.4 55.8',
	'Ужгород'=>'22.2 48.6',
	'Альметьевск'=>'52.3 54.8',
	'Ухта'=>'53.7 63.5',
	'Выборг'=>'28.7 60.7',
	'Караганда'=>'73.1 49.8',
	'Орск'=>'58.5 51.2',
	'Красногорск'=>'37.3 55.8',
	'Болгария'=>'26.7 43.0',
	'Новомосковск'=>'35.2 48.6',
	'Анапа'=>'37.3 44.8',
	//'Москва'=>'37.5 48.7',
	//'США'=>'-94.2 38.0',
	//'Россия'=>'30.1 59.5',
	'Электросталь'=>'38.4 55.7',
	'Днепродзержинск'=>'34.5 48.5',
	'Луцк'=>'25.3 50.7',
	'Южно-Сахалинск'=>'142.7 46.9',
	'Коломна'=>'38.7 55.0',
	'Ангарск'=>'103.9 52.5',
	'Димитровград'=>'25.6 42.0',
	'Вильнюс'=>'25.2 54.6',
	'Железнодорожный'=>'38.0 55.7',
	'Сергиев Посад'=>'38.1 56.3',
	'Обнинск'=>'36.6 55.1',
	'Бийск'=>'85.2 52.5',
	//'Электросталь'=>'38.4 55.8',
	'Горловка'=>'38.1 48.3',
	//'Королёв'=>'37.9 55.9',
	'Вашингтон'=>'-77.0 38.8',
	'Кингисепп'=>'28.6 59.3',
	//'Чебоксары'=>'47.4 56.0',
	//'Лондон'=>'0.0 51.4',
	'Измаил'=>'28.8 45.3',
	'Ачинск'=>'90.4 56.2',
	'Великие Луки'=>'30.5 56.3',
	'Ставрополь'=>'41.9 45.0',
	'Троицк'=>'37.2 55.4',
	'Иваново'=>'40.9 57.0',
	'Бостон'=>'-71.1 42.3',
	'Лисичанск'=>'38.4 48.9',
	'Нальчик'=>'43.6 43.4',
	'Первоуральск'=>'59.9 56.9',
	'Чикаго'=>'-87.7 41.8',
	'Димитров'=>'38.8 45.6',
	'Миасс'=>'60.1 55.0',
	'Алупка'=>'34.1 44.4',
	'Мелитополь'=>'35.3 46.8',
	'Ханты-Мансийск'=>'69.0 61.0',
	'Вена'=>'16.3 48.1',
	'Тирасполь'=>'29.6 46.8',
	'Пушкино'=>'37.8 56.0',
	'Яхрома'=>'37.5 56.3',
	'Барселона'=>'2.1 41.3',
	'Камышин'=>'45.4 50.0',
	'Хельсинки'=>'24.9 60.2',
	'Балашиха'=>'37.9 55.8',
	'Волгодонск'=>'42.1 47.5',
	'Орехово-Зуево'=>'38.9 55.8',
	'Алатиты'=>'33.3 67.5',
	'Амстердам'=>'4.8 52.3',
	'Клин'=>'36.7 56.3',
	'Воркута'=>'64.0 67.5',
	'Саратов'=>'46.1 51.4',
	'Шахты'=>'40.2 47.7',
	'Нефтекамск'=>'54.2 56.0',
	'Нефтеюганск'=>'72.6 61.1',
	'Кызыл'=>'94.4 51.7',
	'Елец'=>'38.5 52.6',
	'Истра'=>'36.8 55.9',
	'Елабуга'=>'52.0 55.7',
	'Канск'=>'95.7 56.2',
	'Феодосия'=>'35.3 45.0',
	'Ковров'=>'41.3 56.3',
	'Сызрань'=>'48.4 53.1',
	'Алчевск'=>'38.7 48.4',
	'Саров'=>'43.3 54.9',
	'Евпатория'=>'33.3 45.1',
	'Бердянск'=>'36.7 46.7',
	'Бердск'=>'83.1 54.7',
	'Белая Церковь'=>'30.1 49.8',
	'Лыткарино'=>'37.9 55.6',
	'Муром'=>'42.0 55.5',
	'Молдавия'=>'28.3 47.0',
	'Чехов'=>'37.4 55.1',
	'Прокопьевск'=>'86.7 53.8',
	'Кисловодск'=>'42.7 43.9',
	'Бобруйск'=>'29.1 53.1',
	//'Москва'=>'37.8 55.7',
	'Элиста'=>'44.2 46.3',
	//'Санкт-Петербург'=>'30.9 59.8',
	//'Джакарта'=>'106.8 -6.2',
	'Огре'=>'24.6 56.8',
	'Сан-Франциско'=>'-122.3 37.5',
	'Фрязино'=>'38.0 55.9',
	'Дрогобыч'=>'23.5 49.3',
	'Салават'=>'55.9 53.3',
	'Железногорск'=>'93.6 56.3',
	'Керчь'=>'36.4 45.3',
	'Грозный'=>'45.6 43.3',
	//'Иран'=>'55.7 37.5',
	'Чайковский'=>'54.1 56.7',
	'Геленджик'=>'38.0 44.5',
	'Гамбург'=>'9.9 53.6',
	'Златоуст'=>'59.7 55.1',
	'Наро-Фоминск'=>'36.7 55.3',
	//'Екатеринбург'=>'60.7 56.8',
	'Свердловск'=>'39.6 48.0',
	'Енакиево'=>'38.2 48.2',
	'Домодедово'=>'37.9 55.4',
	'Брянка'=>'38.6 48.5',
	'Каменск-Уральский'=>'61.9 56.4',
	'Павлоград'=>'35.8 48.5',
	//'Россия'=>'49.3 58.4',
	'Барановичи'=>'26.0 53.1',
	'Мончегорск'=>'32.8 67.9',
	'Первомайск'=>'38.5 48.6',
	'Октябрьский'=>'85.4 56.7',
	'Пекин'=>'116.3 39.8',
	'Бровары'=>'30.7 50.5',
	'Котлас'=>'46.6 61.2',
	'Бангкок'=>'100.5 13.7',
	'Мексика'=>'-98.9 19.3',
	'Херсон'=>'32.7 46.6',
	'Пинск'=>'26.0 52.1',
	'Благовещенск'=>'127.5 50.2',
	//'Благовещенск'=>'55.9 55.0',
	'Франкфурт-на-Майне'=>'8.6 50.1',
	'Новый Уренгой'=>'76.7 66.0',
	'Арзамас'=>'43.8 55.3',
	'Ильичевск'=>'30.6 46.2',
	//'Киев'=>'30.2 50.5',
	'Глазгов'=>'52.6 58.1',
	'Армавир'=>'41.0 44.9',
	'Озерск'=>'22.0 54.4',
	'Мирный'=>'113.9 62.5',
	'Тихвин'=>'33.5 59.6',
	'Комсомольск-на-Амуре'=>'137.0 50.5',
	'Новополоцк'=>'28.6 55.5',
	'Орша'=>'30.4 54.5',
	'Петропавловск-Камчатский'=>'158.6 53.0',
	'Всеволожск'=>'30.6 60.0',
	'Усть-Илимск'=>'102.8 58.0',
	'Горно-Алтайск'=>'85.9 51.9',
	'Норильск'=>'88.2 69.3',
	//'Германия'=>'11.9 50.8',
	'Кстово'=>'44.1 56.1',
	//'Иран'=>'55.7 37.6',
	'Снежинск'=>'60.7 56.0',
	'Даугавлипс'=>'26.5 55.8',
	'Тобольск'=>'68.2 58.1',
	'Коараз'=>'-0.2 43.1',
	'Усолье'=>'56.7 59.4',
	'Актобе'=>'57.1 50.2',
	'Минудешт'=>'55.8 37.5',
	'Манчестер'=>'-2.2 53.4',
	'Нарва'=>'28.0 59.4',
	'Вятка'=>'35.6 58.4',
	'Новодвинск'=>'40.8 64.4',
	'Ноябрьск'=>'75.4 63.1',
	//'Королёв'=>'27.7 53.9',
	'Ступино'=>'38.0 54.8',
	'Боровичи'=>'33.9 58.3',
	'Губкин'=>'37.5 51.2',
	'Кандопога'=>'34.2 62.1',
	'Менфи'=>'12.9 37.6',
	'Костомукша'=>'30.5 64.5',
	'Мичуринск'=>'40.4 52.8',
	'Бугульма'=>'52.8 54.5',
	//'Химки'=>'37.5 55.9',
	'Новотроицк'=>'58.3 51.2',
	//'Санкт-Петербург'=>'8.6 54.3',
	'Воткинск'=>'53.9 57.0',
	'Минеральные Воды'=>'43.1 44.1',
	'Прага'=>'14.4 50.0',
	'Симферополь'=>'34.0 44.9',
	'Сергиев-Посад'=>'38.1 56.2',
	'Семипалатинск'=>'80.2 50.4',
	'Белово'=>'24.0 42.2',
	//'Минск'=>'21.5 52.1',
	'Рубцовск'=>'81.2 51.5',
	'Климовск'=>'37.5 55.3',
	'Кириши'=>'32.0 59.4',
	'Дублин'=>'-6.2 53.3',
);

$wobot['destn2'] = array(
	'37.6 55.7'=>'Москва',
	'30.3 59.9'=>'Санкт-петербург',
	'60.5 56.8'=>'Екатеринбург',
	'103.6 65.0'=>'Россия',
	'30.7 46.4'=>'Одесса',
	'36.2 54.5'=>'Калуга',
	'27.5 53.9'=>'Минск',
	'33.5 44.5'=>'Севастопль',
	'82.9 55.0'=>'Новосибирск',
	'48.0 46.3'=>'Астрахань',
	'38.9 45.0'=>'Краснодар',
	'30.5 50.4'=>'Киев',
	'36.2 49.9'=>'Харьков',
	'50.1 53.2'=>'Самара',
	'44.0 56.3'=>'Нижний Новгород',
	'56.2 58.0'=>'Пермь',
	'39.7 47.2'=>'Ростов-на-Дону',
	'61.4 55.1'=>'Челябинск',
	'49.1 55.7'=>'Казань',
	'38.9 45.0'=>'Краснодар',
	'39.2 51.6'=>'Воронеж',
	'55.9 54.7'=>'Уфа',
	'73.3 54.9'=>'Омск',
	'44.5 48.7'=>'Волгоград',
	'46.0 51.5'=>'Саратов',
	'104.2 52.3'=>'Иркутск',
	'92.8 56.0'=>'Красноярск',
	'84.9 56.4'=>'Томск',
	'131.9 43.1'=>'Владивосток',
	'48.4 54.3'=>'Ульяновск',
	'37.6 54.1'=>'Тула',
	'24.0 56.9'=>'Рига',
	'35.8 56.8'=>'Тверь',
	'65.5 57.1'=>'Тюмень',
	'83.7 53.3'=>'Барнаул',
	'48.0 46.3'=>'Астрахань',
	'35.0 48.4'=>'Днепропетровск',
	'53.1 56.8'=>'Ижевск',
	'135.0 48.4'=>'Хабаровск',
	'20.5 54.7'=>'Калининград',
	'39.8 57.6'=>'Ярославль',
	'76.9 43.2'=>'Алматы', 
	'49.6 58.6'=>'Киров',
	'55.0 51.7'=>'Оренбург',
	'44.9 53.1'=>'Пенза',
	'40.9 57.0'=>'Иваново',
	'47.2 56.1'=>'Чебоксары',
	'37.8 48.0'=>'Донецк',
	'24.0 49.8'=>'Львов',
	'33.0 68.9'=>'Мурманск',
	'-0.0 51.4'=>'Лондон',
	'33.5 44.6'=>'Севастополь',
	'86.0 55.3'=>'Кемерово',
	'39.5 52.6'=>'Липецк',
	'-95.8 38.0'=>'США',
	'27.9 53.7'=>'Беларусь',
	'31.9 54.7'=>'Смоленск',
	'47.8 56.6'=>'Йошкар-Ола',
	'41.9 45.0'=>'Ставрополь',
	'40.4 56.1'=>'Владимир',
	'39.7 54.6'=>'Рязань',
	'39.7 43.5'=>'Сочи',
	'24.7 59.4'=>'Таллин',
	'-74.0 40.8'=>'Нью-Йорк',
	'49.4 53.5'=>'Тольятти',
	'28.8 47.0'=>'Кишинев',
	'40.5 64.5'=>'Архангельск',
	'53.7 32.7'=>'Иран',
	'34.3 53.2'=>'Брянск',
	'37.1 55.9'=>'Зеленоград',
	'36.5 50.6'=>'Белгород',
	'39.8 59.2'=>'Вологда',
	'41.4 52.7'=>'Тамбов',
	'34.8 32.1'=>'Тель-Авив',
	'36.0 52.9'=>'Орел',
	'36.1 51.7'=>'Курск',
	'50.8 61.6'=>'Сыктывкар',
	'14.4 50.0'=>'Прага',
	'34.0 44.9'=>'Симферополь',
	'35.2 31.7'=>'Иерусалим',
	'49.9 40.4'=>'Баку',
	'2.3 48.8'=>'Париж',
	'35.1 47.8'=>'Запорожье',
	'52.4 55.7'=>'Набережные Челны',
	'-79.4 43.6'=>'Торонто',
	'47.4 42.9'=>'Махачкала',
	'49.9 40.4'=>'Баку',
	'44.8 41.6'=>'Тбилиси',
	'37.3 55.9'=>'Химки',
	'28.3 57.8'=>'Псков',
	'66.9 48.5'=>'Казахстан',
	'47.4 29.2'=>'Кувейт',
	'-98.9 19.3'=>'Мексика',
	'87.1 53.7'=>'Новокузнецк',
	'74.5 42.8'=>'Бишкек',
	'-78.6 43.6'=>'Ошава',
	'69.2 41.2'=>'Ташкент',
	'39.3 48.5'=>'Луганск',
	'26.7 43.0'=>'Болгария',
	'37.5 55.4'=>'Подольск',
	'37.2 55.6'=>'Одинцово',
	'13.4 52.4'=>'Берлин',
	'45.1 54.1'=>'Саранск',
	'37.7 55.9'=>'Мытищи',
	'106.8 -5.8'=>'Джакарта',
	'40.9 57.7'=>'Кострома',
	'31.9 46.9'=>'Николаев',
	'35.0 32.7'=>'Израиль',
	'31.2 58.5'=>'Великий Новгород',
	//'35.0 31.3'=>'Израиль',
	'37.8 55.9'=>'Королев',
	'38.8 45.6'=>'Тимашевск',
	'37.9 55.7'=>'Люберцы',
	'113.9 0.0'=>'Индонезия',
	'71.4 51.1'=>'Астана',
	'58.9 53.4'=>'Магнитогорск',
	'19.0 47.4'=>'Будапешт',
	'37.4 55.9'=>'Долгопрудный',
	'150.8 59.5'=>'Магадан',
	'73.4 61.2'=>'Сургут',
	'37.9 59.1'=>'Череповец',
	'38.1 55.5'=>'Жуковский',
	'10.4 51.2'=>'Германия',
	'25.2 54.6'=>'Литва',
	'113.4 52.0'=>'Чита',
	'28.3 47.0'=>'Молдавия',
	'33.4 49.0'=>'Кременчуг',
	'107.6 51.8'=>'Улан-Удэ',
	'23.8 53.6'=>'Грондо',
	'38.2 55.5'=>'Раменское',
	'44.7 56.3'=>'Нижегородская область',
	'91.4 53.7'=>'Абакан',
	'129.7 62.0'=>'Якутск',
	'24.6 -27.4'=>'Гоа',
	'139.7 35.6'=>'Токио',
	'16.3 48.1'=>'Вена',
	'43.0 44.0'=>'Есентуки',
	'37.1 56.7'=>'Дубна',
	'37.4 54.9'=>'Серпухов',
	'135.0 48.4'=>'Хабаровск',
	'-77.0 38.8'=>'Вашингтон',
	//'38.8 58.0'=>'Москва',
	'-95.8 38.0'=>'США',
	'26.2 50.6'=>'ровно',
	'-79.4 43.6'=>'Торонто',
	'74.5 42.8'=>'Бишкек',
	'69.2 41.2'=>'Ташкент',
	'47.8 51.9'=>'Балаково',
	//'37.4 55.8'=>'Москва',
	'22.2 48.6'=>'Ужгород',
	'52.3 54.8'=>'Альметьевск',
	'53.7 63.5'=>'Ухта',
	'28.7 60.7'=>'Выборг',
	'73.1 49.8'=>'Караганда',
	'58.5 51.2'=>'Орск',
	'37.3 55.8'=>'Красногорск',
	'26.7 43.0'=>'Болгария',
	'35.2 48.6'=>'Новомосковск',
	'37.3 44.8'=>'Анапа',
	//'37.5 48.7'=>'Москва',
	//'-94.2 38.0'=>'США',
	//'30.1 59.5'=>'Россия',
	'38.4 55.7'=>'Электросталь',
	'34.5 48.5'=>'Днепродзержинск',
	'25.3 50.7'=>'Луцк',
	'142.7 46.9'=>'Южно-Сахалинск',
	'38.7 55.0'=>'Коломна',
	'103.9 52.5'=>'Ангарск',
	'25.6 42.0'=>'Димитровград',
	'25.2 54.6'=>'Вильнюс',
	'38.0 55.7'=>'Железнодорожный',
	'38.1 56.3'=>'Сергиев Посад',
	'36.6 55.1'=>'Обнинск',
	'85.2 52.5'=>'Бийск',
	//'38.4 55.8'=>'Электросталь',
	'38.1 48.3'=>'Горловка',
	//'37.9 55.9'=>'Королёв',
	'-77.0 38.8'=>'Вашингтон',
	'28.6 59.3'=>'Кингисепп',
	//'47.4 56.0'=>'Чебоксары',
	//'0.0 51.4'=>'Лондон',
	'28.8 45.3'=>'Измаил',
	'90.4 56.2'=>'Ачинск',
	'30.5 56.3'=>'Великие Луки',
	'41.9 45.0'=>'Ставрополь',
	'37.2 55.4'=>'Троицк',
	'40.9 57.0'=>'Иваново',
	'-71.1 42.3'=>'Бостон',
	'38.4 48.9'=>'Лисичанск',
	'43.6 43.4'=>'Нальчик',
	'59.9 56.9'=>'Первоуральск',
	'-87.7 41.8'=>'Чикаго',
	'38.8 45.6'=>'Димитров',
	'60.1 55.0'=>'Миасс',
	'34.1 44.4'=>'Алупка',
	'35.3 46.8'=>'Мелитополь',
	'69.0 61.0'=>'Ханты-Мансийск',
	'16.3 48.1'=>'Вена',
	'29.6 46.8'=>'Тирасполь',
	'37.8 56.0'=>'Пушкино',
	'37.5 56.3'=>'Яхрома',
	'2.1 41.3'=>'Барселона',
	'45.4 50.0'=>'Камышин',
	'24.9 60.2'=>'Хельсинки',
	'37.9 55.8'=>'Балашиха',
	'42.1 47.5'=>'Волгодонск',
	'38.9 55.8'=>'Орехово-Зуево',
	'33.3 67.5'=>'Алатиты',
	'4.8 52.3'=>'Амстердам',
	'36.7 56.3'=>'Клин',
	'64.0 67.5'=>'Воркута',
	'46.1 51.4'=>'Саратов',
	'40.2 47.7'=>'Шахты',
	'54.2 56.0'=>'Нефтекамск',
	'72.6 61.1'=>'Нефтеюганск',
	'94.4 51.7'=>'Кызыл',
	'38.5 52.6'=>'Елец',
	'36.8 55.9'=>'Истра',
	'52.0 55.7'=>'Елабуга',
	'95.7 56.2'=>'Канск',
	'35.3 45.0'=>'Феодосия',
	'41.3 56.3'=>'Ковров',
	'48.4 53.1'=>'Сызрань',
	'38.7 48.4'=>'Алчевск',
	'43.3 54.9'=>'Саров',
	'33.3 45.1'=>'Евпатория',
	'36.7 46.7'=>'Бердянск',
	'83.1 54.7'=>'Бердск',
	'30.1 49.8'=>'Белая Церковь',
	'37.9 55.6'=>'Лыткарино',
	'42.0 55.5'=>'Муром',
	'28.3 47.0'=>'Молдавия',
	'37.4 55.1'=>'Чехов',
	'86.7 53.8'=>'Прокопьевск',
	'42.7 43.9'=>'Кисловодск',
	'29.1 53.1'=>'Бобруйск',
	//'37.8 55.7'=>'Москва',
	'44.2 46.3'=>'Элиста',
	//'30.9 59.8'=>'Санкт-Петербург',
	//'106.8 -6.2'=>'Джакарта',
	'24.6 56.8'=>'Огре',
	'-122.3 37.5'=>'Сан-Франциско',
	'38.0 55.9'=>'Фрязино',
	'23.5 49.3'=>'Дрогобыч',
	'55.9 53.3'=>'Салават',
	'93.6 56.3'=>'Железногорск',
	'36.4 45.3'=>'Керчь',
	'45.6 43.3'=>'Грозный',
	//'55.7 37.5'=>'Иран',
	'54.1 56.7'=>'Чайковский',
	'38.0 44.5'=>'Геленджик',
	'9.9 53.6'=>'Гамбург',
	'59.7 55.1'=>'Златоуст',
	'36.7 55.3'=>'Наро-Фоминск',
	//'60.7 56.8'=>'Екатеринбург',
	'39.6 48.0'=>'Свердловск',
	'38.2 48.2'=>'Енакиево',
	'37.9 55.4'=>'Домодедово',
	'38.6 48.5'=>'Брянка',
	'61.9 56.4'=>'Каменск-Уральский',
	'35.8 48.5'=>'Павлоград',
	//'49.3 58.4'=>'Россия',
	'26.0 53.1'=>'Барановичи',
	'32.8 67.9'=>'Мончегорск',
	'38.5 48.6'=>'Первомайск',
	'85.4 56.7'=>'Октябрьский',
	'116.3 39.8'=>'Пекин',
	'30.7 50.5'=>'Бровары',
	'46.6 61.2'=>'Котлас',
	'100.5 13.7'=>'Бангкок',
	'-98.9 19.3'=>'Мексика',
	'32.7 46.6'=>'Херсон',
	'26.0 52.1'=>'Пинск',
	'127.5 50.2'=>'Благовещенск',
	//'55.9 55.0'=>'Благовещенск',
	'8.6 50.1'=>'Франкфурт-на-Майне',
	'76.7 66.0'=>'Новый Уренгой',
	'43.8 55.3'=>'Арзамас',
	'30.6 46.2'=>'Ильичевск',
	//'30.2 50.5'=>'Киев',
	'52.6 58.1'=>'Глазгов',
	'41.0 44.9'=>'Армавир',
	'22.0 54.4'=>'Озерск',
	'113.9 62.5'=>'Мирный',
	'33.5 59.6'=>'Тихвин',
	'137.0 50.5'=>'Комсомольск-на-Амуре',
	'28.6 55.5'=>'Новополоцк',
	'30.4 54.5'=>'Орша',
	'158.6 53.0'=>'Петропавловск-Камчатский',
	'30.6 60.0'=>'Всеволожск',
	'102.8 58.0'=>'Усть-Илимск',
	'85.9 51.9'=>'Горно-Алтайск',
	'88.2 69.3'=>'Норильск',
	//'11.9 50.8'=>'Германия',
	'44.1 56.1'=>'Кстово',
	//'55.7 37.6'=>'Иран',
	'60.7 56.0'=>'Снежинск',
	'26.5 55.8'=>'Даугавлипс',
	'68.2 58.1'=>'Тобольск',
	'-0.2 43.1'=>'Коараз',
	'56.7 59.4'=>'Усолье',
	'57.1 50.2'=>'Актобе',
	'55.8 37.5'=>'Минудешт',
	'-2.2 53.4'=>'Манчестер',
	'28.0 59.4'=>'Нарва',
	'35.6 58.4'=>'Вятка',
	'40.8 64.4'=>'Новодвинск',
	'75.4 63.1'=>'Ноябрьск',
	//'27.7 53.9'=>'Королёв',
	'38.0 54.8'=>'Ступино',
	'33.9 58.3'=>'Боровичи',
	'37.5 51.2'=>'Губкин',
	'34.2 62.1'=>'Кандопога',
	'12.9 37.6'=>'Менфи',
	'30.5 64.5'=>'Костомукша',
	'40.4 52.8'=>'Мичуринск',
	'52.8 54.5'=>'Бугульма',
	//'37.5 55.9'=>'Химки',
	'58.3 51.2'=>'Новотроицк',
	//'8.6 54.3'=>'Санкт-Петербург',
	'53.9 57.0'=>'Воткинск',
	'43.1 44.1'=>'Минеральные Воды',
	'14.4 50.0'=>'Прага',
	'34.0 44.9'=>'Симферополь',
	'38.1 56.2'=>'Сергиев-Посад',
	'80.2 50.4'=>'Семипалатинск',
	'24.0 42.2'=>'Белово',
	//'21.5 52.1'=>'Минск',
	'81.2 51.5'=>'Рубцовск',
	'37.5 55.3'=>'Климовск',
	'32.0 59.4'=>'Кириши',
	'-6.2 53.3'=>'Дублин',
	'31.1 48.5'=>'Украина',
	'36.2 50.0'=>'Харьков',
	'37.7 55.5'=>'Россия'
);

$wobot['destn3'] = array(
'Москва'=>'Россия',
'Санкт-петербург'=>'Россия',
'Екатеринбург'=>'Россия',
'Россия'=>'Россия',
'Одесса'=>'Россия',
'Калуга'=>'Россия',
'Минск'=>'Россия',
'Севастопль'=>'Россия',
'Новосибирск'=>'Россия',
'Астрахань'=>'Россия',
'Краснодар'=>'Россия',
'Киев'=>'Украина',
'Харьков'=>'Украина',
'Самара'=>'Россия',
'Нижний Новгород'=>'Россия',
'Пермь'=>'Россия',
'Ростов-на-Дону'=>'Россия',
'Челябинск'=>'Россия',
'Казань'=>'Россия',
'Краснодар'=>'Россия',
'Воронеж'=>'Россия',
'Уфа'=>'Россия',
'Омск'=>'Россия',
'Волгоград'=>'Россия',
'Саратов'=>'Россия',
'Иркутск'=>'Россия',
'Красноярск'=>'Россия',
'Томск'=>'Россия',
'Владивосток'=>'Россия',
'Ульяновск'=>'Россия',
'Тула'=>'Россия',
'Рига'=>'Латвия',
'Тверь'=>'Россия',
'Тюмень'=>'Россия',
'Барнаул'=>'Россия',
'Астрахань'=>'Россия',
'Днепропетровск'=>'Украина',
'Ижевск'=>'Россия',
'Хабаровск'=>'Россия',
'Калининград'=>'Россия',
'Ярославль'=>'Россия',
'Алматы'=>'Казахстан', 
'Киров'=>'Россия',
'Оренбург'=>'Россия',
'Пенза'=>'Россия',
'Иваново'=>'Россия',
'Чебоксары'=>'Россия',
'Донецк'=>'Украина',
'Львов'=>'Россия',
'Мурманск'=>'Россия',
'Лондон'=>'Англия',
'Севастополь'=>'Россия',
'Кемерово'=>'Россия',
'Липецк'=>'Россия',
'США'=>'США',
'Беларусь'=>'Беларусь',
'Смоленск'=>'Россия',
'Йошкар-Ола'=>'Россия',
'Ставрополь'=>'Россия',
'Владимир'=>'Россия',
'Рязань'=>'Россия',
'Сочи'=>'Россия',
'Таллин'=>'Эстония',
'Нью-Йорк'=>'США',
'Тольятти'=>'Россия',
'Кишинев'=>'Молдавия',
'Архангельск'=>'Россия',
'Иран'=>'Иран',
'Брянск'=>'Россия',
'Зеленоград'=>'Россия',
'Белгород'=>'Россия',
'Вологда'=>'Россия',
'Тамбов'=>'Россия',
'Тель-Авив'=>'Израиль',
'Орел'=>'Россия',
'Курск'=>'Россия',
'Сыктывкар'=>'Россия',
'Прага'=>'Чехия',
'Симферополь'=>'Украина',
'Иерусалим'=>'Израиль',
'Баку'=>'Азербайджан',
'Париж'=>'Франция',
'Запорожье'=>'Украина',
'Набережные Челны'=>'Россия',
'Торонто'=>'Канада',
'Махачкала'=>'Россия',
'Тбилиси'=>'Грузия',
'Химки'=>'Россия',
'Псков'=>'Россия',
'Казахстан'=>'Казахстан',
'Кувейт'=>'Кувейт',
'Мексика'=>'Мексика',
'Новокузнецк'=>'Россия',
'Бишкек'=>'Киргизия',
'Ошава'=>'Канада',
'Ташкент'=>'Узбекистан',
'Луганск'=>'Украина',
'Болгария'=>'Болгария',
'Подольск'=>'Россия',
'Одинцово'=>'Россия',
'Берлин'=>'Германия',
'Саранск'=>'Россия',
'Мытищи'=>'Россия',
'Джакарта'=>'Индонезия',
'Кострома'=>'Россия',
'Николаев'=>'Украина',
'Израиль'=>'Израиль',
'Великий Новгород'=>'Россия',
'Королев'=>'Россия',
'Тимашевск'=>'Россия',
'Люберцы'=>'Россия',
'Индонезия'=>'Индонезия',
'Астана'=>'Казахстан',
'Магнитогорск'=>'Россия',
'Будапешт'=>'Венгрия',
'Долгопрудный'=>'Россия',
'Магадан'=>'Россия',
'Сургут'=>'Россия',
'Череповец'=>'Россия',
'Жуковский'=>'Россия',
'Германия'=>'Германия',
'Литва'=>'Литва',
'Чита'=>'Россия',
'Молдавия'=>'Молдавия',
'Кременчуг'=>'Украина',
'Улан-Удэ'=>'Россия',
'Грондо'=>'Беларусь',
'Раменское'=>'Россия',
'Нижегородская область'=>'Россия',
'Абакан'=>'Россия',
'Якутск'=>'Россия',
'Гоа'=>'Индия',
'Токио'=>'Япония',
'Вена'=>'Австрия',
'Есентуки'=>'Россия',
'Дубна'=>'Россия',
'Серпухов'=>'Россия',
'Хабаровск'=>'Россия',
'Вашингтон'=>'США',
'Москва'=>'Россия',
'США'=>'США',
'Ровно'=>'Украина',
'Торонто'=>'Канада',
'Бишкек'=>'Киргизия',
'Ташкент'=>'Узбекистан',
'Балаково'=>'Россия',
'Москва'=>'Россия',
'Ужгород'=>'Украина',
'Альметьевск'=>'Россия',
'Ухта'=>'Россия',
'Выборг'=>'Россия',
'Караганда'=>'Казахстан',
'Орск'=>'Россия',
'Красногорск'=>'Россия',
'Болгария'=>'Болгария',
'Новомосковск'=>'Россия',
'Анапа'=>'Россия',
'Москва'=>'Россия',
'США'=>'США',
'Россия'=>'Россия',
'Электросталь'=>'Россия',
'Днепродзержинск'=>'Украина',
'Луцк'=>'Украина',
'Южно-Сахалинск'=>'Россия',
'Коломна'=>'Россия',
'Ангарск'=>'Россия',
'Димитровград'=>'Болгария',
'Вильнюс'=>'Литва',
'Железнодорожный'=>'Россия',
'Сергиев Посад'=>'Россия',
'Обнинск'=>'Россия',
'Бийск'=>'Россия',
'Электросталь'=>'Россия',
'Горловка'=>'Украина',
'Королев'=>'Россия',
'Вашингтон'=>'США',
'Кингисепп'=>'28.6 59.3',
'Чебоксары'=>'Россия',
'Лондон'=>'Англия',
'Измаил'=>'Румыния',
'Ачинск'=>'Россия',
'Великие Луки'=>'Россия',
'Ставрополь'=>'Россия',
'Троицк'=>'Россия',
'Иваново'=>'Россия',
'Бостон'=>'США',
'Лисичанск'=>'Украина',
'Нальчик'=>'Россия',
'Первоуральск'=>'Россия',
'Чикаго'=>'США',
'Димитров'=>'Россия',
'Миасс'=>'Россия',
'Алупка'=>'Ураина',
'Мелитополь'=>'Украина',
'Ханты-Мансийск'=>'Россия',
'Вена'=>'Австрия',
'Тирасполь'=>'Молдавич',
'Пушкино'=>'Россия',
'Яхрома'=>'Россия',
'Барселона'=>'Испани',
'Камышин'=>'Россия',
'Хельсинки'=>'Финляндия',
'Балашиха'=>'Россия',
'Волгодонск'=>'Россия',
'Орехово-Зуево'=>'Россия',
'Алатиты'=>'Россия',
'Амстердам'=>'Голандия',
'Клин'=>'Россия',
'Воркута'=>'Россия',
'Саратов'=>'Россия',
'Шахты'=>'Россия',
'Нефтекамск'=>'Россия',
'Нефтеюганск'=>'Россия',
'Кызыл'=>'Россия',
'Елец'=>'Россия',
'Истра'=>'Россия',
'Елабуга'=>'Россия',
'Канск'=>'Россия',
'Феодосия'=>'Украина',
'Ковров'=>'Россия',
'Сызрань'=>'Россия',
'Алчевск'=>'Украина',
'Саров'=>'Россия',
'Евпатория'=>'Украина',
'Бердянск'=>'Украина',
'Бердск'=>'Россия',
'Белая Церковь'=>'Украина',
'Лыткарино'=>'Россия',
'Муром'=>'Россия',
'Молдавия'=>'Молдавия',
'Чехов'=>'Россия',
'Прокопьевск'=>'Россия',
'Кисловодск'=>'Россия',
'Бобруйск'=>'Беларусь',
'Москва'=>'Россия',
'Элиста'=>'Россия',
'Санкт-Петербург'=>'Россия',
'Джакарта'=>'Индонезия',
'Огре'=>'Латвия',
'Сан-Франциско'=>'США',
'Фрязино'=>'Россия',
'Дрогобыч'=>'Украина',
'Салават'=>'Россия',
'Железногорск'=>'Россия',
'Керчь'=>'Россия',
'Грозный'=>'Россия',
'Иран'=>'Иран',
'Чайковский'=>'Россия',
'Геленджик'=>'Россия',
'Гамбург'=>'Германия',
'Златоуст'=>'Россия',
'Наро-Фоминск'=>'Россия',
'Екатеринбург'=>'Россия',
'Свердловск'=>'Россия',
'Енакиево'=>'Россия',
'Домодедово'=>'Россия',
'Брянка'=>'Украина',
'Каменск-Уральский'=>'Россия',
'Павлоград'=>'Россия',
'Россия'=>'Россия',
'Барановичи'=>'Беларусь',
'Мончегорск'=>'Россия',
'Первомайск'=>'Украина',
'Октябрьский'=>'Россия',
'Пекин'=>'Китай',
'Бровары'=>'Украина',
'Котлас'=>'Россия',
'Бангкок'=>'Таиланд',
'Мексика'=>'Мексика',
'Херсон'=>'Украина',
'Пинск'=>'Беларусь',
'Благовещенск'=>'Россия',
'Благовещенск'=>'Россия',
'Франкфурт-на-Майне'=>'Германия',
'Новый Уренгой'=>'Россия',
'Арзамас'=>'Россия',
'Ильичевск'=>'Украина',
'Киев'=>'Украина',
'Глазгов'=>'Россия',
'Армавир'=>'Россия',
'Озерск'=>'Россия',
'Мирный'=>'Россия',
'Тихвин'=>'Россия',
'Комсомольск-на-Амуре'=>'Россия',
'Новополоцк'=>'Беларусь',
'Орша'=>'Беларусь',
'Петропавловск-Камчатский'=>'Россия',
'Всеволожск'=>'Россия',
'Усть-Илимск'=>'Россия',
'Горно-Алтайск'=>'Россия',
'Норильск'=>'Россия',
'Германия'=>'Германия',
'Кстово'=>'Россия',
'Иран'=>'Иран',
'Снежинск'=>'Россия',
'Даугавлипс'=>'Латвия',
'Тобольск'=>'Россия',
'Коараз'=>'Франция',
'Усолье'=>'Россия',
'Актобе'=>'Казахстан',
'Минудешт'=>'Иран',
'Манчестер'=>'Англия',
'Нарва'=>'Эстония',
'Вятка'=>'Россия',
'Новодвинск'=>'Россия',
'Ноябрьск'=>'Россия',
'Королёв'=>'Россия',
'Ступино'=>'Россия',
'Боровичи'=>'Россия',
'Губкин'=>'Россия',
'Кандопога'=>'Россия',
'Менфи'=>'Италия',
'Костомукша'=>'Россия',
'Мичуринск'=>'Россия',
'Бугульма'=>'Россия',
'Химки'=>'Россия',
'Новотроицк'=>'Россия',
'Санкт-Петербург'=>'Россия',
'Воткинск'=>'Россия',
'Минеральные Воды'=>'Россия',
'Прага'=>'Чехия',
'Симферополь'=>'Украина',
'Сергиев-Посад'=>'Россия',
'Семипалатинск'=>'Россия',
'Белово'=>'Россия',
'Минск'=>'Беларусь',
'Рубцовск'=>'Россия',
'Климовск'=>'Россия',
'Кириши'=>'Россия',
'Дублин'=>'Ирландия'
);

$wobot['cities']=array(
'moscow'=>'moskva',
'kyev'=>'kiev',
'ёбург'=>'ekaterinburg',
'kharkov'=>'harkov',
'beijing'=>'pekin',
'москва'=>'moskva',
'санкт-петербург'=>'sankt-peterburg',
'saint petersburg'=>'sankt-peterburg',
'saint-p'=>'sankt-peterburg',
'st. petersburg'=>'sankt-peterburg',
'spb'=>'sankt-peterburg',
'екатеринбург'=>'ekaterinburg',
'одесса'=>'odessa',
'калуга'=>'kaluga',
'минск'=>'minsk',
'севастополь'=>'sevastopol',
'астрахань'=>'astrahan',
'краснодар'=>'krasnodar',
'киев'=>'kiev',
'харьков'=>'harkov',
'самара'=>'samara',
'берестовица'=>'berestovitsa',
'ульяновск'=>'ulyanovsk',
'пекин'=>'pekin',
'кишинев'=>'kishinev',
'оренбург'=>'orenburg',
'волгоград'=>'volgograd',
'казань'=>'kazan',
'питер'=>'sankt-peterburg',
'минская область'=>'minsk',
'russian'=>'moskva',
'russia'=>'moskva',
'belarus'=>'minsk',
'ukraine'=>'kiev',
'донецк'=>'donetsk',
'рига'=>'riga'
);*/

function menu()
{
    global $html_out;
    $html_out.= '';/*'<!--
<p class="menuitem">Рекламные компании</p>
<p class="menuitem">
    <a href="#" class="menuevent" rel="company/list"><img src="img/list.png" class="menuicon" alt=" title=""></a>
    <a href="#" class="menuevent" rel="company/add"><img src="img/add.png" class="menuicon" alt=" title=""></a>
</p>
<p class="menuitem">Пользователи</p>
<p class="menuitem">
    <a href="#" class="menuevent" rel="user/list"><img src="img/list.png" class="menuicon" alt=" title=""></a>
    <a href="#" class="menuevent" rel="user/add"><img src="img/add.png" class="menuicon" alt=" title=""></a>
</p>-->
<p class="menuitem">Дамп сайтов</p>
<p class="menuitem">
    <a href="#" class="menuevent" rel="monitor/list"><img src="img/list.png" class="menuicon" alt=" title=""></a>
    <a href="#" class="menuevent" rel="monitor/add"><img src="img/add.png" class="menuicon" alt=" title=""></a>
</p>
<p class="menuitem">Блоги</p>
<p class="menuitem">
    <a href="#" class="menuevent" rel="blog/search"><img src="img/search.png" class="menuicon" alt=" title=""></a>
</p>'
<p class="menuitem">Услуги</p>
<p class="menuitem">
    <a href="#" class="menuevent" rel="user/office"><img src="img/list.png" class="menuicon" alt=" title=""></a>
    <a href="#" class="menuevent" rel="user/blank"><img src="img/add.png" class="menuicon" alt=" title=""></a>
</p>
</td>
<td style="vertical-align: top;">
<div id="cntnt" class="cntnt">
';*/
}

    function deleteDirectory($dir) {
        if (!file_exists($dir)) return true;
        if (!is_dir($dir)) return unlink($dir);
        foreach (scandir($dir) as $item) {
            if ($item == '.' || $item == '..') continue;
            if (!deleteDirectory($dir.DIRECTORY_SEPARATOR.$item)) return false;
        }
        return rmdir($dir);
    }



function getkeyword($keyw,$klink)
{
	//$_GET['link']="http://twitter.com/blog_medvedev";
	//echo $klink;
	$word=$keyw;
	$cont=parseUrl($klink);
	//echo $cont;
	preg_match('/charset=([-a-z0-9_]+)/is',$cont,$charset);
	if (($charset[1]=="utf-8") || ($charset[1]=="UTF-8"))
	{
	/*$pat="/<[^<]*>[^<]*?(".$word.")[^<]*?<\/[^<]*?>/";*/
		$pat="/(>[^<]*?)(".$word.")([^<]*?)/is";	
	}
	else
	{
		$pat="/(>[^<]*?)(".$word.")([^<]*?)/is";	
	}
	$rep='$1<b style="color:white;background-color: #83b226; -moz-border-radius: 10px; padding: 5px;">$2</b>$3';
	//echo $cont;
	$text=preg_replace($pat, $rep, $cont);
	//echo $text;
	if (($charset[1]=="windows-1251") || ($charset[1]=="Windows-1251") || ($charset[1]=="WINDOWS-1251"))
	{
		$text=iconv("windows-1251","UTF-8",$text);
	}
	else
	if (($charset[1]=="koi8-r") || ($charset[1]=="KOI8-R"))
	{
		$text=iconv("koi8-r","UTF-8",$text);
	}
	//echo '<base href="http://'.parse_url($_GET['link'],PHP_URL_HOST).'/">';
	return $text;
}

function gettopwords($posts)
{
	$nword=array("здесь","всем");
	foreach ($posts as $order)
	{
		$mas1=$order;
		$mas1=preg_replace('/\n/is',' ',$mas1);
		$mas1=preg_replace('/[ ]+/is',' ',$mas1);
		$mas1=preg_replace('/\#/isu',' ',$mas1);
		$mas1=preg_replace('/\@/isu',' ',$mas1);
		$mas1=str_replace('\n',' ',$mas1);
		$mas1=str_replace('
',' ',$mas1);
		$mas1=preg_replace('/,/is','',$mas1);
		$mas1=preg_replace('/_/isu',' ',$mas1);
		$mas1=preg_replace('/\&lt\;/is',' ',$mas1);
		$mas1=preg_replace('/\&gt\;/is',' ',$mas1);
		$mas1=preg_replace('/\&quot\;/is',' ',$mas1);
		$mas1=preg_replace('/\&amp\;/is',' ',$mas1);
		$mas1=preg_replace('/_/isu',' ',$mas1);
		$mas1=preg_replace('/\./is','',$mas1);
		$mas1=preg_replace('/\:/is','',$mas1);
		$mas1=preg_replace('/\!/is','',$mas1);
		$mas1=preg_replace('/\"/is','',$mas1);
		$mas1=preg_replace('/\"/is','',$mas1);
		$mas1=preg_replace('/\@/is','',$mas1);
		$mas1 = mb_strtolower($mas1, 'UTF-8');
		$mas=explode(' ',$mas1);
		foreach ($mas as $item)
		{
			$mas2=$item;
			$item=preg_replace('/(а|ев|ов|ие|ье|е|иями|ями|ами|еи|ии|и|ией|ей|ой|ий|ов|й|и|иям|ям|ием|ем|ам|ом|о|у|ах|иях|ях|ы|ь|ию|ью|ю|ия|ья|ь|я)$/is','',$item);
			//echo $item."\n";
			if (isset($outmas[$item]))
			{
				$outmas[$item]['count']++;
			}
			else
			{
				$outmas[$item]['count']=1;
				$outmas[$item]['reword']=$mas2;
			}
		}
	}
	arsort($outmas);
	foreach ($outmas as $key => $item)
	{
		if ($i==20)
		{
			break;
		}
		else
		{
			if ((strlen($item['reword'])>6) && (!in_array($item['reword'],$nword)))
			{
				$i++;
				$otmas['word'][]=$item['reword'];
				$otmas['count'][]=$item['count'];
				//echo $item['reword'].' '.$item['count']."\n";
			}
		}
	}
	return $otmas;
}

function GetFullPost($link,$part)
{
	//$handle=fopen("ex.txt","r");
	//$text=fread($handle,filesize("ex.txt"));
	global $db;
	$masch=array('\\','/','^','$','(',')','<','[','{','|','>','.','*','+','?');
	//print_r($charset[1]);
	//echo $charset[1][0];
	$result = $db->query("SELECT * FROM  `blog_full_com` WHERE  `ful_com_link` =  '".$link."'");
	//$row = $db->fetch($result);
	if (!$db->num_rows($result)) 
	{/*	
		sleep(1);
		$link=urldecode($link);
		$text=parseURL($link);
		$text=strip_tags($text,"<div><meta>");
		//echo $text;
		preg_match_all('/charset=([-a-z0-9_]+)/is',$text,$charset);
		//echo "fail";
		if (($charset[1][0]!='') || ($charset[1][0]!='utf-8'))
		{
			if ($charset[1][0]!="utf-8")
			{
				$text=iconv($charset[1][0], "utf-8", $text);
				//echo "UTF-8";
			}
		}
		//for ($i=0;$i<mb_strlen($part,'UTF-8');$i++)
		{
			//$p1.='['.mb_substr($part, $i, 1, 'UTF-8').']';
			//echo mb_substr($part, $i, 1, 'UTF-8')."\/";
		}
			//echo $part;
		foreach ($masch as $item)
		{
			//echo $part;
			//$part=ereg_replace($item,'\\'.$item,$part);
			$part=str_replace($item,'\\'.$item,$part);
			//echo $part."<br>";
			//echo '\\'.$item;
		}
		//$part=addslashes($part);
		//echo $p1;
		/*echo '/<div[^<]*?>(?<ou>(.*?)'.$part.'(.*?)<\/div>)/is';*/
		//$part=$p1;
		//echo "|".$part."|";
		/*echo '/<div[^<]*?>(?<ou>(.*?)'.$part.'(.*?))<\/div>/is';*/
		/* preg_match_all('/<div[^<]*?>(?<ou>(.*?)'.$part.'(.*?)<\/div>)/is',$text,$out);*/
		/*echo '/<div[^<]*?>(?<ou>(.*?)'.$part.'(.*?)<\/div>)/is';*/
		/*while ($out[ou][0]!="")
		{
			$last=$out[ou][0];
			//echo $last;
			//echo $last."<br><br><br><br><br>";
			preg_match_all('/<div[^<]*?>(?<ou>(.*?)'.$part.'(.*?)<\/div>)/is',$out[ou][0],$our);
			$out[ou][0]=$our[ou][0];
		}
		$result = $db->query("INSERT INTO  `blog_full_com` (`ful_com_id` ,`ful_com_link` ,`ful_com_post`)
VALUES (NULL ,  '".$link."',  '".urlencode($last)."');");*/
	}		
	else
	{
		//echo "suc";
		$row = $db->fetch($result);
		$last=urldecode($row['ful_com_post']);
	}
	//echo $last;
	return ($last);
}

function get_mas($id,$day)
{
	//$day=$day+0*86400;
    global $db,$_SERVER;
    if ($_SERVER['HTTP_REFERER']=='http://production.wobot.ru/messages_list.html') return $outmas;
	$ressec=$db->query('SELECT post_time FROM blog_post WHERE order_id='.$id.' AND (post_time>='.($day).' AND post_time<'.($day+86400).')');
	//echo 'SELECT * FROM blog_post WHERE order_id='.$id.' AND (post_time>'.$day.' AND post_time<'.($day+86400).')';
	for ($i=0;$i<=23;$i++)
	{
		$outmas['time'][$i]=0;
	}
	while($blog=$db->fetch($ressec))
	{
		if ((intval(date("H",$blog['post_time']))!=0) || (intval(date("i",$blog['post_time']))!=0) || (intval(date("s",$blog['post_time']))!=0))
		{
			$outmas['time'][intval(date("H",$blog['post_time']))]++;
		}
	}
	ksort($outmas['time']);
	//print_r($outmas);
	return $outmas;
}

function get_mas_week($id,$start,$end)
{
	//$day=$day+0*86400;
    global $db,$_SERVER;
    if ($_SERVER['HTTP_REFERER']=='http://production.wobot.ru/messages_list.html') return $outmas;
	//echo 'SELECT * FROM blog_post WHERE order_id='.$id.' AND (post_time>='.($start).' AND post_time<'.($end+86400).') ORDER by post_time DESC';
	$ressec=$db->query('SELECT post_time FROM blog_post WHERE order_id='.$id.' AND (post_time>='.($start).' AND post_time<'.($end+86400).') ORDER by post_time DESC');
	//echo 'SELECT * FROM blog_post WHERE order_id='.$id.' AND (post_time>'.$day.' AND post_time<'.($day+86400).')';
	for ($i=$end;$i>=$start;$i-=86400*7)
	{
		$outmas['time'][$i]=0;
	}
	//$outmas['time'][$start]=0;
	//$outmas['time'][$start-$k*86400*7]=0;
	$k=1;
	while($blog=$db->fetch($ressec))
	{
		/*if ((intval(date("H",$blog['post_time']))!=0) || (intval(date("i",$blog['post_time']))!=0) || (intval(date("s",$blog['post_time']))!=0))
		{
			$outmas['time'][intval(date("H",$blog['post_time']))]++;
		}*/
		//echo $k.' '.($end-$k*86400*7).'<br>';
		if ($blog['post_time']<($end+86400-$k*86400*7))
		{
			//$outmas['time'][]
			$k++;
			$outmas['time'][$end-($k-1)*86400*7]=1;
		}
		else
		{
			$outmas['time'][$end-($k-1)*86400*7]++;
		}
	}
	ksort($outmas['time']);
	//print_r($outmas);
	return $outmas;
}

function get_mas_mon($id,$start,$end)
{
	//$day=$day+0*86400;
    global $db,$_SERVER;
    if ($_SERVER['HTTP_REFERER']=='http://production.wobot.ru/messages_list.html') return $outmas;
	//echo 'SELECT * FROM blog_post WHERE order_id='.$id.' AND (post_time>='.($start).' AND post_time<'.($end+86400).') ORDER by post_time DESC';
	$ressec=$db->query('SELECT post_time FROM blog_post WHERE order_id='.$id.' AND (post_time>='.($start).' AND post_time<'.($end+86400).') ORDER by post_time DESC');
	//echo 'SELECT * FROM blog_post WHERE order_id='.$id.' AND (post_time>'.$day.' AND post_time<'.($day+86400).')';
	//for ($i=0;$i<23;$i++)
	{
	//	$outmas['time'][$i]=0;
	}
	for ($i=$end;$i>=$start;$i-=86400*30)
	{
		$outmas['time'][$i]=0;
	}
	//$outmas['time'][$start]=0;
	//$outmas['time'][$start-$k*86400*30]=0;
	$k=1;
	while($blog=$db->fetch($ressec))
	{
		/*if ((intval(date("H",$blog['post_time']))!=0) || (intval(date("i",$blog['post_time']))!=0) || (intval(date("s",$blog['post_time']))!=0))
		{
			$outmas['time'][intval(date("H",$blog['post_time']))]++;
		}*/
		//echo $k.' '.($end-$k*86400*7).'<br>';
		if ($blog['post_time']<($end+86400-$k*86400*30))
		{
			//$outmas['time'][]
			$k++;
			$outmas['time'][$end-($k-1)*86400*30]=1;
		}
		else
		{
			$outmas['time'][$end-($k-1)*86400*30]++;
		}
	}
	ksort($outmas['time']);
	//print_r($outmas);
	return $outmas;
}

function get_mas_quar($id,$start,$end)
{
	//$day=$day+0*86400;
    global $db,$_SERVER;
    if ($_SERVER['HTTP_REFERER']=='http://production.wobot.ru/messages_list.html') return $outmas;
	//echo 'SELECT * FROM blog_post WHERE order_id='.$id.' AND (post_time>='.($start).' AND post_time<'.($end+86400).') ORDER by post_time DESC';
	$ressec=$db->query('SELECT post_time FROM blog_post WHERE order_id='.$id.' AND (post_time>='.($start).' AND post_time<'.($end+86400).') ORDER by post_time DESC');
	//echo 'SELECT * FROM blog_post WHERE order_id='.$id.' AND (post_time>'.$day.' AND post_time<'.($day+86400).')';
	//for ($i=0;$i<23;$i++)
	{
	//	$outmas['time'][$i]=0;
	}
	for ($i=$end;$i>=$start;$i-=86400*90)
	{
		$outmas['time'][$i]=0;
	}
	//$outmas['time'][$start]=0;
	//$outmas['time'][$start-$k*86400*30]=0;
	$k=1;
	while($blog=$db->fetch($ressec))
	{
		/*if ((intval(date("H",$blog['post_time']))!=0) || (intval(date("i",$blog['post_time']))!=0) || (intval(date("s",$blog['post_time']))!=0))
		{
			$outmas['time'][intval(date("H",$blog['post_time']))]++;
		}*/
		//echo $k.' '.($end-$k*86400*7).'<br>';
		if ($blog['post_time']<($end+86400-$k*86400*90))
		{
			//$outmas['time'][]
			$k++;
			$outmas['time'][$end-($k-1)*86400*90]=1;
		}
		else
		{
			$outmas['time'][$end-($k-1)*86400*90]++;
		}
	}
	ksort($outmas['time']);
	//print_r($outmas);
	return $outmas;
}

function get_mas_halfy($id,$start,$end)
{
	//$day=$day+0*86400;
    global $db,$_SERVER;
    if ($_SERVER['HTTP_REFERER']=='http://production.wobot.ru/messages_list.html') return $outmas;
	//echo 'SELECT * FROM blog_post WHERE order_id='.$id.' AND (post_time>='.($start).' AND post_time<'.($end+86400).') ORDER by post_time DESC';
	$ressec=$db->query('SELECT post_time FROM blog_post WHERE order_id='.$id.' AND (post_time>='.($start).' AND post_time<'.($end+86400).') ORDER by post_time DESC');
	//echo 'SELECT * FROM blog_post WHERE order_id='.$id.' AND (post_time>'.$day.' AND post_time<'.($day+86400).')';
	//for ($i=0;$i<23;$i++)
	{
	//	$outmas['time'][$i]=0;
	}
	for ($i=$end;$i>=$start;$i-=86400*180)
	{
		$outmas['time'][$i]=0;
	}
	//$outmas['time'][$start]=0;
	//$outmas['time'][$start-$k*86400*30]=0;
	$k=1;
	while($blog=$db->fetch($ressec))
	{
		/*if ((intval(date("H",$blog['post_time']))!=0) || (intval(date("i",$blog['post_time']))!=0) || (intval(date("s",$blog['post_time']))!=0))
		{
			$outmas['time'][intval(date("H",$blog['post_time']))]++;
		}*/
		//echo $k.' '.($end-$k*86400*7).'<br>';
		if ($blog['post_time']<($end+86400-$k*86400*180))
		{
			//$outmas['time'][]
			$k++;
			$outmas['time'][$end-($k-1)*86400*180]=1;
		}
		else
		{
			$outmas['time'][$end-($k-1)*86400*180]++;
		}
	}
	ksort($outmas['time']);
	//print_r($outmas);
	return $outmas;
}

function get_isshow()
{
	global $mastype1,$isshow;
	global $mas_rep_link,$mas_spam,$mas_rep,$hn,$link,$nick,$content,$nnstr,$ntime,$etime,$time,$resorrr,$orderspams,$orderfavs,$_POST,$loc;
	$fop=fopen("debug.txt","a+");
	if (((($_POST[$nnstr])=='false') || empty($_POST[$nnstr])) && ($isshow==1))
	{
		$isshow=0;
	}
	//-----------------------TIME----------------------
	$ntime=strtotime($_POST['ntime']);
	$etime=strtotime($_POST['etime']);
	if ((($_POST['ntime']!='') && ($_POST['etime']!='')) && (($time<$ntime) || ($time>$etime)))
	{
		$isshow=0;
	}
	/*if (in_array($content,$mas_rep))
	{
		$mas_spam[]=$content;
	}*/
	//------------------------RESOURCES
	if (!in_array($hn,$resorrr))
	{
		//fwrite($fpizdec, "123\n");
		$isshow=0;
	}
	//-------------------SPAM NOT SPAM ...--------------------
	if (($_POST['showmode']=="onlyspam") && (!in_array($link,$orderspams)))
	{
		$isshow=0;
	}
	if (($_POST['showmode']=="notspam") && (in_array($link,$orderspams)))
	{
		$isshow=0;
	}
	if ($_POST['showmode']=="showall")
	{
		//$isshow=1;
	}
	if (($_POST['showmode']=="showfav") && ((!in_array($link,$orderfavs)) || (in_array($link,$orderspams))))
	{
		$isshow=0;
	}
	if ($_POST['unrep']=='on')
	{
		if (in_array($content,$mas_rep))
		{
			$isshow=0;	
		}
		else
		{
			$mas_rep[]=$content;
			//fwrite($fop,$content."\n");
		}
	}
	if (in_array($link,$mas_rep_link))
	{
		$isshow=0;	
	}
	else
	{
		$mas_rep_link[]=$link;
		//fwrite($fop,$content."\n");
	}
	fclose($fop);
	return $isshow;
}

function get_isshow2()
{
	global $mastype1,$isshow,$sources;//массив типов
	global $mas_rep_link,$mas_spam,$mas_rep,$hn,$link,$nick,$resorrr1,$content,$nnstr,$ntime,$etime,$time,$resorrr,$orderspams,$orderfavs,$_POST,$tgv,$loc,$wobot,$metrics;
	//print_r($metrics);
	unset($wh);
	//$fop=fopen("debug.txt","a+");
	//-----------------------NASTR----------------------
	if ($_POST['positive']=='on'){
		if (strlen($wh1)!=0) {
			$wh1.=' OR ';
		}
		$wh1.='p.post_nastr=1';
	}
	if ($_POST['negative']=='on'){
		if (strlen($wh1)!=0) {
			$wh1.=' OR ';
		}
		$wh1.='p.post_nastr=-1';
	}
	if ($_POST['neutral']=='on') {
		if (strlen($wh1)!=0) {
			$wh1.=' OR ';
		}
		$wh1.='p.post_nastr=0';
	}
	if (strlen($wh1)) $wh.='('.$wh1.')';
	//-----------------------TAGS----------------------
	if (count($tgv)!=0)
	{
		$wh.=' AND (';
		foreach ($tgv as $kk => $item)
		{
			if ($item!='na')
			{
				$wh.=' (FIND_IN_SET(\''.$item.'\',post_tag)>0) OR';
			}
			else
			{
				$wh.=' (post_tag = \'\') OR';
			}
		}
		$wh=substr($wh,0,strlen($wh)-2);
		$wh.=')';
	}
	//-----------------------HN------------------------
	$c_sou=count($sources);
	$c_res=count($resorrr);
	//print_r($sources);
	if ($c_sou!=$c_res)
	{
		$wh.=' AND (';
		if (($c_sou-$c_res)<($c_sou/2))
		{
			foreach ($sources as $key => $item)
			{
				if (!isset($resorrr1[$key]))
				{
					$wh.='post_host!=\''.$key.'\' AND ';
				}
			}
			$wh=substr($wh,0,strlen($wh)-4);
			$wh.=')';
		}
		else
		{
			foreach ($resorrr as $item)
			{
				$wh.='post_host=\''.$item.'\' OR ';
			}
			$wh=substr($wh,0,strlen($wh)-3);
			$wh.=')';
		}
	}
	//-----------------------LOCATION------------------
	{
		if (!isset($_POST['loc_othr']))
		{
			$wh.=' AND (';
			foreach ($loc as $item)
			{
				$item=preg_replace('/\_/is',' ',$item);
				$wh.=' b.blog_location=\''.$wobot['destn1'][$item].'\' OR';
			}
			$wh=substr($wh,0,strlen($wh)-2);
			$wh.=')';
		}
		else
		{
			foreach ($metrics['location'] as $k => $item)
			{
				if ((!in_array($k,$loc)) && ($k!=''))
				{
					$locw[]=$k;
				}
			}
			if (count($locw)!=0)
			{
				$wh.=' AND (';
				foreach ($locw as $item)
				{
					$item=preg_replace('/\_/is',' ',$item);
					$wh.=' (IFNULL(b.blog_location,0)!=\''.$wobot['destn1'][$item].'\') AND';
				}
				$wh=substr($wh,0,strlen($wh)-3);
				$wh.=')';
			}
		}
	}
	//-----------------------TIME----------------------
	$ntime=strtotime($_POST['ntime']);
	$etime=strtotime($_POST['etime']);
	if (strlen($wh)!=0) $wh.=' AND';
	$wh.=' (p.post_time>='.$ntime.' and p.post_time<'.mktime(0,0,0,date('m',$etime),date('d',$etime)+1,date('y',$etime)).')';

	//-----------------------TYPE----------------------
	if (($_POST['os']!='') && ($_POST['os']!='all')) {
		if (strlen($wh)!=0) $wh.=' AND';
		$wh.=' p.post_type="'.intval($_POST['os']).'"';
	}

	//------------------------RESOURCES
	// by get is show
	//-------------------SPAM NOT SPAM ...--------------------
	if ($_POST['showmode']=="onlyspam")
	{
		$wh2=' (p.post_spam=1)';
	}
	if ($_POST['showmode']=="notspam")
	{
		$wh2=' (p.post_spam=0)';
	}
	if ($_POST['showmode']=="showall")
	{
		$wh2='';
	}
	if ((strlen($wh)!=0) && strlen($wh2)) $wh.=' AND';
	if (strlen($wh2)) $wh.='('.$wh2.')';
	
	if ($_POST['showmode']=="showfav")
	{
		if (strlen($wh)!=0) $wh.=' AND';
		$wh.=' (p.post_fav=1)';
	}
	//wo repeats by content
	if ($_POST['unrep']=='on')
	{
		$wh.=' GROUP BY p.post_content';
	}
	else
		$wh.='';// GROUP BY p.post_link';
	//wo repeats by link
	$where.=$wh;
	//fclose($fop);
	return $where;
}

function getisshow3()
{
	global $_POST,$tgv,$tagsall,$tagsallrev,$src,$resorrr,$loc,$metrics,$wobot,$speak,$prom,$kww,$mtags;
	//---------------TIME----------------
	$wh.='AND (p.post_time>='.strtotime(($_POST['sd']=='')?$_POST['ntime']:$_POST['sd']).' AND p.post_time<='.strtotime(($_POST['ed']=='')?$_POST['etime']:$_POST['ed']).') AND ';
	//---------------NASTR----------------
	if ($_POST['ton1']=='p'){
		if (strlen($wh1)!=0) {
			$wh1.=' OR ';
		}
		$wh1.='p.post_nastr=1';
	}
	if ($_POST['ton2']=='m'){
		if (strlen($wh1)!=0) {
			$wh1.=' OR ';
		}
		$wh1.='p.post_nastr=-1';
	}
	if (($_POST['ton']=='n') || ($_POST['ton3']=='no')) {
		if (strlen($wh1)!=0) {
			$wh1.=' OR ';
		}
		$wh1.='p.post_nastr=0';
	}
	if (strlen($wh1)) $wh.='('.$wh1.')';
	//-----------------------TAGS----------------------
	if (count($tgv)!=0)
	{
		$wh.=' AND (';
		foreach ($tgv as $kk => $item)
		{
			if ($item!='без_тегов')
			{
				$wh.=' (FIND_IN_SET(\''.$tagsallrev[$item].'\',post_tag)>0) OR';
			}
			else
			{
				$wh.=' (post_tag = \'\') OR';
			}
		}
		$wh=substr($wh,0,strlen($wh)-2);
		$wh.=')';
	}
	//-----------------------TYPE----------------------
	switch ($_POST['ref']) {
	    case 1:
	        $wh.=' AND (p.post_fav=1)';
	        break;
	    case 2:
        	$wh.=' AND (p.post_spam!=1)';
	        break;
	    case 3:
        	$wh.=' AND (p.post_spam=1)';
	        break;
	}
	//--------------------HN-------------------
	//print_r($src);
	//print_r($resorrr);
	$c_sou=count($src);
	$c_res=count($resorrr);
	//echo count($src).' '.count($resorrr);
	if ($c_sou!=($c_res))
	{
		$wh.=' AND (';
		if (($c_sou-$c_res)<($c_sou/2))
		{
			foreach ($src as $key => $item)
			{
				if (!in_array($key,$resorrr))
				{
					$wh.='post_host!=\''.$key.'\' AND ';
				}
			}
			$wh=substr($wh,0,strlen($wh)-4);
			$wh.=')';
		}
		else
		{
			foreach ($resorrr as $item)
			{
				$wh.='post_host=\''.$item.'\' OR ';
			}
			$wh=substr($wh,0,strlen($wh)-3);
			$wh.=')';
		}
	}	
	//---------------------LOC------------------
	//print_r($_POST);
	$c_loc=count($loc);
	$metrics['location']['na']='na';
	$c_mloc=count($metrics['location']);
	//print_r($loc);
	//print_r($loc);
	//echo '<br><br>';
	//print_r($metrics['location']);
	//echo '||'.$c_loc.' '.$c_mloc;
	if (($c_loc)!=($c_mloc-1))
	{
		if ($c_loc<($c_mloc/2))
		{
			$wh.=' AND (';
			foreach ($loc as $key => $item)
			{
				if ($item!='na')
				{
					//echo $item.' |'.$wobot['destn2'][$item].'|<br>';
					//echo '<br><br><br><br>'.$item.'<br><br><br><br>';
					
					$wh.=' b.blog_location=\''.$wobot['destn2'][$item].'\' OR';
				}
				else
				{
					$wh.=' b.blog_location=\'\' OR IFNULL(b.blog_location,1)=1 OR';
				}
			}
			$wh=substr($wh,0,strlen($wh)-3).')';
		}
		else
		{
			$wh.=' AND (';
			//echo '<br><br>';
			//print_r($metrics['location']);
			//print_r($loc);
			//echo '<br><br>';
			foreach ($metrics['location'] as $key => $item)
			{
				if (!in_array($key,$loc))
				{
					//echo $key.'/';
					if ($key!='')
					{
						//echo $key.'<br>';
						if ($key!='na')
						{
							//echo '<br><br><br><br>'.$key.'<br><br><br><br>';
							$wh.=' IFNULL(b.blog_location,0)!=\''.$wobot['destn2'][$key].'\' AND';
						}
						else
						{
							//echo 'pizdec';
							$wh.=' IFNULL(b.blog_location,0)!=\'\' AND';
						}
					}
				}
			}
			$wh=substr($wh,0,strlen($wh)-4).')';
		}
	}
	//-----------------speakers--------------------
	if (($_POST['speakers']=='selected') && (count($speak)!=0))
	{
		$wh.=' AND (';
		$or='';
		foreach ($speak as $item)
		{
			$wh.=$or.' b.blog_login=\''.$item.'\'';
			$or=' OR ';
		}
		if (($_POST['promouters']!='selected') || (count($prom)==0))
		{
			$wh.=' )';
			//echo 'LALALLALALA';
		}
	}
	if (($_POST['promouters']=='selected') && (count($prom)!=0))
	{
		if (($_POST['speakers']!='selected') || (count($speak)==0))
		{
			$wh.=' AND (';
		}
		else
		{
			$wh.=' OR ';
		}
		$or='';
		foreach ($prom as $item)
		{
			$wh.=$or.' b.blog_login=\''.$item.'\'';
			$or=' OR ';
		}
		$wh.=' )';
	}
	if (($_POST['speakers']=='except') && (count($speak)!=0))
	{
		$wh.=' AND (';
		$or='';
		foreach ($speak as $item)
		{
			$wh.=$or.' b.blog_login!=\''.$item.'\'';
			$or=' AND ';
		}
		$wh.=' )';
	}
	if (($_POST['promouters']=='except') && (count($prom)!=0))
	{
		$wh.=' AND (';
		$or='';
		foreach ($speak as $item)
		{
			$wh.=$or.' b.blog_login!=\''.$item.'\'';
			$or=' AND ';
		}
		$wh.=' )';
	}
	//print_r($kww);
	if ($_POST['words_rb']=='selected')
	{
		if (count($kww)!=1)
		{
			$wh.=' AND (';
			$or='';
			foreach ($kww as $item)
			{
				if ($item!='rb')
				{
					$wh.=$or.'UPPER(p.post_content) LIKE \'%'.mb_strtoupper($item,'UTF-8').'%\'';
					$or=' OR ';
				}
			}
			$wh.=')';
		}
	}
	if ($_POST['words_rb']=='except')
	{
		print_r($kww);
		if (count($kww)!=0)
		{
			$wh.=' AND (';
			$or='';
			foreach ($kww as $item)
			{
				if (($item!='rb') && ($item!=''))
				{
					$wh.=$or.'UPPER(p.post_content) NOT LIKE \'%'.mb_strtoupper($item,'UTF-8').'%\'';
					$or=' AND ';
				}
			}
			$wh.=')';
		}
	}
	unset($metrics['location']['na']);
	return $wh;
}

/*function GetFullPost($link,$part)//table full_comments если есть пост то вывести из базы данных если нет то скачать записать в базу и вывести    $db->query(   mysql_num_rows($res)==0   $orderspam1 = $db->fetch($resspam1);  if (intval($orderspam1['spam_id'])==0)
{
	global $db;
	$text=parseURL($link);
	preg_match('/charset=([-a-z0-9_]+)/is',$text,$charset);
	//$linkk = mysql_connect('localhost', 'root', '123');
	//mysql_select_db("admin");	
	$result = $db->query("SELECT * FROM  `blog_full_com` WHERE  `ful_com_link` =  '".$link."' LIMIT 0 , 30");
	if (!mysql_num_rows($result)) 
	{
		//echo "fail";
		if ($charset[1]!="utf-8")
		{
			$text=iconv($charset[1], "utf-8", $text);
		}
		preg_match_all("/<div[^<]*?>(?<ou>(.*?)".$part."(.*?)<\/div>)/is",$text,$out);
		while ($out[ou][0]!="")
			{
			$last=$out[ou][0];
			preg_match_all("/<div[^<]*?>(?<ou>(.*?)".$part."(.*?)<\/div>)/is",$out[ou][0],$our);
			$out[ou][0]=$our[ou][0];
		}
		$result = $db->query("INSERT INTO  `blog_full_com` (`ful_com_id` ,`ful_com_link` ,`ful_com_post`)
VALUES (NULL ,  '".$link."',  '".htmlentities($last, ENT_QUOTES, "UTF-8")."');");
	}		
	else
	{
		//echo "suc";
		$row = $db->fetch($result);
		$last=$row['ful_com_post'];
	}
	//echo $last;
	return $last;
}*/


function getcity($url)
{
	//$content=parseURL($url);
        //$dom = new DomDocument;
        //$res = @$dom->loadHTML($content);
	
global $wobot;

	$pu=parse_url($url);
	$hostname=$pu['host'];
	
	switch($hostname)
	{
		case 'twitter.com':
		//http://twitter.com/ifsfreaks/statuses/12766451836
		//------|HOST-------|NICK-----|OTHER--------------|
			list($tmp,$nick,$tmp)=explode("/",$pu['path'],3);
			$content=parseURL('http://twitter.com/'.$nick);
			$dom = new DomDocument;
			$res = @$dom->loadHTML($content);
			$uls = $dom->getElementsByTagName("ul");
			
			foreach ($uls as $ul)
			{
				if ($ul->getAttribute("class")=="about vcard entry-author")
				{
					if ($ul->firstChild->nextSibling->nextSibling->firstChild->textContent=='Location')
					{
						list($location,$tmp) = explode(',',$ul->firstChild->nextSibling->nextSibling->firstChild->nextSibling->nextSibling->textContent,2);
						$location=mb_strtolower(strip_tags($location),"UTF-8");
						$location=(strlen($wobot['cities'][$location])>0?$wobot['cities'][$location]:$location);
					}
				}
			}

			//echo '[twitter] nick: "'.$nick.'" location: "'.$location.'"';
			break;
		case 'ya.ru':
		
			break;
		case 'mail.ru':
		
			break;
		default:
			list($nick,$host)=explode('.',$hostname,2);
			if ($host=='livejournal.com')
			{
			//http://skor-12.livejournal.com/190577.html?thread=806257
			//------|HOST-------------------|SHIT--------------------|
			//------|NICK---|DOMAIN---------|SHIT--------------------|
				//http://NICK.livejournal.com/profile
				$content=parseURL('http://'.$nick.'.livejournal.com/profile');
				$dom = new DomDocument;
				$res = @$dom->loadHTML($content);
				$as = $dom->getElementsByTagName("a");
				foreach ($as as $a)
				{
					if ($a->getAttribute("class")=="locality")
					{
						//if ($ul->firstChild->nextSibling->nextSibling->firstChild->textContent=='Location')
						//{
						//	list($location,$tmp) = explode(',',$ul->firstChild->nextSibling->nextSibling->firstChild->nextSibling->nextSibling->textContent,2);
						//	$location=(strlen($wobot['cities'][$location])>0?$wobot['cities'][$location]:$location);
						//}
						$location = $a->textContent;
					}
					if ($a->getAttribute("class")=="region" && strlen($location)==0)
					{
						//if ($ul->firstChild->nextSibling->nextSibling->firstChild->textContent=='Location')
						//{
						//	list($location,$tmp) = explode(',',$ul->firstChild->nextSibling->nextSibling->firstChild->nextSibling->nextSibling->textContent,2);
						//	$location=(strlen($wobot['cities'][$location])>0?$wobot['cities'][$location]:$location);
						//}
						$location = $a->textContent;
					}
				}
				$location=mb_strtolower(strip_tags($location),'UTF-8');
				$location=(strlen($wobot['cities'][$location])>0?$wobot['cities'][$location]:$location);
				//echo '[livejournal.com] nick: "'.$nick.'" location: "'.$location.'"';
			}

			break;
	}
	
	//$tables = $dom->getElementsByTagName("a");
	
	return array($nick,$location);
}
/*
function getnastr($text,$subj)
{
	//$subj=explode(' | ', $subj);
	//$text=ereg_replace("[a-zA-Z]+://([.]?[a-zA-Z0-9_/-])*", "", $text);
	//$text=ereg_replace("([.]?[a-zA-Z0-9_/-])*", "", $text);
	//$text=ereg_replace('/www\.([.]?[a-zA-Z0-9_/-])*\.(ru|tv|com|net)/i', '', $text);
	//echo $text;
	$out=array("хорош","классн","класн","прекрасн","увлекательн","спасиб","активн","перв","победитель","выигрывать","выигрывает","выиграв","выигрыв","интересен","лучш","хорош","познавательн","развивательн","интересн");
	$out1=array("дерьмов","ужасн","плох","неважн","галим","инквизируем","инквизировать","инквизир","слит","профанац");
	$gl=array('а','е','ё','и','о','у','ы','э','ю','я');
	$e_w = array("ая","ею","яя");
	$pos=array();
	$offer=array();
	$j=0;
	$k=0;
	preg_match_all("/\s*(?<phrase>.*?)\s*[\.,!?]/is",$text,$off);
	$offer=$off['phrase'];
	//$voc = file_get_contents('bad.txt');
	//$out1=explode("\n",$voc);
	//$voc1 = file_get_contents('good.txt');
	//$out=explode("\n",$voc1);
	$primary=2;
	$secondary=2;
	$colpositive=0;
	$colnegative=0;
	for ($i=0;$i<=count($offer);$i++)
	{
		$t=$offer[$i];
		$voc_offer=explode(" ",$t);
		//if (in_array($subj,$voc_offer))
		//echo $t.'-'.$subj.'-'.mb_stripos($t,$subj,0,'UTF-8');
		if (mb_stripos($t,$subj,0,'UTF-8')==TRUE)
		{
			//echo 'siski';
			$lastword="";
			foreach ($voc_offer as $value)
			{
				$fpos=0;
				if (($lastword=="ни") || ($lastword=="не"))
				{
					$fpos=1;
				}
				if ($value!='')
				{
					while (in_array(mb_substr($value,mb_strlen($value,'UTF-8')-1,1,'UTF-8'),$gl) && (mb_strlen($value,'UTF-8')>=3)) 
					{
						$value=mb_substr($value,0,mb_strlen($value,'UTF-8')-1,'UTF-8');
					}
				}
				$lastword=$value;
				//echo ':'.$value.':';
				if (in_array($value,$out))
				{
					//echo 'pos';
					if ($fpos==1)
					{
						$colnegative++;
					}
					else
					{
						$colpositive++;
					}
					//echo $value,'  +<br>';
				}
				else
				if (in_array($value,$out1))
				{
					//echo 'neg';
					if ($fpos==1)
					{
						$colpositive++;
					}
					else
					{
						$colnegative++;
					}
					//echo $value,'  -<br>';
				}
			}
		}
	}
	//echo 'отрицательных - ',$colnegative,' положительных - ',$colpositive;
	if ($colpositive>$colnegative) return 1;
	elseif ($colpositive==$colnegative) return 0;
	else return -1;
}
*/
/*
function getnastr($text,$subj)
{	
	$synonims=array("техника" => array("быстродейсв","размер","качеств"), "банки" => array("обслуж","кредит","качеств"));
	$out1=array("хорош","классн","класн","прекрасн","увлекательн","спасиб","активн","перв","победитель","выигрывать","выигрывает","выиграв","выигрыв","интересен","лучш","хорош","познавательн","развивательн","интересн","тащит","вложит","инвестирует","инвестировать","запускать","запущен","полезн","представит","ищет","тащит","вложит","инвестир","инвестировать","запускать","запущен","полезн","крупнейш","ищет","искать","потратит","объявляет","объявляют","выберет","выбирает","выбирают","продвигает","продвигают","запустит","запускают","подготовит","ищет","искать","инвестирует","отсудит","представит","прогрессивных","крупнейш","проводит","выдающийс","успешн","дольш","благородн","покажут","служит","реализуют","реализует","выпускает","вложится","презентовал","начинает","взял","примет","вернет","рожден","порадовал","спонсирует","создает","обеспечить","предложил","принесл","польз","вер","верю","центр","получит","займетс","будут","удовлетворен","поможет","одобрил","планирует","заслуг","запустил","предлагает");
	$out=array("гавн","дерьмов","ужасн","плох","неважн","галим","инквизируем","инквизировать","инквизир","слит","профанац","отклоняет","отмывк","слит","профанац","отклоняет","развал","муть","неудобн","отмывк","отсудит","попал","мало","простебал","стеб","стебал","стремн","спиздил","дыр","дыра","ёпта","пресловут","раскритиковал");
	$gl=array('а','е','ё','и','о','у','ы','э','ю','я','й');
	$e_w = array("ая","ею","яя");
	$arr_word = array("word" => array(), "point" => array(), "endpoint" => array(), "alrused" => array());
	$pos=array();
	$offer=array();
	$j=0;
	$k=0;                                 //TO DO ссылки отбросить, заглавные незаглавные буквы, словарь дополнить.
	$text=strip_tags($text);
	$text=' '.$text;
	if (mb_substr($text,mb_strlen($text,"UTF-8")-1,1,'UTF-8')!='.')
	{
		$text.='.';
	}
	preg_match_all("/\s*(?<phrase>.*?)\s*[\.,!?]/is",$text,$off);
	$offer=$off[phrase];
	foreach ($offer as $oi)
	{
		//echo $oi,"<br>";
	}
	$colpositive=0;
	$colnegative=0;
	for ($i=0;$i<count($offer);$i++)
	{
		$t=$offer[$i];
		//echo $offer[$i];
		$t = mb_convert_case($t, MB_CASE_LOWER, "UTF-8");
		$subj = mb_convert_case($subj, MB_CASE_LOWER, "UTF-8");
		//echo $t;
		$voc_offer=explode(" ",$t);
		if ((mb_stripos($t,$subj,0,'UTF-8')!==FALSE) && ($t!=""))
		{
			//echo "JOPA";
			$lastword="";
			foreach ($voc_offer as $value)
			{
				$fpos=0;
				if (($lastword=="ни") || ($lastword=="не"))
				{
					$fpos=1;
				}
				$lastword=$value;
				if ($value!='')
				{
					while (in_array(mb_substr($value,mb_strlen($value,'UTF-8')-1,1,'UTF-8'),$gl))
					{
						$value=mb_substr($value,0,mb_strlen($value,'UTF-8')-1,'UTF-8');
					}
				}
				//echo "/",$value,"/ ";
				if (in_array($value,$out))
				{
					if ($fpos==1)
					{
						$colnegative++;
					}
					else
					{
						$colpositive++;
					}
				}
				else
				if (in_array($value,$out1))
				{
					if ($fpos==1)
					{
						$colpositive++;
					}
					else
					{
						$colnegative++;
					}
				}
			}
		}
	}
	//echo 'отрицательных - ',$colnegative,' положительных - ',$colpositive;
	if ($colpositive>$colnegative)
	{
		return 1;
	}
	else 
	if ($colnegative>$colpositive)
	{
		return -1;
	} 
	else
	if ($colnegative==$colpositive)
	{
		return 0;
	}
}
*/

function getnastr($text,$subj)
{
       $synonims=array("техника" => array("быстродейсв","размер","качеств"), "банки" => array("обслуж","кредит","качеств"));
//       $out1=array("хорош","классн","класн","прекрасн","увлекательн","спасиб","активн","перв","победитель","выигрывать","выигрывает","выиграв","выигрыв","интересен","лучш","хорош","познавательн","развивательн","интересн","тащит","вложит","инвестирует","инвестировать","запускать","запущен","полезн","представит","ищет","тащит","вложит","инвестир","инвестировать","запускать","запущен","полезн","крупнейш","ищет","искать","потратит","объявляет","объявляют","выберет","выбирает","выбирают","продвигает","продвигают","запустит","запускают","подготовит","ищет","искать","инвестирует","отсудит","представит","прогрессивных","крупнейш","проводит","выдающийс","успешн","дольш","благородн","покажут","служит","реализуют","реализует","выпускает","вложится","презентовал","начинает","взял","примет","вернет","рожден","порадовал","спонсирует","создает","обеспечить","предложил","принесл","польз","вер","верю","центр","получит","займетс","будут","удовлетворен","поможет","одобрил","планирует","заслуг","запустил","предлагает");
//       $out=array("гавн","дерьмов","ужасн","плох","неважн","галим","инквизируем","инквизировать","инквизир","слит","профанац","отклоняет","отмывк","слит","профанац","отклоняет","развал","муть","неудобн","отмывк","отсудит","попал","мало","простебал","стеб","стебал","стремн","спиздил","дыр","дыра","ёпта","пресловут","раскритиковал");
        $out1=array("хорош","классн","класн","прекрасн","увлекательн","спасиб","активн","перв","победитель","выигрывать","выигрывает","выиграв","выигрыв","интересен","лучш","хорош","познавательн","развивательн","интересн","тащит","вложит","инвестирует","инвестировать","запускать",
"запущен","полезн","представит","ищет","тащит","вложит","инвестир","инвестировать","запускать","запущен","полезн","крупнейш","ищет","искать","потратит","объявляет","объявляют","выберет","выбирает","выбирают","продвигает","продвигают","запустит","запускают","подготовит","ищет","искать",
"инвестирует","отсудит","представит","прогрессивных","крупнейш","проводит","выдающийс","успешн","дольш","благородн","покажут","служит","реализуют","реализует","выпускает","вложится","презентовал","начинает","взял","примет","вернет","рожден","порадовал","спонсирует","создает","обеспечить",
"предложил","принесл","польз","вер","верю","центр","получит","займетс","будут","удовлетворен","поможет","одобрил","планирует","заслуг","запустил","предлагает");
        $out=array("гавн","дерьмов","ужасн","плох","неважн","галим","инквизируем","инквизировать","инквизир","слит","профанац","отклоняет","отмывк","слит","профанац","отклоняет","развал","муть","неудобн","отмывк","отсудит","попал","мало","простебал","стеб","стебал","стремн","спиздил","дыр",
"дыра","ёпта","пресловут","раскритиковал","абстрактный","аеслибы","ану","абзац","абзацнутый","аборт","абракадабра","абсурд","абсурдизм","абсцесс","авось","агитатор",
"агитаторский","агитаторша","агитационность","агитационный","агитациЯ","агитирование","агитировать","агница","агницы","агонизированный","агонизировать","агонизирующий"
,"агониЯ","агрессивно","агрессивность","агрессивный","агрессиЯ","ад","аденома","аденомный","адепт","адово","адовый","адски","адский","акселерат","алапездырь","алкаш","алкоголизм","алкоголик","алчность","алчный","амЮба","аморально","аморальность","аморальный","аналище","анекдотически","анекдотический","анекдотичный","аномальный","антинаучно","антинаучность","антинаучный","антинациональный","антиобщественно","антиобщественный","антипатиЯ","антипатриотически","антипатриотический","антипедагогически","антипедагогический","антисанитариЯ","антисанитарный","антисемит","антисемитизм","антисемитка","антисемитский","антисоветский","антихрист","анус","апатический","апатично","апатичность","апатичный","апатиЯ","апездал","аполитично","аполитичность","аполитичный","арбузоЮб","архаично","архаичность","архаичный","атавизм","атавистический","атавистично","афера","аферист","аферистка","ацки","ацтой","баба","бабенка","бабень","бабища","бабский","бабуин","багрила","базарничать","базарный","байда","байда","баклан","баклуш","баклушничать","балабол","балаболить","балаболка","балаганить","балагур","балагурный","балагурство","баламут","баламутить","баламутка","баланда","балбес","балбесничать","балда","балованный","баловень","баловство","бамбуча","банально","банальность","банальщина","барабошка","барабулька","барахлишко","барахло","бардак","баребух","барыга","барыжить","басран","бахвалитьсЯ","бахвалка","бахвальство","баЯн","беда","бедн","бедность","беднота","безвыражениЯ","бездела","бездуши","безинтереса","безтолку","безалаберно","безалаберность","безалаберщина","безвкусие","безвкусица","безвкусный","безвластный","безвольно","безвольность","безвольный","безграмотно","безграмотность","безграмотный","бездар","бездарность","бездарный","безделие","бездельник","бездельничанье","бездельничать","безденежность","безденежный","бездеЯтельный","бездумие","бездумный","бездушие","бездушность","бездушный","безжизненно","безжизненность","безжизненный","безнаказанно","безнаказанность","безнаказанный","безнравственно","безнравственность","безнравственный","безобразно","безобразность","безобразный","безответственность","безответственный","безумец","безумный","безуспешность","безуспешный","безынициативно","безынициативность","безынициативный","бельмо","бескрасочный","бескультурие","бескультурный","беспардонн","беспардонное","бесполезно","бесполезность","бесполезный","беспомощно","беспомощность","беспомощный","беспорЯд","беспорЯдочный","беспредел","беспредельно","беспредельность","беспредельный","беспутье","бессвЯзность","бессвЯзный","бессилие","бесславно","бесславность","бесславный","бессмысленность","бессмыслие","бессмыслица","бессовестно","бессовестность","бестактный","бесхарактерность","бесцельно","бесцельный","бешенный","библиофильство","бландинко","блатнаЯ","блатной","блевать","блевотина","блекло","блеклость","блеклый","близорукий","блудный","блЯд","Ѓ‹џ„€ЌЂ","абстрактн","аеслиб","ану","абзац","абзацнут","аборт","абракадабр","абсурд","абсурдизм","абсцесс","авось","агитатор","агитаторск","агитаторш","агитационность","агитационн","агитац","агитировани","агитировать","агниц","агниц","агонизированн","агонизировать","агонизирующ","агон","агрессивн","агрессивность","агрессивн","агресс","ад","аденом","аденомн","адепт","адов","адов","адск","адск","акселерат","алапездырь","алкаш","алкоголизм","алкоголик","алчность","алчн","амЮб","аморальн","аморальность","аморальн","аналищ","анекдотическ","анекдотическ","анекдотичн","аномальн","антинаучн","антинаучность","антинаучн","антинациональн","антиобщественн","антиобщественн","антипат","антипатриотическ","антипатриотическ","антипедагогическ","антипедагогическ","антисанитар","антисанитарн","антисемит","антисемитизм","антисемитк","антисемитск","антисоветск","антихрист","анус","апатическ","апатичн","апатичность","апатичн","апат","апездал","аполитичн","аполитичность","аполитичн","арбузоЮб","архаичн","архаичность","архаичн","атавизм","атавистическ","атавистичн","афер","аферист","аферистк","ацк","ацт","баб","бабенк","бабень","бабищ","бабск","бабуин","багрил","базарничать","базарн","байд","байд","баклан","баклуш","баклушничать","балабол","балаболить","балаболк","балаганить","балагур","балагурн","балагурств","баламут","баламутить","баламутк","баланд","балбес","балбесничать","балд","балованн","баловень","баловств","бамбуч","банальн","банальность","банальщин","барабошк","барабульк","барахлишк","барахл","бардак","баребух","барыг","барыжить","басран","бахвалитьс","бахвалк","бахвальств","баян","бед","бедн","бедность","беднот","безвыражен","бездел","бездуш","безинтерес","безтолку","безалаберн","безалаберность","безалаберщин","безвкуси","безвкусиц","безвкусн","безвластн","безвольн","безвольность","безвольн","безграмотн","безграмотность","безграмотн","бездар","бездарность","бездарн","бездели","бездельник","бездельничань","бездельничать","безденежность","безденежн","бездеятельн","бездуми","бездумн","бездуши","бездушность","бездушн","безжизненн","безжизненность","безжизненн","безнаказанн","безнаказанность","безнаказанн","безнравственн","безнравственность","безнравственн","безобразн","безобразность","безобразн","безответственность","безответственн","безумец","безумн","безуспешность","безуспешн","безынициативн","безынициативность","безынициативн","бельм","бескрасочн","бескультури","бескультурн","беспардонн","беспардонно","бесполезн","бесполезность","бесполезн","беспомощн","беспомощность","беспомощн","беспоряд","беспорядочн","беспредел","беспредельн","беспредельность","беспредельн","беспуть","бессвязность","бессвязн","бессили","бесславн","бесславность","бесславн","бессмысленность","бессмысли","бессмыслиц","бессовестн","бессовестность","бестактн","бесхарактерность","бесцельн","бесцельн","бешенн","библиофильств","бландинк","блатна","блатн","блевать","блевотин","блекл","блеклость","блекл","близорук","блудн","бляд","Ѓ‹џ„€ЌЂ","Ѓ‹џ„ЋѓЋЌ","Ѓ‹џ„‘Љ€‰","Ѓ‹џ„‘’‚Ћ","болезнь","болтлив","больн","боян","бранить","брань","буйн","бухать","вафлит","вероломн","виноват","виновн","водянист","воин","вонь","воспрещать","враг","вражд","врань","враньЮ","вред","вредин","вредн","временн","вталкивать","‚торойнах","вульгарн","выбежать","‚›Ѓ‹џ„ЋЉ","выбросил","вывернуть","выдвигатьс","выдуманн","выебать","‚›…ЃЋЌ","‚›ЭЃ›‚Ђ…’‘џ","выключать","выкрутить","вымысел","вымышленн","выпихивать","выскочк","выступать","выталкивать","выфрендить","гавнецк","гавн","гавнярищ","гад","гаденыш","гадин","гадк","гандон","гасить","гаснуть","геданист","гедонист","геморр","гибельн","глист","глупец","глуп","глуп","гнев","гневн","гнойник","говн","голгоф","голод","голодн","гомосек","гор","горевать","горесть","горечь","горьк","грешн","груб","грузн","грустить","грустн","грязн","грязь","даун","дебил","дерьм","„…ђњЊЋ•…ђЋЏ€‡„ЋЉђЂ’","„…ђњЊЋ•…ђЋЏ€‡„ЋЉђЂ’€џ","дефицит","дешЮв","дибил","дибильн","дисгармон","долбанн","долбан","дорог","дрючить","дрябл","дурак","дурацк","дурн","ебанут","ебать","ебнут","Юбнут","ебт","елд","ерунд","жадн","жалк","жЮстк","жидк","жирдяй","жирн","жиртрест","заболевать","заебал","заебал","закат","закатыватьс","закрывать","залуп","заносчив","занят","заплакать","запрещать","засранец","затаЮнн","заурядн","заходить","зл","зл","злополучн","зн","издеватьс","излишек","измен","изменник","изменчив","измыватьс","имбицил","инертн","исключать","искривлять","искусственн","исчезать","кажущийс","карав","карлик","карликов","кастрировать","клоун","конец","конч","кончан","кончать","конченн","кончен","корить","коряв","костляв","кострировать","красть","кривд","крив","крив","криклив","кутил","ладЮв","лаж","лажев","лажов","лев","лев","легкомысленн","ледян","ленит","лентяй","ленятс","лжив","лицемерн","лишил","ложн","ложь","‹Ћ‹","ломаетс","лох","лошар","мал","Њанд","марк","материтьс","матерн","мелк","мертв","мизерн","микроскопическ","мним","многословн","молчалив","мороз","мрак","мрачн","мудак","мук","наруку","наврал","наврать","назад","нарушать","нахуй","некместу","неоправдывать","неправд","неработает","неаккуратн","неблагозвучи","невежд","невежеств","невежлив","невежлив","невезени","невери","неверн","неверность","неверн","невесЮл","невкусн","невозможн","невпопад","невысок","негодн","негодн","неграмотн","неграмотн","недалЮк","недальновидн","недобросовестн","недовер","недовери","недовольн","недоносок","недоработанн","недоработан","недоработк","недоработк","недоразвит","недостаток","недостойн","недостойн","недруг","нежив","незаконн","незаслуженн","нездоров","незнаком","незнани","незначительн","незнающ","неизвестн","неинтересн","неискренн","некомпетент","некомпетентн","некомпитент","некорректн","некрасив","некрепк","некрепк","некстат","некудышн","некультурн","немощн","ненастоящ","неопрятн","неподвижность","непокладист","непокорн","непорядок","непослушн","непостоянн","непохож","неправд","неправильность","неправильн","непрактичн","непрактичн","непригодн","неприличн","неприязнь","неприятн","неприятн","непроизводительн","неразборчив","неразговорчив","нерасположени","нередк","неряшлив","несговорчив","несговорчив","несерьЮзн","несловоохотлив","несмел","несовершенн","несовершенств","несообразительн","несправедлив","несчастлив","несчастн","несчасть","нетактичн","нетвЮрд","нетолерантн","неуверенн","неудач","неудачлив","неудачн","неудобн","неудобн","неумн","неучтив","нехватк","нечЮтк","нечист","неюзабл","неярк","неясн","низ","низк","никт","никчемн","никчЮмн","ничт","ничтожн","нищет","нужд","обвинять","облажались","облажалс","обленил","обман","обманчив","обманщик","обманывать","обременять","огорчать","огорчатьс","ограниченн","однобок","однообразн","однотонн","одноцветн","олигофрен","опускать","опускатьс","опьянять","осень","ослабеть","осуждать","осуждени","отвлечЮнн","отвратительн","отвращени","отдалять","отдалятьс","отдрючить","отказ","отказались","отказатьс","отказывать","отключать","отрицательн","отрицать","отсосн","отставать","отстал","отстал","отстают","отст","отстойник","отстойн","отступать","отсутстви","отталкивать","отъебать","оцк","ошибочность","ошибочн","ошибс","падаль","падать","падл","падл","палевн","паскуд","пасмурн","пассивн","педераст","педофил","пердун","перевирать","переврал","переменн","пессимизм","печалить","печалитьс","печаль","печальн","пидар","пидарас","пидор","пидорас","пизд","пиздеть","пиздить","пиздовать","письк","плакать","плач","плох","плох","поверхностн","подавлять","поддельн","подсмотрел","подстав","подставлять","поздн","понижать","понижатьс","поражени","порвать","порицани","порицать","порожн","порознь","порок","последн","потерял","потерять","потерятьс","потухать","предатель","предательств","предвзят","пресловут","преувеличивать","преуменьшать","принижать","притворн","провал","провожать","продавать","продались","проигрывает","пропадать","пропасть","пропустил","пропустить","проститутк","противник","прошлвек","проштрафитьс","пуст","пьян","пьянь","развод","разводить","разворовал","разлук","разобщать","разрушать","разъединять","расслабились","расстраивать","расстраиватьс","растратить","редк","робк","робость","ругать","ругатьс","рыдать","садист","садитьс","самонадеянн","сдал","скованн","скопировал","скорбеть","скорбь","скотин","скрыватьс","скуп","скучн","слабоват","слабость","слаб","слизнуть","сложн","сломалс","сломатьс","смазлив","смерть","сокращать","сомневатьс","сохнуть","спер","спереть","сперл","спуск","старинн","старпер","стар","стираютс","стормозил","страдани","страдать","строптив","стырил","стырит","суживать","сук","сучар","сцук","сыр","таять","темнот","темн","тень","терроризм","террорист","терять","тесн","толстеть","толст","топорн","тормоз","тормозн","тощ","трахнуть","трудн","трус","труслив","тупа","туп","туп","тускл","тухнуть","тучн","тырить","тьм","тяжел","тяжЮл","“блюдокК","“блюдокК","уебок","уЮбок","украл","укурок","умалять","умирать","унижать","унизит","уныл","урод","уродлив","уступил","утрировать","ушлЮпок","фантазер","фашист","фигн","фигов","формальн","хам","хаос","херхрен","херь","хил","хил","хиляк","холод","холодн","холодн","хренов","хренов","хренов","хрень","худ","хуеплет","хуеплЮт","хуж","хуй","хул","хулить","чекнут","чЮкнут","чужбин","чуж","шалав","шарлатан","шах","шибанут","шкодить","шкурник","шкурничать","шлюх","шрлотан","шум","щегол","щеголеват","эгоист","экзекуц","дибильный","дисгармониЯ","долбанный","долбаный","дорого","дрючить","дрЯблый","дурак","дурацкий","дурной","ебанутый","ебать","ебнутый","Юбнутый","ебт","елда","ерунда","жадн","жалкий","жЮсткий","жидкий","жирдЯй","жирный","жиртрест","заболевать","заебал","заебали","закат","закатыватьсЯ","закрывать","залупа","заносчивый","занЯтый","заплакать","запрещать","засранец","затаЮнный","заурЯдный","заходить","зло","злой","злополучный","зной","издеватьсЯ","излишек","измена","изменник","изменчивый","измыватьсЯ","имбицил","инертный","исключать","искривлЯть","искусственный","исчезать","кажущийсЯ","каравый","карлик","карликовый","кастрировать","клоун","конец","конча","кончаный","кончать","конченный","конченый","корить","корЯвый","костлЯвый","кострировать","красть","кривда","криво","кривой","крикливый","кутила","ладЮвый","лажа","лажевый","лажовый","левый","левый","легкомысленный","ледЯной","ленит","лентЯй","ленЯтсЯ","лживый","лицемерный","лишил","ложный","ложь","‹Ћ‹","ломаетсЯ","лох","лошара","мало","Њанда","маркий","материтьсЯ","матерный","мелкий","мертвый","мизерный","микроскопический","мнимый","многословный","молчаливый","мороз","мрак","мрачный","мудак","мука","наруку","наврали","наврать","назад","нарушать","нахуй","некместу","неоправдывать","неправда","неработает","неаккуратный","неблагозвучие","невежда","невежество","невежливый","невежливый","невезение","неверие","неверн","неверность","неверный","невесЮлый","невкусный","невозможно","невпопад","невысокий","негодный","негодный","неграмотный","неграмотный","недалЮкий","недальновидный","недобросовестный","недовер","недоверие","недовольный","недоносок","недоработанный","недоработаный","недоработка","недоработка","недоразвитый","недостаток","недостойний","недостойно","недруг","неживой","незаконный","незаслуженный","нездоровый","незнакомый","незнание","незначительный","незнающий","неизвестный","неинтересный","неискренний","некомпетент","некомпетентный","некомпитент","некорректный","некрасивый","некрепкий","некрепкий","некстати","некудышный","некультурный","немощный","ненастоЯщий","неопрЯтный","неподвижность","непокладистый","непокорный","непорЯдок","непослушный","непостоЯнный","непохожий","неправда","неправильность","неправильный","непрактичн","непрактичный","непригодный","неприличный","неприЯзнь","неприЯтнее","неприЯтный","непроизводительный","неразборчивый","неразговорчивый","нерасположение","нередкий","нерЯшливый","несговорчивый","несговорчивый","несерьЮзный","несловоохотливый","несмелый","несовершенный","несовершенство","несообразительный","несправедливый","несчастливый","несчастный","несчастье","нетактичный","нетвЮрдый","нетолерантный","неуверенный","неудача","неудачливый","неудачный","неудобнее","неудобный","неумный","неучтивый","нехватка","нечЮткий","нечистый","неюзабл","неЯркий","неЯсный","низ","низкий","никто","никчемный","никчЮмный","ничто","ничтожный","нищета","нужда","обвинЯть","облажались","облажалсЯ","обленил","обман","обманчивый","обманщики","обманывать","обременЯть","огорчать","огорчатьсЯ","ограниченный","однобокий","однообразный","однотонный","одноцветный","олигофрен","опускать","опускатьсЯ","опьЯнЯть","осень","ослабеть","осуждать","осуждение","отвлечЮнный","отвратительный","отвращение","отдалЯть","отдалЯтьсЯ","отдрючить","отказ","отказались","отказатьсЯ","отказывать","отключать","отрицательный","отрицать","отсосный","отставать","отстали","отсталый","отстают","отстой","отстойник","отстойный","отступать","отсутствие","отталкивать","отъебать","оцки","ошибочность","ошибочный","ошибсЯ","падаль","падать","падла","падло","палевный","паскуда","пасмурный","пассивный","педераст","педофил","пердун","перевирать","переврал","переменный","пессимизм","печалить","печалитьсЯ","печаль","печальный","пидар","пидарас","пидор","пидорас","пизда","пиздеть","пиздить","пиздовать","писька","плакать","плач","плох","плохой","поверхностный","подавлЯть","поддельный","подсмотрели","подстава","подставлЯть","поздний","понижать","понижатьсЯ","поражение","порвать","порицание","порицать","порожний","порознь","порок","последний","потерЯл","потерЯть","потерЯтьсЯ","потухать","предатель","предательство","предвзЯтый","пресловутый","преувеличивать","преуменьшать","принижать","притворный","провал","провожать","продавать","продались","проигрывает","пропадать","пропасть","пропустили","пропустить","проститутка","противник","прошлыйвек","проштрафитьсЯ","пустой","пьЯный","пьЯнь","развод","разводить","разворовал","разлука","разобщать","разрушать","разъединЯть","расслабились","расстраивать","расстраиватьсЯ","растратить","редкий","робкий","робость","ругать","ругатьсЯ","рыдать","садист","садитьсЯ","самонадеЯнный","сдали","скованный","скопировали","скорбеть","скорбь","скотина","скрыватьсЯ","скупой","скучный","слабоват","слабость","слабый","слизнуть","сложный","сломалсЯ","сломатьсЯ","смазливый","смерть","сокращать","сомневатьсЯ","сохнуть","спер","спереть","сперли","спуск","старинный","старпер","старый","стираютсЯ","стормозили","страдание","страдать","строптивый","стырили","стырит","суживать","сука","сучара","сцуко","сырой","таЯть","темнота","темный","тень","терроризм","террорист","терЯть","тесный","толстеть","толстый","топорный","тормоз","тормозной","тощий","трахнуть","трудный","трус","трусливый","тупаЯ","тупее","тупой","тусклый","тухнуть","тучный","тырить","тьма","тЯжелее","тЯжЮлый","“блюдокК","“блюдокК","уебок","уЮбок","украл","укурок","умалЯть","умирать","унижать","унизит","унылый","урод","уродливый","уступил","утрировать","ушлЮпок","фантазеры","фашист","фигнЯ","фиговый","формально","хам","хаос","херхрен","херь","хилый","хилый","хилЯк","холод","холодно","холодный","хренов","хреново","хреновый","хрень","худой","хуеплет","хуеплЮт","хуже","хуй","хула","хулить","чекнутый","чЮкнутый","чужбина","чужой","шалава","шарлатан","шаха","шибанутый","шкодить","шкурник","шкурничать","шлюха","шрлотан","шум","щегол","щеголеватый","эгоист","экзекуциЯ");

       $gl=array('а','е','ё','и','о','у','ы','э','ю','я','й');
       $e_w = array("ая","ею","яя");
       $arr_word = array("word" => array(), "point" => array(), "endpoint" => array(), "alrused" => array());
       $pos=array();
       $offer=array();
       $j=0;
       $k=0; //TO DO ссылки отбросить, заглавные незаглавные буквы, словарь дополнить.
       $text=strip_tags($text);
       $text=' '.$text;
       if (mb_substr($text,mb_strlen($text,"UTF-8")-1,1,'UTF-8')!='.')
       {
               $text.='.';
       }
       preg_match_all("/\s*(?<phrase>.*?)\s*[\.,!?]/is",$text,$off);
       $offer=$off[phrase];
       foreach ($offer as $oi)
       {
               //echo $oi,"<br>";
       }
       $colpositive=0;
       $colnegative=0;
       $sub=explode(" | ",$subj);
       for ($i=0;$i<count($offer);$i++)
       {
           $t=$offer[$i];
           //echo $offer[$i];
           foreach ($sub as $su)
           {
               $t = mb_convert_case($t, MB_CASE_LOWER, "UTF-8");
                       $su = mb_convert_case($su, MB_CASE_LOWER, "UTF-8");
                       //echo 1;
               if ($su!='')
               {
                   while (in_array(mb_substr($su,mb_strlen($su,'UTF-8')-1,1,'UTF-8'),$gl))
                   {
                       $su=mb_substr($su,0,mb_strlen($su,'UTF-8')-1,'UTF-8');
                   }
               }
               //echo $su;
                       //echo $t;
               $voc_offer=explode(" ",$t);
               if ((mb_stripos($t,$su,0,'UTF-8')!==FALSE) && ($t!=""))
               {
                   //echo "JOPA";
                   $lastword="";
                   foreach ($voc_offer as $value)
                   {
                       $fpos=0;
                       if (($lastword=="ни") || ($lastword=="не"))
                       {
                           $fpos=1;
                       }
                       $lastword=$value;
                       if ($value!='')
                       {
                           while (in_array(mb_substr($value,mb_strlen($value,'UTF-8')-1,1,'UTF-8'),$gl))
                           {
                               $value=mb_substr($value,0,mb_strlen($value,'UTF-8')-1,'UTF-8');
                           }
                       }
                       //echo "/",$value,"/ ";
                       if (in_array($value,$out))
                       {
                               //echo "-";
                               if ($fpos==1)
                               {
                                   $colnegative++;
                               }
                           else
                               {
                                   $colpositive++;
                                   //echo "+|+";
                               }
                           }
                           else
                           if (in_array($value,$out1))
                           {
                               //echo "+";
                                   if ($fpos==1)
                               {
                                   $colpositive++;
                               }
                               else
                               {
                                   $colnegative++;
                               }
                           }
                       }
               }
           }
       }
       //echo 'отрицательных - ',$colnegative,' положительных - ',$colpositive;
       if ($colpositive>$colnegative)
       {
               return 1;
       }
       else
       if ($colnegative>$colpositive)
       {
               return -1;
       }
       else
       if ($colnegative==$colpositive)
       {
               return 0;
       }
}


// metrics functions ////////////////////////////////////////////////////////////////
function speakers($posts)
{
       $out=array("num" => array(), "nick" => array(), "posts" => array());
       foreach ($posts as $post)
       {
               $ii=array_search($post["nick"],$out["nick"]);
               if (($ii!==false) && ($post["nick"]!=""))
               {
                       $out["posts"][$ii]++;
               }
               else
               if (($ii!==true) && ($post["nick"]!=""))
               {
                       $out["num"][count($out["num"])]=count($out["num"]);
                       $out["nick"][count($out["num"])]=$post["nick"];
                       $out["posts"][count($out["num"])]=1;
               }
       }
       array_multisort($out["posts"],SORT_DESC,
       $out["nick"],SORT_DESC);
		unset($out["num"]);
       return $out;
}

function value($posts)
{
       $fol=array();
       $col=0;
       foreach ($posts as $post)
       {
               if (!in_array($post["readers"],$fol))
               {
                       $col+=$post["readers"];
                       $fol[count($fol)]=$post["readers"];
               }
       }
       return $col;
}

function promotion($posts)
{
       $out=array("num" => array(), "nick" => array(), "posts" => array(), "readers" => array());
       foreach ($posts as $post)
       {
               if (in_array($post["readers"],$out["readers"]) && ($post["readers"]!=""))
               {
                       /*for ($i=0;$i<=count($out["num"]);$i++)
                       {
                               if ($out["readers"][$i]==$post["readers"])
                               {
                               }
                       }*/
               }
               else
               if ((!in_array($post["nick"],$out["nick"])) && ($post["nick"]!=""))
               {
                       $out["num"][count($out["num"])]=count($out["num"]);
                       $out["nick"][count($out["num"])]=$post["nick"];
                       $out["posts"][count($out["num"])]=1;
                       $out["readers"][count($out["num"])]=$post["readers"];
               }
       }
       array_multisort($out["readers"],SORT_DESC,
       $out["nick"],SORT_DESC);
		unset($out["num"]);
       return $out;
}

// eof metrics /////////////////////////////////////////////////////////////////
?>
