<?
require_once('/var/www/daemon/com/config.php');
require_once('/var/www/daemon/com/func.php');
require_once('/var/www/daemon/com/db.php');
require_once('/var/www/daemon/bot/kernel.php');
require_once('/var/www/daemon/com/tmhOAuth.php');
require_once('/var/www/daemon/com/vkapi.class.php');

$db = new database();
$db->connect();
date_default_timezone_set ( 'Europe/Moscow' );
$fem=array('виргиния','аврора','агата','агафья','агнесса','агния','ада','аза','алевтина','александра','алина','алиса','алла','альбина','альфреа','анастасия','ангелина','анжелика','анжела','анита','анна','антонина','анфиса','арина','астра','беата','белла','берта','бета','богдана','борислава','бронислава','валентина','валерия','ванда','варвара','василиса','венера','вера','вероника','веста','виктория','виолетта','виталина','виталия','галина','гелена','гелла','генриетта','гертруда','глафира','глория','дайна','данута','дарья','джульета','диана','дина','доля','доминика','ева','евгения','евдокия','екатерина','елена','елизавета','жанна','зинаида','зоя','иветта','изабелла','изольда','инара','инга','инесса','инна','ирина','ирма','ия','камилла','капитолина','карина','каролина','катарина','кира','клавдия','клара','кристина','ксения','кузьма','козьма','лада','лайма','лариса','леся','лиана','лидия','лилия','лилиана','лина','лиана','лола','лолла','лолита','людмила','майя','маргарита','марианна','марина','мария','марта','марфа','милена','мирдза','мирра','муза','надежда','наталия','неонила','нила','никита','нина','нонна','нора','оксана','олеся','ольга','полина','прасковья','раиса','регина','рина','рената','римма','роза','розалия','роксана','руслана','руфина','савва','сарра','сара','светлана','серафима','софия','станислава','стелла','стефания','сусанна','сюзанна','таира','таисия','тамара','тамила','томила','татьяна','ульяна','фаина','фекла','флора','фома','франсуаза','фрида','христина','эдита','элеонора','эллина','эвелина','элина','эльвира','эльза','эмма','эмилия','эрика','юлия','юнона','ядвига','яна','ярослава');
$mail=array('абрам','авраам','ибрагил','аввакум','аввакуум','август','августин','аверьян','аверкий','агафон','адам','адольф','адриан','азарий','аким','алан','александр','алексей','альберт','альфред','анатолий','андрей','антон','аполлон','аристарх','аркадий','арнольд','арсений','арсен','артем','артур','архип','аскольд','афанасий','бенедикт','богдан','болеслав','борис','бронислав','вадим','валентин','валерий','вальтер','варлаам','варлам','василий','велор','велорий','венедикт','вениамин','виктор','вилен','вилли','виссарион','виталий','витольд','владимир','владислав','владлен','влас','власий','вольдемар','всеволод','вячеслав','гавриил','гарри','гаянэ','геннадий','георгий','герасим','герман','глеб','гордей','гордей','гордий','григорий','гурий','давид','даниил','демьян','денис','дмитрий','дональд','донат','евгений','евдоким','егор','елисей','емельян','ермак','ермолай','ефим','ефрем','захар','зиновий','иван','игнат','игнатий','игорь','илларион','илья','иннокентий','иосиф','осип','ипполит','ираклий','исаак','исак','казимир','карл','касьян','кассиан','ким','кирилл','клемент','клим','климент','кондрат','кондратий','константин','корней','корнелий','лавр','лаврентий','лазарь','лев','леонард','леонид','леонтий','лука','лукьян','любовь','любомир','людвиг','май','макар','максим','максимилиан','марк','мартин','мартын','матвей','мечеслав','мечислав','мирон','мирослав','митрофан','михаил','модест','моисей','мстислав','назарий','натан','наум','нелли','никифор','николай','нинель','нисон','овидий','олег','орест','осип','оскар','остап','павел','панкрат','панкратий','пантелей','пантелеймон','парамон','петр','платон','прохор','роберт','родион','роман','ростислав','рубен','рудольф','руслан','савелий','самуил','святослав','севастьян','семен','сергей','соломон','станислав','степан','тарас','терентий','тимофей','тимур','тихон','трофим','устин','юстин','юстиниан','федор','феликс','филипп','фрол','флор','харитон','эдуард','эльдар','эрик','эрнест','юлий','юлиан','юрий','яков','ян','ярослав','алекс');
$arrgen['female']=1;
$arrgen['male']=2;

function get_blog($nick) 
{
	global $db,$fem,$mail,$arrgen;
	do
	{
		$cont=parseUrlproxy('http://'.$nick.'.blog.ru/profile');
		if ($cont=='')
		{
			$attmp++;
			echo "\n".'continue...'."\n";
		}
	}
	while (($cont=='') && ($attmp<3));	
	//$cont=parseUrl('http://'.$nick.'.blog.ru/profile');
	//echo $cont;
	$regex='/(?<age>\d+)\&nbsp;(год|лет)/isu';
	preg_match_all($regex,$cont,$out);
	$outmas['age']=intval($out['age'][0]);
	$regex='/(<b>)?(?<fol>\d+)(<\/b>)?(\&nbsp;|\s)читател/isu';
	preg_match_all($regex,$cont,$out);
	$outmas['fol']=intval($out['fol'][0]);
	$regex='/class="big\_(?<gen>.*?)"/isu';
	preg_match_all($regex,$cont,$out);
	$outmas['gender']=$arrgen[$out['gen'][0]];
	$regex='/<p id="(tox\-location|min\-location)">(?<loc>.*?)<\/p>/isu';
	preg_match_all($regex,$cont,$out);
	$outmas['loc']=trim($out['loc'][0]);
	$loc=$out['loc'][0];
	if ($loc!='')
	{
		$rru=$db->query("SELECT * FROM robot_location WHERE loc='".$loc."'");
		if (mysql_num_rows($rru)==0)
		{
			$content_tw_loc=parseUrl('http://geocode-maps.yandex.ru/1.x/?geocode='.urlencode($loc).'&key=ANpUFEkBAAAAf7jmJwMAHGZHrcKNDsbEqEVjEUtCmufxQMwAAAAAAAAAAAAvVrubVT4btztbduoIgTLAeFILaQ==&results=1');
			$regextw='/<pos>(?<loc_tw>.*?)<\/pos>/is';
			preg_match_all($regextw,$content_tw_loc,$out_tw);
			$rru=$db->query('INSERT INTO robot_location (loc,loc_coord) VALUES (\''.$loc.'\',\''.$out_tw['loc_tw'][0].'\')');
		}
		else
		{
			$rru1=$db->fetch($rru);
			$out_tw['loc_tw'][0]=$rru1['loc_coord'];
		}
	}
	if ($out_tw['loc_tw'][0]!='')
	{
		$regex='/(?<ch>\-?\d*?)\.(?<d>\d)/is';
		//echo $key;
		preg_match_all($regex,$out_tw['loc_tw'][0],$out);
		$twl=$out['ch'][0].'.'.$out['d'][0].' '.$out['ch'][1].'.'.$out['d'][1];
	}
	$outmas['loc']=$twl;
	$regex='/<div id="(tox|min)-name">.*?<strong>(?<name>.*?)<\/strong>.*?<\/div>/isu';
	preg_match_all($regex,$cont,$out);
	$outmas['name']=(trim($out['name'][0])==''?$nick:trim($out['name'][0]));
	$outmas['nick']=$nick;
	//print_r($outmas);
	//sleep(1);
	return $outmas;
}

//get_blog('tohia');
?>